{
    "@stevecase": "RT @Entrepreneur: 10 Successful Entrepreneurs on How to Be Awesome http://t.co/rAcElaIOrF by @jwfellRT @CaseFoundation: .@JeanCase thinks that learning the \"art of the pivot\" is essential for social entrepreneurs. http://t.co/6CtGV51p93 #s…RT @StartupWeekend: The Fading American Dream - A look at Startup Weekend Immigration Edition http://t.co/sE4TFjRGUW via @teleportincRT @CapitalBiz: Why the Olympics Washington didn’t win could still transform the city http://t.co/Ky7hjEAHPRRT @revolution: Why @SteveCase hates @Soylent, and why it means Revolution is still serious about food http://t.co/KaX5pKnuJv #foodfightRT @ashokaus: What are the characteristics of thriving #SocEnts? @jeancase from @CaseFoundation shares her insights! https://t.co/uZ8fAXf8y…RT @startuphealth: \"I want #entrepreneurs focused on hard problems and to have a \"built to last\" mentality.\" Watch @stevecase now. http://t…RT @EarlyMountain: Looking to make a weekend trip within driving distance of DC? Check out this list from the @ThrillistDC. http://t.co/5GM…RT @OmidyarNetwork: Being able to adapt to changing circumstances is especially important for #socent: http://t.co/3v3gd6lTV9 HT @CaseFound…RT @USAgov: This summer, plan a visit to to a @smithsonian museum. Most are free and perfect for a family day. #ILoveMuseums http://t.co/VH…RT @jeancase: \"Get ready,\" says @SteveCase, \"the Internet is about to change.\" http://t.co/IpIREvnHocRT @revolution: Huge congrats to #RiseOfRest winner @partpic for (also) winning the #3686South pitch competition http://t.co/rP0vUUUr60 @36…RT @EphTweets: You know what it means when you see this sign: #ephreunion2015 https://t.co/7dzw0j1NW9RT @NatGeo: The sun sets over a beach in Maui: http://t.co/5BgK4zlAeh http://t.co/LcRZHw8B4FRT @cornyn: 20 Challenger Companies to Watch Including Our @revolutionfoods http://t.co/UizgfXcx4QRT @richardbranson: Watch this moving performance about Detroit, the city that continues to call the world's bluff http://t.co/m4aPWUg3PG h…RT @revolution: Watch @SteveCase on @CNBC discussing why food is ripe for disruption http://t.co/w3VRhgsAsz @soylent @sweetgreen @Revolutio…RT @OlympicsView: Why the Olympics Washington didn't win could still transform the city - Washington Post http://t.co/cSGvEVErVJRT @amhistorymuseum: #BusinessHistory opens July 1. It's dramatic: labor, power, wealth, success, and failure. http://t.co/kj7L7H5AGA http:…RT @Entrepreneur: A Rising Tide Raises All Entrepreneurs http://t.co/DNTUbWlIVb by @CoachBruRT @startuphealth: \"Health is one‑sixth of our economy and it doesn’t work so well.\" @stevecase has more on transforming #healthcare http:/…RT @CaseFoundation: Learning the \"art of the pivot\" is essential for social entrepreneurs. http://t.co/6CtGV51p93   #socentAbout to go live on @CNBC to discuss revolution in food and next phase for Twitter\"By passing TPA, House Republicans can achieve a fine trifecta\" @georgewillf http://t.co/Ko8Z2nZeXJRT @NatGeo: How cell phones can help end world hunger: http://t.co/S2PFvo2ZOz #FutureofFoodRT @RonaldKlain: Per @WBJonline:  @SteveCase v. @soylent, on the future of food.  (Hint:  It's food.)  http://t.co/FjNKryWT2uRT @CaseFoundation: We are #soproud of @jeancase who was presented with a lifetime achievement award from @HarvardHBS DC Club this eve! htt…So proud to be with @JeanCase as she accepts @HarvardHBS Lifetime Achievement award tonight in #DC http://t.co/E7OZIvIQi8\"Millennial's are a big challenge for us\" Bill Marriott speaks to @HarvardHBS about evolving @MarriottIntl #DCtech http://t.co/nHpNSu9D52\"We are super excited by what is happening in DC, especially in startup community\" @JeanCase #DCtech @CaseFoundation http://t.co/eIKbDtgmpYRT @thirdmetric: 45 pieces of wisdom from this year's commencement speeches http://t.co/EUZPktTEkcRT @StanfordBiz: \"Unplug and Recharge: How Spending Time in Nature Can Change Your Life\" from @brooksbarron11 (MBA ’15) http://t.co/RnO0y1n…RT @VVFriedman: On breaking up with my Apple Watch - http://t.co/Egticd89KBRT @jeremysliew: .@stevecase says \"Food is social. The future of food is food. (Not Soylent, Schmoylent or Schmilk).\" I agree. http://t.co/…RT @NatGeoExplorers: \"Without nature, there is no life,\" says Virunga National Park warden and 2015 Emerging Explorer @imburanumwe  #LetsEx…RT @danprimack: Something is rotting under Silicon Valley http://t.co/b8qPETxjly http://t.co/y5MTei08xbRT @internetsociety: The #InternetAge panel will be webcast here, friends! Check out what the panelists have to say!  http://t.co/oYaetEks8pRT @KauffmanFDN: How do we create more entrepreneurs? http://t.co/JArImbEdr2RT @gorillacd: Don't miss panel w/ #Virunga's Park Director, Emmanuel &amp; Southern Sector Warden, Innocent today! Stream live @ 1.30ET http:/…RT @Forbes: 30% of the 50 most successful self-made women in America are immigrants: http://t.co/WUiYjD0BlH20 Challengers to Watch http://t.co/Lwy5OVsM9Y \"Get to know the brands &amp; people grabbing our attention\" @RevolutionFoodsRT @EconBizFin: Politics aside, the prospects for a clean-energy future have never looked brighter http://t.co/3c3kXJXZC0 http://t.co/QAC4F…RT @TIMEIdeas: Albert Einstein's secret to learning: http://t.co/SH90HNoihART @MarcGunther: Authenticity: The future of food Is food, writes @SteveCase. Not Soylent. http://t.co/Fj1yjq1aZIRT @BBCAfrica: 'Oil firm paid Congo soldier' accused of Virunga park intimidation http://t.co/PEDt2ZRa2b http://t.co/256HNrwLL3RT @TEDTalks: \"Real inspiration and growth only comes from stepping out into the unknown.\" http://t.co/mhUP97kkstRT @PsychToday: When it comes to getting kids to feel comfortable with failure, it’s best to start early. http://t.co/pBebmDfdSNRT @jseiken: I’ve seen the future of food &amp; it is not Soylent. It is not Schmoylent or Schmilk, either. True/clever via @stevecase http://t…\"Some investors have essentially abandoned risk analysis out of fear they might miss out on next big thing\" http://t.co/f5Qjv19Alx @bgurleyRT @TIME: Revisit 25 moments that changed America http://t.co/nSE8Y4LiM6", 
    "@davemcclure": "@jasonlk congrats jason, but most of us aren't that good :) @chancebar @crowdfunder @RafeFurstRT @ArlanWasHere: NEW POST: Dear White Venture Capitalists… https://t.co/n0kE5JeYiN … @sacca @davemcclure @bfeld @pmarca @bhorowitz@loyalelectron congrats &amp; good luck Colleen :)@DanielleMorrill thx D :)@Samirkaji thx samir! 😀👍🏼🍀RT @KateDMitchell: Glad to see this picture of successful VCs @davemcclure #premoney @hametwatt @chudson @MarlonCNichols @SLP_EDU @nvca htt…@MKRocks thanks michael! so glad you could join us :)@codysimms thx Cody!RT @500Startups: Out with the Old, In With the Govtech: http://t.co/7k8LJf4vtq Ron Bouganim @GovtechFund #PreMoney http://t.co/wgbmNt9CmgRT @500Startups: How To: Select Companies (Counterintuitive Insights From A VC With Eight $1B+ Unicorns, 29 $100M+ Centaurs) @asenkut http:…RT @samanthassiow: \"Your value add is the reason why people will take money from you.\" - @jeff #premoney http://t.co/6E6w6thQ3CRT @500Startups: \"Only 3% of unicorns are first time founders.\" @beaulaskey #premoneyRT @500Startups: \"Board seats are there to provide value\"- @shadimeh \"Bullshit, they're there to have control\"- @davemcclure #Premoney http…RT @KateDMitchell: #Diversity is a strength for us not an afterthought  #premoney @asenkut @felicisventures @500Startups @davemcclure http:…RT @poornima: \"Write! There needs to be more female voices.\" - @davemcclure @500Startups #premoneyRT @christine_tsai: @Alfred_Lin answering tough q's from @davemcclure w/ finesse. #premoney @500Startups @sequoia http://t.co/k9ACH0khXqRT @tylerwillis: #premoney family offices don't see incubators as the best source of returns, but as a place to train family members on ent…RT @BenLevy74: Family Offices sending their offsprings to incubators and accelerators as wealth preservation strategy...\"lean trust fund mg…RT @CynthiaMaxey: \"Differentiation in mkt, deal flow, track records = criteria when I look at #VC fund mgrs, some begin w $3-6m demo fund\" …RT @KateDMitchell: #premoney @HeidiRoizen of @DFJvc (which created 23 unicorns) w/ John Powers @LP2LP2VC @CendanaCapital @AsterAdvisor http…RT @Crist0: John Powers: \"Couple of Billion\" @HeidiRoizen: \"So, quite small, right?!\" #premoneyRT @christine_tsai: \"How many accelerators are good?\" \"Less than 10\" - @asanwal  #premoney cc @500startupsRT @RunaCapital: When looking at VCs, brand and niche are key - #premoney LP perspectiveRT @cesarsalazar: 1,400 active VCs\n~25% not bad\n~10% good\n~1% great\nOnly Sequoia, Greylock, Benchmark &amp; ~10 more on there\n\n#premoney\n\nhttps…RT @LeanStarter: Funds must have traction to attract institutional money. If you're new, you better have one hell of a pedigree. #PreMoneyRT @edithyeung: Total # of Global VCs - 1400. More 50% in Silicon Valley. :) #premoney (via @CBinsights)quotable \"stumbling into the right deal can change the trajectory of a VC firm\" John Powers, Stanford Mgmt #PreMoney http://t.co/Y6tP6o7BYcRT @500Startups: \"Top quartile is bullshit\"- @asanwal of @CBinsights #PreMoney http://t.co/JbPjjqzhIrRT @500Startups: The LP POV with @HeidiRoizen @MKRocks Leah Zveglich (@AsterAdvisor) &amp; John Powers #PreMoney http://t.co/DacqLEiYbNRT @dianemulcahy: Fantastic read @davemcclure &amp; spot on! '99 VC Problems But a Batch Ain’t 1'  — http://t.co/ymj3PeKKDr #VCRT @RyanBethencourt: \"Most new VC's are small, add them all up, and you'd probably get one NEA, minimal systemic risk\" Anand Sanwal #premon…RT @marcosmindseye: Much easier to raise at a billion than exit at one #cbinsights #premoneyRT @geneteare: “18% founders female compared to 9.5% in 2009 #premoney” report from @crunchbase @wendytanwhiteFOLLOW #PreMoney / WATCH http://t.co/u4GpDdzzSY for 50 amazing speakers on VC innovation cc @500Startups http://t.co/23fOv3cKVFRT @trista_vt: \"CB Insights is info porn for vc\" @davemcclure #PreMoney@jeffharbach @christine_tsai yes she is :)RT @jeffharbach: Wow! Impromptu talk from @christine_tsai was excellent! She's impressive! Thx for inviting her to the stage @davemcclure #…RT @ZibbyZ: 'Gotta get comfortable being uncomfortable' when talking about #Diversity &amp;  #Meritocracy  - @davemcclure #premoney @500StartupsRT @stephendeberry: .@davemcclure Appreciate you lifting up #diversity issues and encouraging our industry peers to talk about this more at…RT @500Startups: 500 Founding Partners discussing diversity in tech at #PreMoney @christine_tsai &amp; @davemcclure http://t.co/AqTabTgHZLRT @CBinsights: We're at #premoney talking about the renaissance in venture capital. Live stream here: http://t.co/K1jouMfJRb @500Startups …RT @dunkhippo33: 18% (on some database - Crunchbase?) of founders are women. -@davemcclure #premoney@dunkhippo33 yep we agree.RT @dunkhippo33: There's a lot of other types of diversity to think about -@davemcclure #premoneyRT @bizcarson: \"You're the Snowden of our generation.\" - @davemcclure on @ekp #premoneyRT @asanwal: I'm about to show rainbows shooting out a unicorn's ass at #premoney. Excited to talk bubbles with @davemcclure in a bitRT @JHUInnovation: We're lucky to have @davemcclure as a #JHU alum &amp; supporter of #JHUInnovation. Check out http://t.co/a4mcwk8qAY for live…RT @susleec: @davemcclure on why bigger is better (probability and statistics) http://t.co/nGn1xbavSfTheGuardian: Your enemy's enemy is your dog, scientists find. http://t.co/CbtxQ0NbB7wow: Dick Costolo Out as Twitter CEO http://t.co/F6Q5l8dFTm", 
    "@davidsacks": "In War: Resolution,\nIn Defeat: Defiance,\nIn Victory: Magnanimity,\nIn Peace: Good Will.\n--ChurchillSee @ParkerConrad stand up for small businesses that are #ADPeeved on @SquawkCNBC: \nhttp://t.co/Gd4INb8vz1RT @JaredLeto: Don't be fooled by @ADP's FUD on security. This is about small biz choice. http://t.co/5oz7FRAjxV #ADPeevedRT @ryanlawler: This whole Zenefits-ADP thing reminds me of an old @StartupLJackson quote: https://t.co/d86ItMzCAk http://t.co/L9LgBseQ1yRT @paulg: ADP wouldn't sue Zenefits if they weren't afraid of them. So you know which to choose. http://t.co/XcMN6T8qa9RT @bobkocher: ADP's strategic plan:  If at first you do not succeed...hires lawyers, bully, and shamelessly try to copy. http://t.co/54nOZ…RT @businessinsider: Zenefits cofounder: The CEO of ADP threatened me like 'Dirty Harry' http://t.co/4smDpbiqS1 http://t.co/eMGcjEOBZ0RT @chasedave: ADP FUD Campaign Against @Zenefits Shows Perils Startup Face http://t.co/Q4EzKffyalRT @sama: Great article from @LarsLuv on the importance of sales: http://t.co/EWIw5nWWjdRT @drusenko: Going to be switching off @ADP if they continue to block @Zenefits. Love how they're totally willing to throw their customers…RT @ccheever: Has to be frustrating to be a business on ADP and not be able to use @zenefits when you want to. http://t.co/ujoV9uCXCiRT @mattcutts: If you use/know someone using ADP, you should know that they're blocking Zenefits: http://t.co/vHoqpyspJ4\n\nLooks like really…RT @aplusk: Small biz shouldn't be a pawn in some giant corp's game. #ADPeeved http://t.co/3YxjdTwLUcRT @aplusk: Amazing that 50+ yr old @ADP is so threatened by 2-yr @Zenefits. #disruption #ADPeeved http://t.co/dhsxtUNvZRCongrats @phil_hellmuth on your record 14th bracelet. Touching that you dedicated it to Goldie. \nhttp://t.co/UzQCfzLVmQRT @Jason: Welcome @zenefits to the club! they tried to stop @airbnb, @uber, @wealthfront -- they couldn't. consumers rule!  https://t.co/O…RT @Jason: so @ADP is trying to crush consumer choice by blocking their own clients from using @zenefits -- lame and sad!  https://t.co/DmZ…ADP: Stop Hurting Small Businesses; Let Them Use Zenefits\nBlog: http://t.co/SbUXZeChoe\nPetition: https://t.co/rDd7UTnQgO\n#ADPeevedRT @adamnash: Welcome @Zenefits to the growing club of startups directly attacked by incumbents. Change is coming. http://t.co/4J8gM33mhxRT @hunterwalk: When I see @ADP marketing this hard against @Zenefits I think one thing: @Zenefits is winning http://t.co/rbTaUmyg8AThe real work to build companies was done, not in the limelight of conferences, but in obscurity when hardly anyone was watching or cared.@sarahcuda Yes if they're on the board. No if they're small shareholders with no info rights. Lots of candidates: http://t.co/L3aosRFhhu@nichcarlson Is it still a point of contention that companies that keep their founders involved do better than those that don't?Not one PayPal creator included on new PYPL Board of Directors. Given breadth of PayPal Mafia's success, it must have taken effort to avoid.10,000 small businesses down, 5 million to go, and we just made a $500 million 'pit stop for gas and beef jerky.'\n\nhttp://t.co/hgQScmX3coLooks like I'm the #8 all-time @uber user by rides and #3 by miles. https://t.co/1Iu0k0qaYzZenefits is proud to be back in Utah! Thanks @GovHerbert &amp; @JohnKnotwellUT for signing/sponsoring the legislation. http://t.co/CNyxL9SBCRGood profile of one of my favorite futurists @ramez. Thank for the sneak peak of Apex -- loved it! \n\nhttp://t.co/Zuhy1fIYLXShrewd (and hopeful) move by @Dan_Schulman to elevate the startup guys within PayPal. \nhttp://t.co/gWXOMGAxCDRT @jasonlk: Video: \"The Two Types of Freemium with @DavidSacks and @stewart @SlackHQ\" from #saastrannual https://t.co/wzNKKqnS6wRT @Jason: Latest: Sacks’ Law: you gotta see founders for who they could be http://t.co/mWJlCYwMpF chart by @jorge_selva http://t.co/p4v5bg…In the future, everyone will want to be a founder, and we will need robot employees to solve the \"too many chiefs\" problem.@Jason If you want to bet on startups based on what they could be, you gotta see founders for who they could be.Nobody cares about platforms that don't have distribution. Therefore, creating a platform is not the answer to your distribution problem.\"Shake Shack Economy\" - With rising affluence, there will be a gourmet version of everything. http://t.co/9TVQI3oL6h via @pmarcaAn early-stage startup's only acceptable \"partners\" are customers, suppliers, and platforms. Endeavor to turn all others into one of those.RT @wrmead: 231 years ago today, America got its best Christmas present ever. George Washington quit his job. http://t.co/mEmYWwe13k2014's Hottest Startup:\nhttp://t.co/fCiu8uAlQORT @Zenefits: See why @DavidSacks decided to join Zenefits as COO on @BloombergNews https://t.co/E4az67BdcyThe solution to any startup problem, discussed long enough, devolves into \"we need more engineers\".If you agree @Zenefits should be allowed in Utah, sign this petition urging @govherbert to stand for innovation:\nhttps://t.co/llkNvkpZppExcited to join @parkerconrad @laks_srini @Zenefits - fastest growing SaaS company in history. http://t.co/2ooEhjhJtKHas anyone noticed how clear iphone6-to-iphone6 calls are on Verizon's network (HD quality)? This could create a network effect.Have screenshots of the original Xerox Parc GUI (that Jobs supposedly copied) ever been published? http://t.co/oUcoV1clYNRT @BI_Graphics: Silicon Valley's elites are obsessed with poker — and it's not just because of the money http://t.co/lezP4rTO6U http://t.c…\"What is it about our society that talks all the people who don't have Asperger's out of their original ideas?\" http://t.co/3A1bMLbRfzI'd be surprised if \"Facebook for Work\" turns out to be a major strategic initiative for the company. Here's why:\nhttp://t.co/iqSX9Xs80OUsers only care about security when it's not less convenient.A leader's job is to simplify everything so their team performs better. Complexity is an excuse. -@rabois \n\nhttps://t.co/tSOu0iuQfcTech turnarounds are almost impossible b/c a bigco that's lost its product-market fit is basically a startup with less ability to innovate.", 
    "@jack": "RT @Recode: Hillary Clinton Kicks Off Presidential Run With Periscope As Running Mate http://t.co/qqGUp4k6pa http://t.co/ZV9HA0L354Beyond the Chokehold: The Path to Eric Garner’s Death, via @nytimes http://t.co/CcPkmg7HgiCalifornia Announces Restrictions on Water Use by Farmers, via @nytimes http://t.co/w9JjeZO0T3RT @Square: .@Jack spoke with @BlueBottleJames about how our new reader is removing barriers: http://t.co/5gkTDEp7PP http://t.co/j9wV4qVMRF@GQFashion ha! No.@ericwilkens sorryRT @vijaya: Can't let the day end w/out saying how grateful I am to @dickc for his leadership and trust - I will miss him and our tequila f…RT @nytimes: Using @periscopeco, @dguttenfelder streamed live video during his recent visit to North Korea http://t.co/6tjy3Wc0c0 http://t.…RT @warriors: \"He does it all. It showed tonight - a huge reason why were 2-2 going home.\" - @StephenCurry30 on @Andre http://t.co/1WI2G2TL…RT @warriors: Kanye holding the podium for Steph. #MVP http://t.co/YODFsiWo5E🔥🔥🔥 https://t.co/CSHzPHJCODRT @warriors: MVP. #StephGonnaSteph http://t.co/juHL6XvhvnRT @kevinweil: ICYMI: today we ALSO announced that we're dropping the 140 character limit for DMs. http://t.co/8M1fwW55CJRT @warriors: .@StephenCurry30 with the handles and finish to end the 1st half on ABC! #StrengthInNumbers #NBAFinals http://t.co/yym8qbNZIVBack to work! (and let's go @warriors!)RT @dickc: @anthonynoto I love you too. #dmfailThank you for everything @dickc! You're a selfless leader who's built an amazing team and company #proud https://t.co/52z4TIYIUhI was just a host! This movement came from local sellers.  https://t.co/zqTsoGBfGbWatch: #NBAFinalsRT @warriors: MVP 🔒 in. #SPLASH https://t.co/kfBTkqFfwnRT @SInow: Every full-time @Warriors employee is at Game 3 in Cleveland, thanks to the team's owner http://t.co/OyfqKcwgRX http://t.co/oYLp…RT @deray: Protest. McKinney, Texas. http://t.co/uBfvRhwrkkOutsider Artist: Understanding the Beauty of Steph Curry’s Jumper http://t.co/JD87CFFgcoRT @DavidHerskowitz: Boom. @jack @square http://t.co/sEPA47JBKMRT @Square: We’re giving away 250K Square Readers free—because we want *every* business to be able to accept Apple Pay. http://t.co/s5hbf3h…Square's new reader is also wireless (with a great battery)! Check out this farmer selling on the side of the road! http://t.co/ApezHyLNDNLIVE on #Periscope: Live with @bluebottlejames at Blue Bottle Mint https://t.co/wlfQV58NEUAbout to periscope with @bluebottlejames the CEO and founder of @bluebottleroast about Blue Bottle and Apple Pay!Square + Apple Pay: from buyer to seller, everywhere! http://t.co/TMHuoOa6QtWe're giving away 250,000 Apple Pay Square readers to our sellers. Come try it today at @bluebottleroast Mint Plaza! http://t.co/B9riQym3bn@daiwaka boo?I want to leave my cards behind and pay with my phone (and ⌚️) everywhere! We are working hard to make that possible: http://t.co/nKeWE9qJqzFormer South Carolina Officer Is Indicted in Death of Walter Scott, via @nytimes http://t.co/U8cfr1SC4ZRT @mirogeorgiev97: McKinney, North Texas City At Center Of Pool Party Video Controversy, Was Sued Over Housing Discrimination http://t.co/…http://t.co/DeFap12u79What a game. On to the next one. #DubNation #NBAFinalsRT @NBA: Steph Curry drains 2 clutch FTs to put the @Warriors ahead by 1 with 29.5 secs left in OT on ABC. #NBAFinalsRT @warriors: #GSW #NBAFinals #CLE http://t.co/JGiOU2mpN9RT @warriors: http://t.co/nrH6qs8Ypj🔥 up, 🔒 in. Let's go @warriors! http://t.co/p6Fuo63eDc💯 https://t.co/NLRaXztu3bRT @FCBarcelona: Min 33: Barça with 71% possession right now JUV 0 - 1 FCB #FCBLive #UCLfinalRT @warriors: Yup. MVP's 🔒 in for the #NBAFinals. https://t.co/ytC4UwTyJ1RT @itsRileyCurry: Scripting up my post game speech http://t.co/81kvPLuayfRT @warriors: Let it rain. #DubNation http://t.co/pZHTpzCQZyRT @drew: @jack @warriors #DubNationLet's go @warriors!RT @periscopeco: We launched a major new update on iOS! See what's live on a global map https://t.co/ypOT3B6X7cRT @hollyrpeete: Sent this to my friend who recently lost her husband. The most eloquent honest beautiful piece ever💔🙏 #SherylSandberg http…@beardohio I've been wrong a lot but not on this!", 
    "@Tom_Peters": "Countdown! Six days to 800th anniversary of Magna Carta!.@VinceSkolny @MattLaCasse Thank you, Vince!RT @VinceSkolny: Per @tom_peters (in Thriving on Chaos, the best management book you may not have read), hire interesting people. #SMXChat ….@JoelHeffner @BradleyGauthier I'd guess a lot, actually. A lot of those openings very high end--e.g., Silicon Valley hundreds thou short.RT @JoelHeffner: .@BradleyGauthier @tom_peters How many people can quit their job today and get a comparable job tomorrow? Not many.RT @BradleyGauthier: @tom_peters Next step is for the available workforce to upgrade their skills. Most can only be hired in a world that n…BLS reports 5.4 million job openings at end April, highest # since the measure was established in 2000. Nice. Very nice.RT @soniasimone: .@tom_peters I've found that @united has a particular gift for treating its customers like an inconvenient afterthought. E…RT @HRAskMe: @SpeakerGuru @tom_peters Are we replacing \"Don't be evil\" w/ \"Don't do dumb\"? I think one is harder to recognize, guess which ….@HRAskMe @DruckerInst Would appear the answer is Ed Schein. He is surely the godfather of corporate culture thinking/researching.RT @HRAskMe: @tom_peters Adam Bryant in QUICK AND NIMBLE writes that @DruckerInst has \"no record of (Drucker) writing or uttering\" those wo…RT @SpeakerGuru: @tom_peters @susanpgreene @alphabetsuccess SWA does a great job at not doing dumb as much as the others. At a good price p….@jdavidsonlawyer @WarrenBuffett I'm fine with higher price. I'm complaining hidden charges that take tab up 20% or more. That's fraudulent..@jdavidsonlawyer @WarrenBuffett I wasn't arguing price! I was arguing zero-transparency deceptive pricing practices..@jdavidsonlawyer @WarrenBuffett Airlines went in flash from monopoly pricing (pre de-reg) to zero-margin \"dynamic pricing\" (Crandall/AA).RT @jdavidsonlawyer: @tom_peters call @WarrenBuffett he will remind you at these prices it will still take decades to recover all the lost ….@susanpgreene @alphabetsuccess @VirginAmerica I respect your judgment; it's just that I have this ye olde LUV affair with SWA!.@SpeakerGuru Nice.RT @SpeakerGuru: @tom_peters Culture is the power, the juice and strategy is the resistance. Good strategy = minimal resistance..@MarkOlivito MBWA rocks, rolls, and rules!!!RT @MarkOlivito: @tom_peters and with that you just made my day.  In your honor I'm now going to hit the factory floor.  #MBWA!RT @Raj_Daniels: @tom_peters never gets old or outdatedRT @smccannon: .@tom_peters Appreciated: \"Ignoring...your (company) culture is like letting your aquarium water get dirty.\" http://t.co/OiI….@susanpgreene @alphabetsuccess @VirginAmerica Some [like me] would add SWA qualifies.RT @susanpgreene: @alphabetsuccess @tom_peters the one airline that defies that is @VirginAmerica - do an amazing job on user experience fr…PDrucker not slang slinger. Likely source \"Culture eats strategy for breakfast/lunch.\" Ed Schein/1986. Makes sense, ES \"father\" \"corp cult.\"Great! \"Culture Eats Strategy For Lunch http://t.co/qBmSKC3iu3\"Great!!! http://t.co/VbMPIjVd7vRT @alphabetsuccess: @tom_peters Why can't airlines, among other biz, see that much of their marketing is repairing the leaks they put in t…RT @markchristie: @tom_peters United’s new corporate mascot: Fee-Fee. http://t.co/pyVIlHFEQZ.@markchristie Web power. The booking sites should not put up with the hidden fes..@markchristie My calculator ran out of juice tallying all the fees. Overlooked those.RT @markchristie: @tom_peters Don’t forget the extra charge for use of the loo, an inside seat and a socket for yer laptop. That’s $5,268 (…United Airlines hidden fee #26: $23.69 for processing all the hidden fees. (Or so it feels to PPs/Pitiable Pax!!!!!!!!!!).@markchristie Yo Mark, get yr biz class ticket LAX to Singapore. Just $1,783! Book now! Mark's final airline tab with hidden fees: $4,268.RT @markchristie: @tom_peters Not so much good business as pure opportunism, then? Although the two are often similar.Dear biopharma: \"because you can\" is not a pricing strategy. (Bloomberg Businessweek cover 0608)Read airline profits up due to Big 3: (1) Bag charges; (2) itinerary change fees; (3) not passing on dramatic fuel price windfalls. Lovely.RT @PaulSweeney: This is a must read for anyone to see just how blind tech is to women. Cc @tom_peters  https://t.co/EoyPYLs9ep.@MarkOlivito Mark, you are ... THE MAN.RT @MarkOlivito: @tom_peters unmitigated bull shit!.@dherman76 Thank you!RT @dherman76: @tom_peters just saw your bio \"red bull of management thinking\" and love it. Been reading your books for a long while now.RT @gregawells: Two things I learned on my timeline tonight. The MLB draft is on selecting nobody you know and pissing off @tom_peters is n…RT @anshublog: @tom_peters @SenWarren This is why a free market Libertarian leaning guy like me tends to vote with Obama and Warren. (Crook…RT @JoelHeffner: .@tom_peters Wouldn't it make sense if an itemized list of fees were required to be printed on the ticket?RT @dartdog: Many businesses are abusing undisclosed fees @tom_peters  https://t.co/KovsbXQpDaRT @anshublog: @tom_peters did I hear you say class action against fees? Where is @SenWarren when we need her! :)RT @SmellTheTea: @tom_peters whoaaa, they also posted your picture while boarding http://t.co/MB2IaKr5YnAh, figured it out. United charged me $3945 for the ticket. The $856 \"international surcharge\" was for boarding the actual aircraft.", 
    "@richardbranson": "A mentor session with a difference - I went sky-high with three @VirginStartUp entrepreneurs: http://t.co/0TBjUY43V6 http://t.co/bk6qYNnTMJNow is the time: Solar Impulse is crossing the Pacific to promote #futureisclean! Join us: http://t.co/9qs0gspdS7 http://t.co/E3y8F1AzJz.@VirginCare launches Carers Club for UK's 7 million carers: http://t.co/A5oAEP5d8o http://t.co/hZaiGsDYPSSix characteristics of a good start-up founder: http://t.co/kOCT8lGyYJ #readbyrichard http://t.co/npKLcM2GuPInfographic: what’s the true value of the ocean? http://t.co/x4OZmaMaKi #WorldOceansDay @VirginUnite http://t.co/krExStOowJWhy we’re extending @Virgin’s #ParentalLeave to introduce a year’s full pay: http://t.co/GBZB1LDdaV http://t.co/XEWy0SjDCGHow dyslexia can help you in life: http://t.co/oMN0vEu0Hi http://t.co/PVxWm2AyjXOne Earth, One Ocean: @figuerescr &amp; @CFigueres on how all countries must play their part in protecting the planet http://t.co/kgbtfFH5leMotown the Musical joined us on @VirginAtlantic's inaugural #Detroit flight. Watch the video: http://t.co/0TBjUY43V6 http://t.co/zSf9HTnmdOWhy Detroit hustles (and dances) harder than anywhere else: http://t.co/0TBjUY43V6 #HelloDetroit http://t.co/NgdWyWks5S#HelloDetroit - it's good to be here. Bring on more @VirginAtlantic flights to the Motor City: http://t.co/0TBjUY43V6 http://t.co/tCENGnTInpMy advice for dyslexics? Turn a negative into a positive: http://t.co/oMN0vEu0Hi http://t.co/UJIScRrZkG http://t.co/dgPjEspB6NDo you suffer from dyslexia? Don't let it hold you back - use it in your favour: http://t.co/oMN0vEu0Hi http://t.co/AYI2FMaoBuLove receiving letters. Here's what I wrote back to a 9 year old living with dyslexia: http://t.co/oMN0vEu0Hi http://t.co/Hsyyra9UMsMy top 10 quotes on dreams: http://t.co/w3V6rhrnfp http://t.co/bawLvPlc0YRT @UKinMaldives: Hope this Friday's rally in Male', organised by political parties, will be peaceful and allowed to pass peacefully. #Mald…“Somewhere there is a kid working on a project, to project to the world” http://t.co/m4aPWUg3PG http://t.co/GDIiuiuWxCWatch this moving performance about Detroit, the city that continues to call the world's bluff http://t.co/m4aPWUg3PG http://t.co/lqUR5z7qb6Love the pride &amp; passion of this Detroit artist. How does your city make you feel? http://t.co/m4aPWUg3PG http://t.co/m5a5D1Cz9aIt's @VirginAtlantic #Detroit inaugural day. Looking forward to that Motor City spirit: http://t.co/m4aPWUg3PG http://t.co/K5GcKdyBNxDo you know who really owns ‘Richard Branson’s Lake Como villa’? Invite us round for a cuppa http://t.co/BzzeiV6NDy http://t.co/LGGF5Q9TICRumour is I’m George Clooney’s next-door neighbour. My wife Joan is sad this is untrue… http://t.co/BzzeiV6NDy http://t.co/xPwPCj1VzPThis is apparently ‘Richard Branson’s Lake Como villa’. It’s news to me http://t.co/BzzeiV6NDy http://t.co/K9qzY5nnmBFour things to look for when hiring new staff: http://t.co/lEGhCjvpwk http://t.co/EoHdBKV7GoFirst unlimited leave, now 1 year full pay for #parentalleave. Proud @Virgin's leading the way on workplace wellbeing http://t.co/GBZB1LDdaVHere’s why @Virgin Management is introducing a year’s full pay for all on #parentalleave http://t.co/GBZB1LDdaV http://t.co/9JPTPjmpyDFun shouldn't just be reserved for special occasions…http://t.co/fcD0HLIBdW http://t.co/bT0FwWfb8lDon’t think about fun as a reward, think of it as a responsibility: http://t.co/fcD0HLIBdW http://t.co/l0qMi9Qti4@MattWojcik8 We should all look &amp; dress however feels natural. Self-expression shouldn't take back seat to tradition: http://t.co/wDeaLdapqq@neilhubbard66 Wonderful. Combining two of my favourite things: tea and the Sex Pistols.@lifestylings It's a golden rule of business.@thexiv Fun is the secret to a fulfilling life!@FrankVerrilli People are fundamental in driving the success of a business. Treat your people well and your business will thrive.If you find time for fun in your everyday life you will be rewarded everyday: http://t.co/fcD0HLIBdW http://t.co/m8gyS6YPVKFind time to play: http://t.co/fcD0HLIBdW http://t.co/ShSIxJeBE7The more you support your staff, the happier &amp; healthier your business will be http://t.co/GBZB1LDdaV #parentalleave http://t.co/hKhCYZfII4As a dad &amp; grand-dude, know how magical time with kids is. Longer #parentalleave makes sense http://t.co/GBZB1LDdaV http://t.co/PTTPh9nvKFDelighted @Virgin Management is introducing a year’s full pay for all #parentalleave http://t.co/GBZB1LDdaV http://t.co/NuBL238zcwWhat's the no.1 challenge we must address in the next 10 years? Best answer can join me at @virginunite #next10 event http://t.co/8SIcjvsohQWhy hardly anyone dies from a drug overdose in Portugal - other countries should learn from this example http://t.co/hQvJC3O6PL #warondrugsBollocks isn’t a vulgar word. Here’s how we proved it in court, with the help of a priest… http://t.co/PfnadeiTQ4 http://t.co/uGZmGlofHE8 tips to evolve your start-up into a successful company http://t.co/fXu7qMTxEr http://t.co/kld2NY9WbpMy top 10 quotes on dreams: http://t.co/w3V6rhrnfp http://t.co/OWebjo7A2G1 in 8 of us will be a carer at some point in our lives. Here's how to get support http://t.co/tH9jYq3f7A #CarersClub http://t.co/vw9QnCkSBt75% of carers struggle with money, 46% give up work. Get simple advice @virgincare #CarersClub http://t.co/tH9jYq3f7A http://t.co/PmhiIRbImXMet young leaders &amp; carers from @RF_Tweets, supporting others &amp; inspiring the next generation http://t.co/tH9jYq3f7A http://t.co/hWMCOisC8yIntroducing @VirginCare #CarersClub – straightforward advice for UK’s 7 million carers http://t.co/tH9jYq3f7A http://t.co/cYeMkYxIlPNever Mind The Bollocks, here’s the new @virginmoney credit card http://t.co/PfnadeiTQ4 #borndifferentThe guy who signed the Sex Pistols now owns a bank? There’s money &amp; then there’s @VirginMoney http://t.co/PfnadeiTQ4 http://t.co/pFEk253T9DWe’re still being censored! New @VirginMoney ad blocked for ‘offensive’ word http://t.co/PfnadeiTQ4 #borndifferent http://t.co/oeJYScFrnU", 
    "@bill_gross": "@HsuUntied Thanks very much for the compliment and for sharing my talk! Bill@TweetsByDevonne I like the line you pulled from my talk in your tweet!  Thanks for sharing my talk. Sincerely, Bill@andreymilyan Andrey, thanks very much for the compliment, and for sharing my talk!  Sincerely, Bill@KristianAlcaide Hey, thanks very much for the compliment and for sharing my talk! Have a great day. BillRT @rskin11: Nice talk by @Bill_Gross where he shares data on the most important factor for startup success (rhymes with climbing) http://t…@DougRumsam Yes, good luck. Try to NOT be in denial about signals customers send you about timing. I failed at that a few times for sure!RT @jasonSwitchedOn: Timing, team, idea or funding? What counts most towards the success of a company. Inspiring TED talk by @Bill_Gross ht…@rrawlings1 Yes, that's a very good point. That's alongside product/market fit, but both also relate to timing in a way, I think.RT @rgmcgrath: In this TED talk, @Bill_Gross on why timing is everything for startups. http://t.co/NYe6J5NYPZ I think the time is right for…RT @DanielPink: The single biggest reason why startups succeed. Fascinating short TED talk from @Bill_Gross: http://t.co/mTFT7qdceaRT @jeffweiner: The Single Biggest Reason Why Startups Succeed via @Bill_Gross https://t.co/5rX7sM8UC4RT @TEDchris: Timing REALLY matters! Terrific short talk from @Bill_Gross on what it takes for a start up to succeed. http://t.co/w43vDccnU9Here's a link to my #TED talk from earlier this year on what matters most for startup success: http://t.co/I6TbhKN6EN http://t.co/lJyDFL67iT@jeffjarvis Thanks Jeff, can't wait to see that new product!\"We're doing well. We have $300m in the bank &amp; we've been growing 5%/week for 70 straight weeks.\" Stewart Butterfield, CEO of Slack #CodeCon@hunterwalk That's a hysterical tweet!Before 2000, jobs grew 1.7x faster than population. Since 2000, population has grown 2.4x faster than jobs. #CodeCon http://t.co/Q3DpBOvurRMichael Dell started Dell in his dorm room in 1984. Since then, total revenues have been a staggering $880 billion. http://t.co/fYRNXhHi64Amazing that 20 years in, ecommerce is up to $300B, but still barely 10% of sales. Mary Meeker at #CodeCon http://t.co/6RoY6Z7YhUUS % of Global GDP down to half of what it was at peak after World War II. Mary Meeker on globalization at #CodeCon http://t.co/ICmtKXOF9E10 years from now, when we look back on how big data evolved, we'll be stunned at how uninformed we were when we made decisions. #CodeConMobile remains the biggest ad opportunity, print remains way over-indexed compared to usage. Mary Meeker at #CodeCon http://t.co/k3pCOlUGXaMary Meeker's Internet Trends report is here: http://t.co/vG3e55Nf5O now showing at #CodeConTop 15 Internet companies in 1995 worth $17b. Top 15 today worth $2.4 trillion. Mary Meeker at #CodeCon http://t.co/l2a0VAGz2JIn the last 20 years, mobile phone users went from 80 million to 5.2 billion today! Mary Meeker at #CodeConCool drone shot of #CodeCon this morning. About to begin with Mary Meeker Internet Trends report. via Danny Sullivan http://t.co/gpxHoeeRUF@hunterwalk @Joshmedia @johnolilly Me too, still here! Smile.@jagordon Yes, good point!  Thanks.\"I'm not a really great manager, but I try to be a really great leader for my team.\" Evan Spiegel of Snapchat at #CodeCon\"If I had to say one word as to what I think Snapchat is about, I would have to say, 'entertainment'\" Evan Spiegel at #CodeCon@smalldozes Smile.\"We have nearly 100m daily users, and 65% of those users actually create content.\" Evan Spiegel at #CodeConEvan Spiegel of Snapchat admits on stage at #CodeCon that holding your thumb on the screen is holding them back on things like video.Snapchat usage declines rapidly with age. I wonder how much it has changed since the date of this graph? #CodeCon http://t.co/qealWe1Ce6\"People use Snapchat so much, we don't even measure monthly active users, we measure HOURLY active users.\" Evan Spiegel at #CodeCon\"The most frequent behavior on the phone is messaging, and that is the behavior we want to own.\" -Evan Spiegel at #CodeCon\"Snapchat started with the camera, but now there are 3 c's - Camera, Content, and Communications.\" -Evan Spiegel at #CodeConMore people eat out for Mother's Day than any other Holiday- 80m! Thanksgiving- 79m. Valentines- 70m. Father's Day- 50m. Happy Mother's Day!Here's a satellite map of 10 years of clouds, the darker blue places have no clouds! http://t.co/qGqEMXpOie http://t.co/YCr7t2TIHuEarth has 12 billion hectares. People in high-income countries use about 16 each. Somehow, we need to survive on about 1 per person #XPrizeCool graph of the rise and fall of music genres over time by analyzing Billboard Top 100 over 50 years. http://t.co/ToiGHzy1VO\"If you look at young people around the world today, we need about 500 million new jobs by 2020.\" Michael Dell at #XPrize Visioneering@startupstella Good point.  I don't know.  I wonder what positive impact the self-driving car can have?Look at this dramatic improvement in safety of airlines and cars. #XPrize Visioneering http://t.co/8lOv8JQDv9Impacting the world: 1000 yrs ago - Kings &amp; Queens, 100 yrs ago - Industrialists, today - everyone. #XPrize Visioneering@StephenBove Wow, I had no idea!  Thanks for sharing.  Can't wait to tell my son at dinner.Here's a neat graph from JPL of all the longest distances we've driven on other worlds. Just crossed a marathon! http://t.co/bgMLcnBs6YCaltech's LIGO observatory is searching for gravitational waves. It needs accuracy of 1 human hair over distance from sun to nearest star!@gaberivera Hysterical!  Thanks.  Have a great weekend.The sun is over 300,000x as massive as the earth.If the sun is a blue whale, the earth would be a little bunny rabbit http://t.co/4q9i49INq1", 
    "@johnnosta": "RT @GHideas: Breaking: @BostonChildrens Names #digitalhealth Entrepreneur @johnbrownstein Chief Innovation Officer! cc @sacjai @Paul_Sonnie…Here's a hint about what Google might do in its quest to fix cities http://t.co/tz9VyfpLy7 #digitalhealth @ryangooghealthVia @nprnews: Creepy Or Comforting? South Korea Tracks Smartphones To Curb MERS http://t.co/OzXY2QMviv@mykijini   Interesting concept Kijini. Let's talk!RT @mykijini: This app claims it can detect cancer by the sound of your voice http://t.co/rLW6VFaesn via @DigitalTrends@RandPaul   Rand--lets talk technology and innovation. DM me.RT @mjseres: A lesson about happiness from a Holocaust survivor via @johnnosta  #epatients http://t.co/mNOsaw61GEHelp!  I want Amazon Echo! @AmazonHelp @amazon@asmithblog   Thanks for the follow Adam!Key Read!! Mobile Financial Services And #Poverty. @obimobiles https://t.co/jz7rDTggkKThe superpower police now use to tackle crime http://t.co/0vzZTyROj3I'm looking for a Chief Marketing Officer for a #digitalhealth company.  Great opportunity. DM me.#PHARMA AND ITS OWN MORTALITY! FDA: Routinely Hides The Reasons Their Drugs Are Rejected From Investors http://t.co/BrifFQaW9yDeep Learning Machine Beats Humans in IQ Test http://t.co/QF6pBzZaor &gt;@TechReview #digitalhealth @ibmwatsonRT @Gil_Bashe: @JohnNosta always shares valuable insights! http://t.co/gMCyvHyzo5RT @COdendahl: Greek unit labour losts and GDP deflator now back to same trajectory as thos of EZ. http://t.co/AqB2KzMMT3 http://t.co/LOi3N…RT @davidfmeyers: What's ahead for #Twitter w/ #JackDorsey back at the helm? @ptsweeney w/the issues he'll face. http://t.co/w8OKVg2MWe htt…RT @tomkeene: http://t.co/tLDnzqb3Zi must-read dryden on his canada .@NHLonNBCSports .@NHLWHO WOULD YOU ADD TO THIS LIST? The Companies Disrupting #Healthcare In 2015 http://t.co/03DTsaNE3g via @forbes #digitalhealthRT @DrDave01: Samsung, LG smartwatches give up personal data to researchers http://t.co/cb3vCHLGyB via @CNETRT @SPulim: Crowdsourcing CPR gets more help to cardiac arrest victims http://t.co/6C11G6KHR511 Times The Jetsons Totally Predicted The Future http://t.co/7cGK62ecNB @scanadu @DrDave01 @cmichaelgibson #digitalhealthRT @AndoniaPR: 10 Crucial Questions For Defining Your Personal Brand - Excllnt advice fm @williamarruda http://t.co/NP1BWQyasT #personalbra…RT @AndoniaPR: .@Jack is back!\n#twitter $TWTR #founder #leader #sm #socialmedia #visionary #cofounder #media #disruptor #trendsetter http:/…@AndoniaPR   Thanks Diane!BOSTON ALERT!  I'm in town on Friday evening the 19th.  Any of my #digitalhealth friends up for some chowder? #HIT @jflier @CMichaelGibsonRT @adamfalat: #Wearables and #Nanotech: The Future of Healthcare https://t.co/jTNA6cPNQ3 #DigitalHealth http://t.co/OtgkSjkZrJRT @adamfalat: Sensors begin feeding rich biometric data into #VR, blurring lines between real and virtual #digitalhealth http://t.co/en6i0…RT @AP: Walgreens, health insurers push expansion of virtual doctor visits with the click of an app: http://t.co/4WOVPQJIh1RT @adamfalat: Fast &amp; Easy Appointments Must Be Health Care’s Top Priority https://t.co/lC7MQnIrza See ours https://t.co/nkJgNKzi5I http://…Big data 411 for 911 calls https://t.co/YVtsCqQhhY via @nuviunAP: Every Single Federal Employee's Social Security Number Was Hacked http://t.co/vBWUl8T9L4 #digitalhealthTo my digitalhealth firiends--Please follow @DrLucasArriola and let's get things cranking in Argentina! Gracias!!Thanks @AmeriGas for the GREAT customer service quick fix!!!  I couldn't have asked for more!  #GreatJobAre you following me on Facebook?  You might be missing half of the #digitalhealth story!  https://t.co/poPBLWGuT6How Smart Data Can Help Keep Employees And Corporations Healthy http://t.co/pgWPg7T8RY via @forbes @klickhealth #digitalhealthWhat Doctors Really Want -- and Aren't Getting -- From EHRs http://t.co/1eXEFTTeS7 #digitalhealth #hitYou could make your outfits in your living room with this apparel 3-D printer http://t.co/a6Gf9xiE3aMicrosoft is using drones to predict disease outbreaks http://t.co/cXdVPXOMKh #digitalhealth @microsoftmdThe consumerisation of healthcare will be bigger than the PC revolution--@JohnSculley: http://t.co/GFTWbeQOE4 @digitalhealthDubai360 present the world's first 8K 360 degree video https://t.co/cRTZvVk9wL @nuviunRT @CurelyHealth: Convenient &amp; cost effective. That's Curely. There when you need help most: http://t.co/x2VkeO4HN1It's here! @Curelyhealth is live!!! #Android-&gt; http://t.co/oN4YDKNXq0 #iOS https://t.co/xKWPZMdEGb #xmed #Telehmedicine #digitalhealthOculus unveils Touch, a proprietary Rift controller that makes VR actions more natural http://t.co/2io98Z4jPz @digitalhealth  @ZGJRNew method detects early breast #cancer via urine. #digitalhealth http://t.co/iXdcavVtXeI WILL POST THIS AGAIN YESTERDAY! Scientists show future events decide what happens in the past http://t.co/OMhSnuU66s #physics @adamfalatTsunami!  @Walgreens &amp;  @MDLiveInc Expand #Telemedicine Platform--Add Desktop and Tablet Functionality. http://t.co/YeMm5qA3Mv  @adamfalatNuts Reduce Risk Of Death From Any Cause, Study Finds http://t.co/IsueyDL4Xx via @forbes @alicewalton @cmichaelgibson @christianassadREAD THIS! Study On Preventing College Rape Shows Us How We Should Run The World http://t.co/sHzlDhd5sZ via @forbes @matthewherper47% of Doctors Use Digital Technologies, Smartphones at Work - mHealthIntelligence: http://t.co/bwhHxMHdn9 #digitalhealth", 
    "@simonsinek": "\"Your only competitors are your past achievements.\" - James CameronOur passion lies deep in who we are not what we do,The author of Getting to Yes, my friend @WilliamUryGTY, is doing an AMA on Reddit today at 3pm ET about #negotiation. I love his work!About to sit down with @Inc magazine. Tweet your questions to #IncLiveChat. To hear the answers visit http://t.co/bHJCSMeF7pHire people inspired to achieve something big over people who demand something big before they feel inspired.If you're a startup company, I'm doing a live chat with @Inc tomorrow at 1pm ET. Sign up here: http://t.co/Wa5CoJfLHd #IncLiveChatWhere does trust come from? I joined @guyraz on @TEDRadioHour to talk about why trust is so important in our lives http://t.co/xwNmWKmHZoLeadership is an education and the best leaders think of themselves as the students not the teachers.A boss has the title. A leader has the people.Good leadership is hard to measure on a daily basis which is why so many default to doing what's easy to measure instead.Leaders own the optimism.\"Fear is a disease. Hope is its only cure.\" Star Wars Clone Wars S1E17Our value is not determined by how many people show up; our value is determined by the how the people who show up feel when they leave.@EvanMathis69 all the slackers are busy visiting France and Italy.Fear of looking like we don't know what we're doing &amp; the steps we take to hide that fact- fantastic talk http://t.co/oDx12bkRkl @nextjumpUnder poor leaders we feel like we work for the company. With good leaders we feel like we work for each other.Innovation is not born from the dream, innovation is born from the struggle.\"Everything I learned about parenting is leadership and everything I learned about leadership was wrong.\" - Bob Chapman@YTCreators Trouble accessing YT channel http://t.co/OnZ06MnrNe to share videos &amp; ideas to inspire others. Help pls! CC: @simonsinekteamMany in leadership positions talk about doing what's right. The true leaders actually do it.\"When a good person meets a bad system, the system always wins.\" Frank Voehl #changethesystemSeven simple speaking tips that can help anyone improve their public speaking. http://t.co/kma7GhYfOGLeadership is not about being in charge. Leadership is taking care of those in your charge.The amazing, talented, inspiring poet Sarah Kay with astronaut Chris Hadfield's mustache photo… https://t.co/dfmpKB9zvlLeadership is the killer app.A poor leader will tell you how many people work for them. A great leader will tell you how many people they work for.It doesn't matter when we start. It doesn't matter where we start. All that matters is that we start.Chase the dream not the competition.New ideas need audiences like flowers need bees. No matter how brilliant, they will die unless others work to spread them.Proud of my friend and fellow inspirer @djmead out there spreading the Why! Inspire on, David! Inspire on! http://t.co/F6X2rRofCtFailure is not tied to money, failure is a mindset. We fail the moment we accept the lot we're given.Safe is good for sidewalks and swimming pools but life requires risk if we are to get anywhere.We can rationalize anything and easily quit on ourselves. Leadership is refusing to quit on others.Had the pleasure of sitting down with William Ury, author of Getting to Yes, to talk about his new book. Love him. http://t.co/u1uay6szHlIf you want to feel happy, so something for yourself. If you want to feel fulfilled, do something for someone else.Host a reading party and help kids in need. Such a great concept. Proud of my baby sis. http://t.co/jZitZGhw1wRT @sarasinek: Have your company sponsor a reading party for kids in need. For $500, 25 kids get PJs and a book. http://t.co/QKDR9JBtz9 @Pa…Leadership is not about being in charge. Leadership is about taking care of those in your charge.If you don't understand people, you don't understand business.  http://t.co/BihVa0aNM6Dr. King gave the \"I have a dream\" speech, not the \"I have a plan\" speech. Lets inspire people with our dreams, not bore them with our plansLove the ones who inspire us, encourage us and support us to be who we want to be.When we care less about our people, our people become careless.For working moms, nice interview from @trainmoms of President of Equinox &amp; great leadership roll model @SarahRobbOh http://t.co/7wUnm9EhnZA leader without a title is better than a title without the ability to lead.Happy New Year. May 2015 be the most inspiring year yet. Inspire on!!A team is not a group of people that work together. A team is a group of people that trust each other.There is a difference between offering a service &amp; being willing to serve. They both include giving, but only one is generous.There must be net neutrality. If not, it's  like repealing Glass-Steagall again. The interests of the few put ahead of the many created 2008We all have the luxury of looking out for ourselves. Leaders also have the honor of looking out for others.For small &amp; med size companies, @Ironmanjack is giving one of his amazing sales seminars in Rochester on Dec. 4. Go!! http://t.co/EorV3mwLn8", 
    "@sacca": "RT @reyner: @agarwal @ltm @onesnowclimber DMs are trending on Facebook http://t.co/karM4hjDrV@TomPJacobs @ded Hence, the \"sorta.\" Anyway, fan of Swoosh and Expensify. Thanks for sayin hi.@TomPJacobs @ded Bless you, Tom. The fact I own the shirt is a clue that I was hanging around then and know the story well.RT @SlackHQ: Our name may seem funny, but think on this: without slack, there is no reach, no play, no flexibility, no learning, no evoluti…@TheSharkDaymond You should hand out your mix tape there. Show us your hustle.@andyellwood @tferriss Right on.Let this be a lesson. This bird got rid of his formal shirt and tie and went on to be worth $23 billion. (Sorta.) http://t.co/4Dg66Iy3q0RT @crystale: Truckee treasure hunt with my adventure gal pals. http://t.co/UCNw9lVyqy@aroetter @JasonHirschhorn @adambain Which, we can all agree, would bode very well for anyone.RT @robdelaney: And then eat a club sandwich for 20 min at the podium. And then win.RT @robdelaney: Hillary should just say \"Imagine one of these GOP clown car toddlers nominating SCOTUS justices.\"@vl_1987 The view from Donner Memorial Bridge is awesome and there is a lot of cool, casual rock climbing right there.RT @HillaryClinton: LIVE on #Periscope: LIVE on #Periscope: Michelle Kwan hosts exclusive coverage of Hillary’s official campaign launc… ht…@sbedrick When the game is on, watch what happens to that hashtag. It's an entirely new experience.@patmatthews @twitter High five.@scutify High five.RT @emilychangtv: Watch now! Billionaire investor @sacca on Twitter, Uber, unicorns &amp; more 7pET/4pPT http://t.co/RhK9DOiGrW http://t.co/fNM…@rsarver @yobetts You kidding? He's the one who issues the certifications.@complex @googlecloud @startupschool @googlemaps That was an awesome day.Typo or not, I'm disappointed in myself for not identifying this huge potential market earlier. http://t.co/vGY8qmU42CRT @kevinweil: #OnlyOnTwitter: this conversation between @SnoopDogg and @levie. 💥 http://t.co/dVEnZsbeqO@iammizhayz They pushed the \"share with all followers\" button.RT @moeinteractive: Loved learning about Honey Bees &amp; about having fresh locally sourced ingredients #Periscope @ReneRedzepiNoma @sacca htt…LIVE on #Periscope: Have you ever seen a Queen bee? https://t.co/DR9myNmpEJRT @SnoopDogg: @sacca u need 2 write an open  letter about this sir! The people r ready. Bringing some diversity to the bay.RT @SnoopDogg: @levie if they don't step up I know who to hit up next. I'm all about that cloud!RT @warriors: Celebrate tonight's big win and get ready for Sunday game with some gear right here in this tweet! Shipping is free. http://t…@aagave Just wait.RT @kevinweil: ICYMI: today we ALSO announced that we're dropping the 140 character limit for DMs. http://t.co/8M1fwW55CJ@aagave Because you already use Twitter. Hundreds of millions don't yet, but will understand sports on Twitter.Live sports are so much better with Twitter. Click here to see what I mean: #NBAFinalsRT @WSJD: Twitter kills the 140 character limit for direct messages http://t.co/a1OJHjFtfxIn under five years as CEO, @dickc grew Twitter from a $3b valuation to a $23b valuation. Credit where credit is due. Thanks, Dick.@andrewstepner @sarahfrier @emilychangtv It's not her decision.Some incredible pitching/sales advice from @rklau... https://t.co/iaOxzMCUCT@eriks Because Periscope/Twitter is where the interviewees are.One of the biggest advantages of Periscope? When live, no one can selectively edit an interview to produce context-less clickbait.RT @paulmozur: The stark rise of Uber in China over the past year. From a 1400 rank to top 20 in 12 months.http://t.co/pmQfneHwdc http://t.…@jordanpwhite High five.@robhayes ... until we run out of water.My buddy @dtrinh built a fun way to make getting together with friends so much easier than texting. https://t.co/GARHf0dNyV@neilbearse @kevinrose @tferriss Holy shit I just laughed out loud.RT @carlquintanilla: IMF'ed. \n\n#greece@MikeGuimarin Do you have a link to where to do that?@DouglasCleary @michaelpollan Agreed. But this isn't in isolation. Lots more pointing in the same direction.@jeet_mahal I've read all about them and my mind is blown.I am fascinated by our gut microbiomes and their potential influence on our mental states.  https://t.co/ORHHlOWIlpA trap that almost every big tech company falls into.  https://t.co/iv86VALUNART @AYoungReporter: Teacher deleted post regarding #McKinneyPolice in which she said she \"was almost to the point of wanting\" segregation h…RT @nytimes: Using @periscopeco, @dguttenfelder streamed live video during his recent visit to North Korea http://t.co/6tjy3Wc0c0 http://t.…", 
    "@scobleizer": "RT @ChrisReimer: Learning about @blippar via this @Scobleizer video. No joke, I feel like I've seen the future https://t.co/VmFBrW7aLL #Vis…RT @kr8tr: From the just released @Scobleizer newsletter. Sign up here: http://t.co/zekC07dKp7 http://t.co/lhJd8QPw00@willdeasy Twitter has 300 million users. Facebook has 1.45 billion. Enough said. I ask every audience and EVERY ONE uses Facebook mostly.@PeterVogel Sorry, Twitter insists he just wanted to take off. No firing. OK.@drew Yes. Split hairs. Two weeks ago he said his job was safe.@catchyouri Not true anymore. I have 640,000 followers. You can find lots of new people on Facebook. Join groups, for instance.@digiphile @sambrook if you want to see everything on Facebook put everyone in a list, click on the list. You'll see all.@mhj There are ways to train Facebook to show more of me. Just put me in a list and read everything I do. :-)@DaveLeeBBC @sambrook @digiphile I was busy interviewing people who are doing things like changing the cloud. Sorry.@digiphile I'm sure. I FAR prefer talking about things over on Facebook. Twitter never really got the conversation thing right.@jordhy Two weeks ago he said his job is safe. Today he's stepping down. IE it wasn't voluntary.@VirtualTal It says Google doesn't get social.Twitter fires CEO. We are talking about it on Facebook. Which about says it all. https://t.co/nykerqmhL1Cool. https://t.co/B5LcB8MCQQGreat demo. https://t.co/ReGPUxtXvC@acroll no, I said it should be VR vs VR. In other words, which VR will win. Something like Samsung Gear VR or something like Oculus?First look at new Sphericam: https://t.co/J9EzPs8w0V 360 degree video is coming and coming soon!RT @offirg: Had a great time spent Friday afternoon with @Scobleizer discussing keepy as a way to save kids' memories with conte…https://t.…@Mickeleh Apple is still way behind.First look at ODG's new R8 smart glasses. This is a very important new product that informs our future: https://t.co/Aj7Kb8ObLyNo Gillmor Gang today but lots of geeky stuff on my Facebook profile at https://t.co/D0AkA6rM61RT @ProdPad: Check out our CEO @simplybastow talk to @Scobleizer about @ProdPad! https://t.co/xtlP7vll3VRT @richardtitus: I was invited by @Scobleizer to stop by for 5m product preview for @promptly - which comes out of beta next week! \nhttps:…@MarkLoundy Only Apple knows whether I do or not. Right? :-)@trick202 like I said, no. But I think he's like Steve Jobs. He tells the market what it wants to hear until he changes direction.@ActiveWin @HP doesn't make me feel all warm and innovative anymore. What you think?When Apple's Tim Cook speaks about privacy is he just pandering to our fears to sell product? My answer here: https://t.co/tZfPSXtEhBRT @FBTechwire: .@Scobleizer reflects on his recent experience at @iendeavors' Curiosity Camp http://t.co/T0ZtxKdGwLRT @stevegillmor: RT @TechCrunch: Gillmor Gang: Medium Fries http://t.co/bOb5cikjEZ by @stevegillmor @dbfarber @Scobleizer @jtaschek @kevin…Geeky fun. https://t.co/6B75CSdgWz@rynfnk @otgplatforms yes. Apple will get into VR and AR after everyone else does. And do it better.@anniepoohster I post whenever I have great content for my friends. If that's 20 times a day, then it's 20 times a day.RT @kr8tr: Love this from the latest @rackspace @scobleizer newsletter. Thanks @gapingvoid Sign up here: http://t.co/ILvudg0pAS http://t.co…RT @kindofstrange: If you haven't already subscribed, @Scobleizer puts out one great newsletter: http://t.co/EnKW8PB8D5@kmullett didn't know specifically about it but there are other cameras, like @jauntvr , that look better on paper.Even better stream for IO is at https://t.co/zByF03CtUy I'm talking about it at https://t.co/D0AkA6rM61I'm watching Google IO. Are you? Live stream here: http://t.co/QNczMsYsc0@isaacgarcia sorry made a mistake.RT @YalloApp: Robert Scoble excited about @YalloApp: makes your phone more useful. Android today. iOS in a month. https://t.co/8ORljKvvsU v…@cyrusradfar @ryan @ericnakagawa @msg Facebook is far superior to anything else. Why? Filtering https://t.co/D0AkA6rM61@edbott @chartier @anildash Rackspace also supports Office 365.@michaelburgi Agreed. Said the same thing: https://t.co/MiGSnHxCwi.@marcmenen @kpcb I summarized #MaryMeeker and #InternetTrends report here: https://t.co/MiGSnHxCwi Just for you!@kurtybot @kpmg It wouldn't. Plus, it wouldn't help my post's vitality if I posted somewhere else. And I DO track engagement on all platfrms@kurtybot @kpmg Might be. But that's where the people are. So that's where I go.@jordhy I might do that. But Facebook is where the engagement and people are.RT @mraudreywu: Insightful analysis of the #MaryMeeker #InternetTrends Report from @Scobleizer -&gt; https://t.co/aqxqhOYNM7@BenHess When? I can't be there until evening. I'm at +1-425-205-1921I dig into @kpmg's Mary Meeker's slide deck. https://t.co/S968o02Bfc Always interesting info.RT @richardjnieva: .@scobleizer doesn't think surveillance was the problem with Glass. It was more about violating the \"social contract\" ht…", 
    "@dens": "Muskrat vs Groundhog vs. Gopher vs. Woodchuck (vs. Beaver) -- topics for the afternoon #upstate on the porchSpent the afternoon hiking Overlook Mountain and exploring the ruins of the Overlook Mountain House… https://t.co/UsbsTkTJOpThe view is totally worth the hike (and sketchy tower climb) (@ Overlook Mountain Fire Tower) https://t.co/X4xypzV6GW http://t.co/XSo8DfhfafBloody Mary brunch in High Falls (@ Kitchenette in High Falls, NY) https://t.co/BNsaD8DfjqThis week on Baby Bird Talk™ --- They grow up so fast!  (yes, these are the wee baby chicks from last… https://t.co/5lANgiWAsqMy weight: 166.3 lb. I set my @WiThings scale to auto-tweet my weight once a week. It's the future!  http://t.co/7nZ7ln7WOp@chelsa @catwong3am. Just got ladder &amp; rescued our cat (Milky) from the roof. We woke up to him meowing from the wrong side of the window screens. #upstate@JohnBonini Nike laid down new turf for this tourney apparently and it's sick.4x4 women's soccer tourney. Big Nike Soccer setup (@ Sara D. Roosevelt Park - Nike Field) https://t.co/cJcH7CFpoh http://t.co/RkPsfCyl2DRT @AmericanOutlaws: Not today @IKEA... Not today. Your well-designed and affordable furniture will have to wait another day. #USWNT http:/…@uberdog @federico @foursquare Ha, already on it  :)@glipsman Give it a shot and report back.  Make sure to install the glances!RT @federico: Genius notification of the day: Actually at   smyth's before going to the butcher grill. Well done @dens @foursquare http://t…ProTip when watching #USWNT game tonight, you can also stream \"Tactical View\" on your iPad (via \"Fox Sports Go\" app) http://t.co/GMJmungJDb@hunterwalk @msg I'll throw ya a fav buddy!RT @danielle_duff: When it's #USWNT game day and a jersey isn't quite appropriate for work.. 🇺🇸 #SheBelieves #USAvSWE http://t.co/cjXZgFOEf7RT @BabyAnimalPics: RIP to all the Nintendogs who haven't been fed since 2007 http://t.co/WaND9W9tCdRT @fnxTX: It was much better when selfies were only accessible to those affluent enough to hire a painter and pose for 2 days https://t.co…RT @peteskomoroch: Uber launches video game to train drivers. Is the next step using gamers to train Uber's self-driving cars? http://t.co/…This place never gets old. (@ Vazacs Horseshoe Bar / 7B - @7bhorseshoebar in New York, NY w/ @chelsa @shaheenkabir) https://t.co/gGrHTDqFFeCongrats Shahee!  ps. They got London Pride here https://t.co/GNC4hDVDTU http://t.co/16nNnXfLOQRT @whatahowler: Brian Sciaretta on Jordan Morris http://t.co/WEbGSMKiDk http://t.co/2XXPKbfNZb http://t.co/VWrB0fRCuW@CJonesHBS Nice work. Admire what you guys are doing down there.Crashing MSFT's \"Listening Machines\" summit (@ Hotel Hugo in New York, NY w/ @picklesnumber1) https://t.co/Y2VB7TM4r9 http://t.co/50ffbp7FG9RT @Clayman: +1 -&gt; Early Twitter investor Fred Wilson defends Dick Costolo in a tweetstorm http://t.co/1Iu4TlCPKs@CaseyNeistat Dude this LV strap is pretty brilliant. cc @chelsaRT @ussoccer: Five wins. One Nation. One Team. http://t.co/peXCVCsNWVRT @Twyst: *AIR RAID SIREN* NEW CATS IN NEKOATSUMEYes I know it's only 11am. (at @ShakeShack in New York, NY w/ @jackosborne @courtneyetc) https://t.co/ishJ46Fmod http://t.co/GUi0t6uV6BOH: \"There's new cats in the cat game!!  There's new cats in the cat game!!!\" cc @chelsa @courtneyetc@mkarolian Related, you got Boston Globe creating tips left and right all over Boston? Happy to help! cc @SarahSpagnolo@mkarolian Check out 9.1 &amp; the curated lists you'll find in the \"Saved\" tab. I think we're on the same page. Expect more in 9.2 and 9.3 tooSneaking into 4SQ design team's outing to the WTC observatory (@ One World Trade Center) https://t.co/OkPXwObyDs http://t.co/oiEFYAIy2rNice touch @Timehop.  cc @chelsa #JurassicWorld #JurassicPark http://t.co/cHJ4OnU9w7@mkarolian Like long form reviews? We'd rather be engine that proactively recommends than the editorial voice that explains what's on menu.RT @bryce: looks like Along the Way app uses @foursquare’s API for road trip planning. pretty slick!\nhttp://t.co/uZ2NPOLozcRT @UlkoProd: @swarmapp I've unlocked the Streaky sticker. So happy !!! http://t.co/84dBlIF8Fi@Holger @randyjkim @jcro @arainert @bastian Hahahahhahah!RT @MLS: Netherlands ☑\nGermany ☑\n\nThese guys. http://t.co/w3eiUokBi1 #GERvUSA http://t.co/K7GEgBfYMeI said it last Friday and I'll say it again... 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸  #USMNT@Holger @bastian @jcro @GPWDesign @arainert @mmilberger HA!RT @Holger: @dens @bastian @jcro @GPWDesign @arainert @mmilberger Walking to the tattoo parlor now!@NashvilleFC Hey hey, did you guys end up as 100% supporter-owned (or did you end up going 51% like @SFCityFC?)@kurtbradley @chrismaddern @foursquare Veggies are people too!RT @chrismaddern: Good job @foursquare http://t.co/VfR8NKJA8URT @ussoccer: #USMNT XI: Guzan; Chandler, Alvarado, Brooks, Johnson; Williams, Zardes, Diskerud, Bradley; Johannsson, Agudelo. Watch @FOXSp…@Holger @fckoeln @bastian @jcro @GPWDesign @arainert @mmilberger Does the \"Holger gets a USA flag tattoo\" bet still stand?Iced coffee run (@ Little Cupcake Bakeshop - @littlecupcakeny in New York, NY) https://t.co/StJtvWl1NURT @Gallagher_Rich: @NYCDadsGroup good rundown of local spots for Father's Day from, oddly enough, @dens &amp; co @foursquare http://t.co/CFjWR…", 
    "@benioff": "RT @CNNMoney: .@Salesforce CEO: I don't see a startup bubble\nhttp://t.co/mZQliYwEpm via @MattMEgan5 @PoppyHarlowCNN http://t.co/fXUpiS7IuORT @erictstahl: Indy (and Salesforce) welcomes all @Benioff http://t.co/JZYsbTgCMMRT @VXFlyer: Thanks to @salesforce and @Benioff for calling out #RFRA and supporting the #OutForce employee group for #IndyPride http://t.c…RT @CNNMoney: .@salesforce is now 71% male. CEO @Benioff tells @PoppyHarlowCNN why women need to be 50%: http://t.co/5XuqegutmU\nhttps://t.c…RT @jeffcortez: Benioff: 'The business of business is not business' http://t.co/mLQUrN43VQ via @CNNMoneyThanks @PoppyHarlowCNN for having me on your show!  http://t.co/rWPUN50oTHRT @PoppyHarlowCNN: .@Salesforce CEO @Benioff tells me The business of business is...improving the state of the world\" http://t.co/PCteCCcu…Very inspired by the great director @DarrenAronofsky tonight!RT @Napadowntown: The vino-tastic @Winetrain gives Father's Day a different drink-themed spin!\nhttp://t.co/C6lpgttG3W http://t.co/bjFpEx5LfdCongrats @dickc! While CEO grew shareholder value from $1b to $24b. There are not many CEOs who delivered 24x over their tenure. Well done.RT @jack: Thank you for everything @dickc! You're a selfless leader who's built an amazing team and company #proud https://t.co/52z4TIYIUhRT @Glassdoor: Congrats @Benioff! You’re a Highest Rated CEO thanks to @Salesforce employee feedback http://t.co/yAhMPtjNzK #TopCEOs http:/…RT @salesforcejobs: Salesforce’s Marc @Benioff is one of the Highest Rated CEOs on @Glassdoor! We couldn’t be more proud. http://t.co/lPNVB…RT @suzyhathaway: Nur noch 3 Wochen bis zur #SalesforceTour in München! Marc @Benioff ist wieder mit dabei! http://t.co/L9NF5MK326 http://t…RT @jhynes1: @Benioff just called out for supporting #equalpay by Patricia Arquette http://t.co/EKysgl36gXGreat to see @janemariechen with @jimcramer! http://t.co/B4HXEUWJuPGreat news from @SFUSD_Supe. http://t.co/EiRayXIaA9Great to be @kristenkoh at the screening of @entouragemovie! http://t.co/Q7fg4f0N0bRT @lesliejtom: Rollercoaster #WarriorvCavs game w #Dubs tought loss &amp; halftime fun w @Benioff &amp; http://t.co/2gVWNmwA4e on jumbotron http:/…RT @PoppyHarlowCNN: .@Benioff Thank you for the fascinating interview &amp; tour of @salesforce HQ.  Folks -- wait until you see Marc's office!…A great review of what Salesforce is doing on the Apple Watch on @CNBC http://t.co/kFqeoRLS09 by Salesforce's Lindsey Irvine.RT @kriskonietzko: 3 Key components of Salesforce for Apple Watch: Lindsey Irvine from @Salesforce on @CNBC http://t.co/wzWrQWaamKRT @SFBusinessTimes: This @salesforce exec is a globe trotter, with a keen eye on #wearables http://t.co/sbxN4na6bd #SFBTunder40 http://t.c…Great being with the one and only @PoppyHarlowCNN today! http://t.co/tOeDI5Yes5RT @PoppyHarlowCNN: En route to SF to interview @Benioff @salesforce HQ.  Got a question for him?  Shoot.Great video from @UCSFChildrens and @RobertLustigMD on added sugar.  https://t.co/znCopwdjxfRT @UCSFChildrens: VIDEO: We’re saying goodbye to sugar-sweetened drinks! Here's why: http://t.co/1eCbGodnzO @CCPHA @SugarScienceNow http:/…RT @jessetamplen: UCSF Benioff Children's Hospital Oakland sponsors Healing Hearts Suicide Prevention walk. @UCSFChildrens @lisaozaeta http…RT @UCSFChildrens: It's National Cancer @SurvivorsDay! RT to support all the brave kids who've fought cancer! #CelebrateLife #NCSD2015 http…RT @lelandkim: Wonderful seeing @UCSFChildrens &amp; @Hospital4Kids' #redefiningpossible campaign throughout the city. http://t.co/EeSBLzcsSOAmazing look at the Oceans on world Oceans Day with @SRuhle and @SylviaEarle!  http://t.co/2N0W6McgEr@warriors @iamwill its @BobThurman looking up :)It turns out if you catch the @warriors ball you don't get to keep it!  Thanks @iamwill! http://t.co/Nzec097Jf1RT @BenEyeSF: “@VXFlyer: Pals @Benioff and @iamwill cheering on our @warriors courtside at tonight's #NBAFinals game #DubNation http://t.co…RT @VXFlyer: Pals @Benioff and @iamwill cheering on our @warriors courtside at tonight's Finals game #NBAFinals2015 #Warriors http://t.co/M…@ctylerabc7 @abc7newsBayArea that was truly amazing.  Do we need to suit him up?  :)The way up.  @CityNational Go @warriors! http://t.co/QBUDjaxo35Go @warriors!  Go @iamwill! http://t.co/0qI5g2NFhbRT @Seasaver: Think deeper on #WorldEnvironmentDay. 71% of Earth is ocean. 95% is unexplored. http://t.co/hfUokLQzpLRT @kitson: 71% of Earth = #oceans. \r\r95% is unexplored.\r\r#WorldOceansDay is Monday. \r\rhttp://t.co/FCbMr7FGe7 ^ @isaacleep @Seasaver cc @Be…RT @UCSFChildrens: A child’s illness affects the whole family. Here’s how to support a young patient’s siblings: http://t.co/rw5yzc1KVr htt…RT @arrington: Happy Birthday TechCrunch http://t.co/V6n82IwgX1RT @MCHammer: That gave me a good laugh 😭😂😭 He said \"but I didn't say anything\" you don't have to it's written on your face 😭 #Dubs http://…RT @msaldi: Read about two eras in enterprise software, Before Cloud (BC) and After @Benioff (AB) by @kmehandru @trinityventures. http://t.…RT @jellis_tkp: Ty just built a computer...no big deal...@TeamKano #teachingkidsprogramming #tkp http://t.co/ktN2JEoIx9RT @UCSFChildrens: Lifesaving care is closer than ever for California kids with our helicopter, Bear Force One! http://t.co/VCI8zThLJ7 http…RT @SenSchumer: Let's pass the #PATENTAct for the good of America. Watch more of our hearing here: http://t.co/UBz4yn1hJP #patents #fixpate…RT @EngineOrg: And that's a wrap. PATENT Act moves out of committee on a 16-4 vote. On to the floor next. #fixpatentsRT @SenSchumer: #PATENTAct passed out of the Judiciary Cmte w/ 16-4 vote. Hope that this balanced &amp; bipartisan bill will move quickly to th…Great job by @SenSchumer on bring patent reform a reality.  This is a great advancement for our industry!", 
    "@tonyrobbins": "LYAO  Watch Comedian John Oliver take on the $330 billion a year prescription drug industry\nhttps://t.co/Ihz5tMLgZkINSANE 70% of USA take 1 prescription medication 50% take 2 &amp; 4 billion prescriptions were written last year thanks 2 Drug Company MarketingWhat every graduating senior should learn about money BEFORE college: http://t.co/NimkzlycKhhttp://t.co/Q2XdFqJj81Had dinner with my dear friend Steve Varsano http://t.co/T1oerj5Whs &amp; his lady Lisa &amp; The Arts Club Mayfair london http://t.co/U3K7k8dnIsHow cold water immersion can change your life, making you and your body more powerful: http://t.co/xNBsk8AD3dAre you being emotionally manipulated by your bank? Find out: http://t.co/YTFLh5hM6mhttp://t.co/1hYqOTrLBLThe Door You Pick Can Tell Your Future. Take 2 minutes &amp; have some fun with this... http://t.co/E3IiQwfAWeRT @socialmedia2day: What #marketing lessons can you learn from #GameOfThrones? Plenty: http://t.co/Veb1Gf5Ulx by @adhutchinson http://t.co…http://t.co/I05cTXJa3ZThe investment advice @WarrenBuffett gave @LeBronJames – and how it applies to you: http://t.co/xjULTQtsz4RT @dmscott: The #BusinessMastery gladiators! Crushing it in real-time at #BMLondon http://t.co/x5sWpJsNd7RT @DraganTweets: Watch the video of tony explain how he will be a hologram at LIVE BUSINESS EVENT @tonyrobbins Check out https://t.co/Gf3U…Magic giving Warriors co-owner Joe Lacob &amp; I insight on Lebron in the fourth quarter Time out http://t.co/kuzHOz2IQLThe most incredible game I ever attended Wow! Congratulations2my dear friend &amp; LAFC partner Warrior owner Peter Guber http://t.co/rMPxCICUKh78-77 warriors lead 4th quarter, my partner in LAFC Magic Johnson &amp; my son josh court side magic-  amazing comeback! http://t.co/Ouaye46XhEFeel like there aren't enough hours in your day? Maybe you are falling victim to one of these 10 time-sucks: http://t.co/DZDFoYkbYaMarc is a dear friend, A force of nature, and a force for good! Read –The Fab Life Of Billionaire Marc Benioff http://t.co/jQqS0wjvElHow giving a little can change a lot... http://t.co/jpTphXjGmnhttp://t.co/Aozo1l2BeATo Increase Your Productivity up to 200 Percent, Ask These 3 Questions | http://t.co/uMTeeQOyuA http://t.co/cmf0nBKzPaI'm conducting my first seminar event by Hologram! Check it out... http://t.co/5T9i7ANOdZWhat is the true power of leverage? 5 ways to get more from less: http://t.co/tKthHuzJdXhttp://t.co/kGQVZf2lKQDare to do more than dream – make your dreams reality. Start with these 5 simple steps: http://t.co/HmpWsfzAKdIf your body could talk, what would it say? Here’s what you need to know about toxins and waste: http://t.co/ZpkVb6WxUchttp://t.co/u6ahVKZvwqOpen-Source Cyborg Hand is Making Prosthetics More Accessible Than Ever http://t.co/q644jT23MoFinally some sanity! Oregon Organic Farmers Beat Monsanto As Federal Judge Upholds GMO Seed Ban http://t.co/pSqc0yOrXbShould You Consider a Roth 401(k)?: Charles Schwab http://t.co/XBNFOYofZgMy book was named a ‘best summer read’ for 2015 via @GOBankingRates http://t.co/sJ8zkjUPUu #SummerReadingRT @djevaguine: One of the best book I've read so far! Money Master the Game by @TonyRobbins http://t.co/GupjfZ2MVI A priceless gem http://…RT @carltonbrown59: When you're in the darkest place, when you feel there is no way to turn it around, remember this...\"Victory is Near.\" -…Millionaires share their top 3 priorities in life - Yahoo Finance http://t.co/Eba8YVdV9dNot Buying a Home Could Cost You $65,000 a Year - Bloomberg Business http://t.co/YZoa9PTrNRMillennials in Texas &amp; in California reject home ownership for vastly different reasons -known as “generation rent” http://t.co/5mtqJiSx76RT @derekcarlson: When I read this I think of my mentors @chibbs_1 @TonyRobbins @mcuban @TheSharkDaymond and @garyvee . #LifeLessons http:/…Are you pH balanced? What you need to know about your body’s acid and alkaline levels: http://t.co/qbJ4YNBgMSJoin us at #UPWChicago and transform your life! Save 25% on tickets today: http://t.co/NfLa0LLTRQ http://t.co/MxEPKT9uFxRT @EntrpreneurDIY: Awesome reminder at the beginning of the day! Stay #consistent and what you dream will be yours. Thanks @TonyRobbins ht…RT @EricEdmeades: Just read @TonyRobbins' new book on money &amp; the money industry. It is not simply a best-selling book, it is an IMPORTANT …Congratulations to the Warriors &amp; my dear friend co-owner @PeterGuber on their Victory! 1st time to NBA Finals in 40 yrs-what a turnaround!👊Why did Bill Gates and Marc Benioff decide to invest in these food technology companies?  http://t.co/yLgNn9ku0yVisualization works, but visualization with incantations can take your quality of life to the next level: http://t.co/07lYjiUKWbhttp://t.co/D6Sm9VoVSrAre fees eating your 401(k) alive? Learn how to stop the bleeding: https://t.co/jard7xFNkJIf you haven't seen the The Tim Ferriss Experiment, check it out here: http://t.co/giwwtDDJ2R\nTim is brilliant, fun, and dear friend. Enjoy!Vacation like the truly wealthy: http://t.co/2rkianUZCZhttp://t.co/bIVkzv3eJF", 
    "@johnsonwhitney": "Can companies turn their good values into good value? Good advice from @_marktan_ in @usnews  http://t.co/jBe0EstJYN …Top experts always recommend these 4 books: http://t.co/SmTRYWPFXb via @TIMEIdeas by @bakadesuyo feat @lizwiseman @claychristensenRT @AndreeaAyers: How @AndreeaAyers turned less than $1,000 of savings into a business that earns $200,000+ a year http://t.co/M4OINooyu5 v…RT @honeybeecap: Nature knows about diversity - what can companies learn? Great points from @johnsonwhitney http://t.co/bg5YMx2MWb #biomimi…On Diversity: Birds, Bees and Colleges Do It, Companies Can Too. http://t.co/71md6S9eMa@MartyCrampton @ScottKEdinger yes you do.Congratulations @susancain on your Quiet Revolution.  http://t.co/zajhUYAGyM\"To truly go on vacation, you need to be convinced the world can live without you.\" @scottkedinger @http://bit.ly/1JMwbdj v @johnsonwhitneyCongrats @sarahtavel!If you want to disrupt, diversify. -- Mother Nature v @johnsonwhitney  http://t.co/tauFN8cT31 #disruptyourselfRT @3PlusInt: TY @johnsonwhitney for the kind gift of your books Dare Dream Do for our event #3PlusBrussels! http://t.co/zbZlXPw1V5 http://…On diversity:  Nature is apolitical. It is neither republican nor democrat. It just cares what works. http://t.co/EjhoLdla3ZRT @ruthannharnisch: Put your $ where your feminist values are: buy where women are valued. https://t.co/GzfYvwJour @BuyUpIndex @plumalleyc…!  @tammytibbetts So happy to see @LeaGoldman join the ranks of Executive Editor at @MarieClaire! Congrats, Lea! http://t.co/9f3qrlLvrv …Is diversity really beneficial? http://t.co/EjhoLdla3Z c @springboardentColleges Understand Diversity is Fundamental to Innovation. Why Aren’t Companies Taking Note? http://t.co/EjhoLdla3Z c @harvardMy 'disrupt yourself' newsletter is coming out on Thursday.  Have you signed up?  http://t.co/9gp9bHdplEhttp://t.co/4vZvSxuN9q@tferriss Lots of amazing women @FortyOver40!RT @jessekagan: @tferriss Hey Tim, any chance you could get more females on the podcast? Lots of ladies out there doing great things but no…@imkeithlloyd It was so nice to meet you today!  Thank you for making these connections! Here's the dialect quiz.  http://t.co/tWl15YNt9yJoin me! I just voted for @AliceHeiman in the @Chase $2M #MissionMainSt Grants program! http://t.co/gFV8ZOrkPDRT @JarridWilson: Love this from @RickWarren! http://t.co/j8EEKX7DCRRT @KimmiCFlatWorld: A goal should scare you a little, and excite you a lot. - Joe Vitale #quoteWonderful news! My friend @susancain just launched Quiet Revolution—an inspiring new site &amp; community for introverts: http://t.co/FfrCWzu3HURT @asymco: The revolution in television will not be televised@beckyrbnsn  one traveling your worth of sleep!@beckyrbnsn I always say, sleep on it!  Then decide!RT @SpringboardEnt: 13 DAYS til the priority deadline of #tih2015! Build connections &amp; reach your next milestone. Apply now! http://t.co/9P…RT @FredEnde: Ah, kids today.  So much more entrepreneurial (via @HarvardBiz @johnsonwhitney): https://t.co/ftMMHGakJu #edchat #edu #ptchatRT @MeredithFineman: Watching Divergent for the 11th time always reminds me with great pride that I introduced @johnsonwhitney to #theojamesRT @sloane: Eat better, feel better! This week featuring opps from @getfarmivore @blueapron @EatWith @Ingredient1 @UncommonGoods: http://t.…RT @sabinanawaz: https://t.co/MjGUimEETQ Great food for thought as we think about \"Generation I\" via @johnsonwhitneyThe most important questions in life don't have google answers. -- @SheriDewHow policymakers can make America more entrepreneurial: http://t.co/3Oh1FoFcf8 v @NewCommGlobal @harvardbiz #disruptyourself\"The future you want is non-linear\". 5 things disruptors know about the future by @wef http://t.co/6Jw5sSr6aX #disruptyourself@LawtonDigitalMg @michaelianblack Thank you  -- that made my afternoon!RT @LawtonDigitalMg: For influential #business insight follow @johnsonwhitney, for #comedy gold, follow @michaelianblack #FFRT @SamayaCoLLC: Today's teens instinctively understand personal disruption. - @johnsonwhitney http://t.co/9JLepH6f2j #generationinnovation…RT @johnmaeda: “Venture-backed companies with women female executives have higher success rates.” —@JohnsonWhitney https://t.co/q1KVlqsxL4@johnmaeda Great to hear your voice John!  And thank you.Happy Birthday @beckyrbnsn. Your social media smarts, business savvy, competence and generosity amaze me.How many times a day do you say \"just\", weakening your position? Great piece by @chep2m \"Just\" say no! https://t.co/M3wCtuP3f1 v @wendysleaOvercoming challenges gracefully isn't a consolation prize, it's a priceless gift. - @Shelly Burr http://t.co/1WcUsqhS6P v @johnsonwhitneyRT @ExecSpeakers: Need a #keynotespeaker who's a leader in #disruption? Check out @johnsonwhitney:  http://t.co/UnVI0UCM9u #eventprofs #mee…@ExecSpeakers Thank you!  I really appreciate it.Innovators, apply for @SpringboardEnt #Tech Innovation Hub! Applications close on June 16! #tih2015 http://t.co/lEh7rQ3lTJMy newsletter is about to go out.  Have you signed up?  http://t.co/9gp9bHdplE.RT @beckyrbnsn: Frm @johnsonwhitney Shelly Burr |My Daughter Has Spina Bifida http://t.co/nJqLkt9moyRT @RWartzman: .@johnsonwhitney: \"The abysmal job market for teens is forcing many of them to think differently about work.\" http://t.co/BL…", 
    "@howardlindzon": "@hunterwalk why not add a tag line like this note from Marc getting great feedback or his ESPN photo will blow your mind?You have money with all 25 and not quoted ? https://t.co/T7XBYDoNUs@ReformedBroker my view is I would not let him in my raft@turtletrader59 thanks for getting it.RT @bfeld: Putting Record VC Funding Levels in Context of Internet Usage Growth – 20 Years of History in a Single Graph - http://t.co/AN6Vk…@fdestin in London Wednesday ... Dinner with @jobsworth and I Thursday ?Thanks for the free shaved ice @KevinColleran ... Facebucks FTW@stolper they brought my fave pants back which are my go to sleep and travel attire@stolper well you have issues. Back next weekend. Let's hangOff to #belfast - of the 6 pieces of clothing (including socks. Shoes and undies ) it's all $nke $ua and $lulu http://t.co/tD3In0x1ZE@ritholtz @ReformedBroker the food on his shirt is so youRT @StockTwits: These are the assets behind almost every US household https://t.co/8u7QpH3spx $SPY $TLTRan into @ritholtz randomly .. @ReformedBroker http://t.co/jIGvT1j2eQ@jmthurow94 share on Stocktwits. ThxRT @StockTwits: Household net worth has never been higher.\n\nIncredible stat from @ryandetrick -&gt; http://t.co/tmjwRagc1E $SPY http://t.co/T3…Bloomberg TV let me dive deep into creation and history of #Stocktwits the $cashtag, Twitter and the river https://t.co/6jDkTRBc73 $twtrDeath by $uber .... $TAXI http://t.co/PY4DnlDQTgAn Aliyah just got a lot more exciting  https://t.co/Ewhvvb1EO7The @The_Real_Fly by night  https://t.co/ONFCLtJQ31Stocktwits Found a new way to measure fear and volatility in the stock market -&gt; http://t.co/bT5s0W3YA5 $VIX http://t.co/7Bd5dUAN9c\"@ivanhoff China Small-caps ETF $ASHS is up 200% since last June.\" http://t.co/b9fvwUQVx1StockTwits Saturday $STUDY Session: Howard Marks and \"Risk\", Part 2: http://t.co/lqB56OsqRF via @awealthofcsStockTwits Saturday $STUDY Session: Howard Marks and \"Risk\", Part 3 http://t.co/yPvF0MTBhs via @spqr09\"StockTwits Saturday $STUDY Session: The Stacked Deck against Volatility Products http://t.co/l4UMMpdzIz via Salil Mehta\"StockTwits Saturday $STUDY Session: ...speaking of stacked decks -- prop bets in cards and markets http://t.co/18mNbp2dKdStockTwits Saturday $STUDY Session: @peterlbrandt shares lessons learned about drawdowns http://t.co/VCwfO8KiLH\"Saturday $STUDY Session: The essential need for trading routines, and the need to break them http://t.co/mu7o7LKIPm via @steenbab\"StockTwits Saturday $STUDY Session: 10 big lies the financial industry likes to sell http://t.co/QLKpmMC0Wa via @RPSeawright\"Saturday $STUDY Session: It takes courage to be a pig. @ameshkati on leveraging a good year into a GREAT one http://t.co/O7COzn6SN5@robpas what was name of lunch spot ? Left my credit card. Total Howard moveFriday night Stocktwits Roadmap steak dinner https://t.co/oluJSKY2vP@JohnMaloney I wish@JohnMaloney saw that in 1999 now we have the opposite being too late. The middle is hopefully next as new platforms for liquidity emerge@JohnMaloney I disagree. But there is a right time and place for everything.@shimblum I am public. Buy me@frzndgoash possibly. Even probablyI just got asked by a lady for the time. I asked her for a dollar and to follow me on Twitter.$TWTR down on the day as I suspected. (No position )RT @zerobeta: I can’t wait for 10 years from now when we’re all still debating Greece on Oculus Rift.RT @zerobeta: Tinder but for Twitter CEO’s.RT @zerobeta: When people talk about ETF’s on StockTwits, Volatility is just around the corner. http://t.co/xKuQEM8zuoRT @zerobeta: There has never been a Twitter CEO who didn’t have a four letter name. Bodes well for Adam Bain.RT @m_cof: The largest company by revenue in each state. In California, Chevron beats Apple http://t.co/UlQQdfWvMc http://t.co/CS3clOZ13kRT @StockTwits: Twitter has given back all of its gains since announcing Jack Dorsey as CEO -&gt; http://t.co/lmGpwFb4oA $TWTR http://t.co/l5a…RT @RudyHavenstein: Federal Student Loans went from $0 in July 1993, to $881 Billion today. Up 6.5x just since the end of 2008. http://t.co…RT @StockTwits: Save this now.\n\nHere's an incredible visual from @alphatrends. On market structure -&gt; http://t.co/NcQFjMwPcX $SPY http://t.…I have been misGIF'd ....people have a lot of spare time  https://t.co/o0xr0aPxEgGeez ... Twitter up 18 cents. Very confused and what Wall Street believes overvalued core business $twtr@BettyWLiu thanks for letting me explain the original vision@yentrog31 no. Twits is a play on institutions being twits and retail having a strong voice", 
    "@dtapscott": "Meet my new business partner and coauthor of our newest book, @alextapscott - he's my son too! #BLOCKCHAINREVOLUTION http://t.co/I1GtypwcH0Happy Birthday Nicole Tapscott -- the most wonderful daughter a dad could ever have!  #mydaughterrocks http://t.co/mXuMulgfaz@jennapilgrim Awww. That's so kind Jenna!Fun times! With @JustinTrudeau http://t.co/Gxla9K1e05veryone’s betting on blockchain because we need technology that can scale http://t.co/JURdcR4dTU@spaikin Hoping your expense accounts are in order.  You may be the last serious Canadian TV journalist standing..22hertz is the First Band to Copyright Music on the #BlockChain http://t.co/Q00XhcEypu #bitcoin@UinvitedU @globebusiness @wef @GlobalSN me too!Google is starting a new company to improve cities http://t.co/kdoPeKvUDr@angielim You must be ..Canadian..@MikeNelson @wef Thanks!  It’s going to be interesting!Prosthetic Limbs, Controlled by Thought http://t.co/aFnNZleXdSRelease:  Don Tapscott to Join World Economic Forum’s Global Agenda Platform as Senior Adviser http://t.co/RZeBhb8Ck5 via @wefI'm pumped about this for sure! \n\nhttps://t.co/JVwcELsInc\n\n https://t.co/irxQU8eonj@thomaspower @nigelwalsh Thanks lads!Will #blockchain help global infrastructure? Join @alextapscott in #london &amp; have your say: http://t.co/nasA7FBl1P http://t.co/CyIkUr2H8gNASA is indexing the ‘Deep Web’ to show mankind what Google won’t http://t.co/5tHp9XEWx8How can #blockchaintechnology help distributed global infrastructure? Join @alextapscott in #london &amp; have your say: http://t.co/nasA7FBl1PStay tuned! https://t.co/rvL5oDtmilHow to be a predictable success http://t.co/bJ82BMJXdy@trentulee Thanks Lee!The Cryptocurrency-Based Projects That Would Pay Everyone Just for Being Alive http://t.co/TznGQKzIBH@tonilanec of course!@shoez Thanks but that didn't help.@tonilanec @penguinrandom @alextapscott Not soon but will look you up.  Are you a candiedagte to be interviewed?  main area of expertise?@DavidWLocke huh?The truth about North America's graduation rate http://t.co/vdJiGjq4baSuicide rate of female military veterans is called 'staggering' http://t.co/6FtCzwzboj #CAMHGREAT NEWS!! @PenguinRandom House to publish #BLOCKCHAINREVOLUTION by Don and @AlexTapscott. http://t.co/OOTzJNhj2T http://t.co/5kg0HkclUt@mwest_ Yes I can log into tweetdeck on line.  Can't get the app to work on my MAc.@mwest_ Ah. Yes I did.What you’d need to earn in every state to rent a decent apartment http://t.co/IQ0mWUkCciGiving Up The 9-To-5: How One Startup Helps Moms Stay In The Workforce http://t.co/JdLO7G2V4wGeorgia's Giant Clay Pots Hold An 8,000-Year-Old Secret To Great Wine http://t.co/RkHh26Hyl7@shoez OK will try.@mwest_ twitter auth?@mwest_ What?  when did that change?@shoez a blue screen and spinning wheel.Anyone have theories on why my Tweetdeck app (MAC) refuses to work? I've reinstalled. Tried everything.Jaw-Dropping Visualization Will Give You New Respect For The Sheer Number Who Died In WWII\n\nhttp://t.co/Mtj1zmTgpR@breza91 Thanks!College Dropouts Thrive in Tech http://t.co/kTXgVB6toOWhy Technology Hasn’t Delivered More Democracy http://t.co/HNqhUNpCazGoogle Street View takes you under the streets and deep into the sea http://t.co/Zteta6bfBbThe surprising way the world is becoming more like it was a thousand years ago http://t.co/DbiFeiuxyP@rmchase Thanks so much!@rmchase Do you have a deck I could see?@breza91 Can;'t find you.  I'm http://t.co/tdpVR0wVtZ@breza91 @TrentUSoE @theTCSA More fun!@breza91 See u on Facebook too?", 
    "@garyvee": "@karangoel uupHow to use Twitter video - 📹📹📹📹---&gt; https://t.co/bZ2AuNihPT@kristinkgl tYE thank you economy :) ❤️❤️❤️❤️❤️❤️❤️@kristinkgl I don't read books :(@kevinryan :)The assistants ... These amazing men have been my 5 assistants over the last 6 years ... @philtoronto… https://t.co/8bfi0GQRskRT @ajv: #ajvsquared weekend is here! 🎉🍻❤️💍☀️😍 cc: @AliCioperSoooo @ajv is getting married this weekend :)Dare to dream ? 📹🎥📲📺 https://t.co/mdBUe395YgThe Surefire Steps for Dealing With a Pissed-Off Customer — Medium https://t.co/tNrQOxbC6b@adnys @sacca wineSEO trust me I know ;)@ChrisReimer Facebook ads ... On Yt and everywhere else it isn'tGet on new platforms - the video https://t.co/3boprw86EYSleep is super valuable ... It's what u do when u are awake that I'm curious about :) http://t.co/o49nFeTjroFor one day ... Today ... Look on the Bright side instead of \"Looking\" for the flaw http://t.co/BRfYJshQKj@alejandroreyes @MoreWillie have u 2 connected yet?Twitter video ... Do u fully understand it's power for YOU?  https://t.co/nSmId2nNpq@benrhodes appreciate the follow@RepDonaldPayne appreciate the follow@SpaniardMMA appreciate the follow my man@dennisbaker appreciate u man... East coast love baby@SocialNetNanny xoxoxo@DocSheldon @ajv wedding ... I'm totally MIAThe Rise of Video Marketing on Social and How It Affects Your Business via @garyvee https://t.co/9zjn0PrOUQ@keithpape ;)@jonnastor @stevenhutt @TheRealDeis @demayo_matt it's done ... Matt book itA lot going on at Twitter obviously but don't miss the big story -... https://t.co/bZ2AuNihPT it's new video product and what u can doThe rise of video content marketing on social platforms https://t.co/9zjn0PrOUQ\"Sweet knot, bro\"!\nMikMak | Key Cable by Native Union https://t.co/L4WmhV4uR4@RealLyleFoxman abhahaah@jonnastor @stevenhutt jon what am I missing ? :) @TheRealDeis@RealLyleFoxman to who?@CJHALLOCK http://t.co/2MxGVQntXk@realtonycohen http://t.co/wFYAl2cNen@TomDudar http://t.co/6gmRJwaITP@kwak_justin http://t.co/zMdQGrvCJ9Adjust ... Today don't cry about how u want it .. Excite on how it is !!! http://t.co/J9CFxObs1O@joshdburnett http://t.co/EFzcG59ZBn@LewsView http://t.co/YYo67m1c9iRT @TVREV: Why 9 seconds of LIVE #VIDEO can change everything.  https://t.co/xcfcS0Qlsu@urbangeekcny hack it brother@joshdburnett who was that amazing person?Twitters new video feature in action - the video ... All about access and effort  https://t.co/nc6hc1DD2J@scotpansing thx for the tweet brother@patbrix thx brotherblow for mobile advertising: next version of Safari will let users block ads on iPhones and iPads http://t.co/OpjpIymNbd content people!!!@atifatif we should share a drink one day :) @demayo_matt#AskGaryVee Episode 109: Stupid Questions, Integrity, &amp; Gary Gives Relationship Advice \nhttps://t.co/9EtnbD0ucV http://t.co/MjkvRzvcZW@atifatif appreciate it :-)#AskGaryVee Episode 109: Stupid Questions, Integrity, &amp; Gary Gives Relationship Advice \nhttps://t.co/9EtnbD0ucV http://t.co/Wnek5ZWQMB", 
    "@ericschmidt": "\"We need to become more unreasonable but in an intelligent way.\"- Governor Jerry BrownMany great points in this compelling letter about the economy, jobs, and the digital world.. sign up !\nhttp://t.co/CQIMbDyrSCYounger people really are smarter: the Flynn effect \n\nhttp://t.co/Rrfb7kNYyOMary Meeker: Always the best deck in the business, the growth and the new platforms we will all use:\n\nhttp://t.co/fnexOH6YDCRT @VTSandsman: The text of @ericschmidt 's May 2015 #VirginiaTech commencement speech: http://t.co/QioPVywAGs @googleThe excitement of graduation: A college education really is important.  My words but their joy !   https://t.co/Dp9fld3UajSearching for Better Answers.. Zeitgeist London Google's Foundation: on the cusp of a major advance human progress  https://t.co/tFAJGE3UPxRT @VTSandsman: Warming up our voices #HokieGrad @ericschmidt http://t.co/4Vqw6OirgOInteresting report on converting London to all-electric city by 2035 ... quieter, greener, and more efficient too! http://t.co/lEZpRAN4QbAtul Gawande's extraordinary article on the overtesting, overbilling and overtreatment of our medical system http://t.co/wf3iMsMEkHThe coming Data Science Revolution  http://t.co/8qx1cFS15hDr Kissinger talks about the new world order.  His answer on Iran worth watching starting at 31 minutes.\n\nhttps://t.co/g6a61XGSpuPhishing continues to be one of the most common and dangerous scams online. Download Password Alert protect yourself \nhttp://t.co/hInXbw0UcBClimate change is real. It's important for us to do something to make the world a better place, great to see California leading the way!Will have to make do without BYU, though. No one said this was easy... #MarchMadnessOkay, my picks are in...and based on #GoogleTrends. Going for Bloomberg's charity title on behalf of @GirlswhoCode! http://t.co/rTGbrE124YI used my 272 words to write about Lincoln's dream of a 'new birth of freedom.' In a new digital age, his dream still resonates.Worth your while: 'Gettysburg Replies', with essays by Colin Powell, Spielberg, etc, 150 years after the Civil War. http://t.co/QhnvCWf9ydWow: paramedics use Google Translate to converse with a Swahili-speaking woman as they deliver her baby...in Ireland. http://t.co/IoZ9ePWTwhOne million followers! Very exciting. Now just need to figure out how to connect the next five billion to the Internet ... thank you !\"No man ever steps in the same river twice, for it's not the same river and he's not the same man\" -- Heraclitus (greek philosopher, 544BC)RT @USDOT: The guy at @google who works on driverless cars rides an electric skateboard to work. And we thought #transit was cool. #BeyondT…Big news for our friends in Atlanta, Charlotte, Nashville, and the Research Triangle. http://t.co/zz8PW6eXZ2 #GoogleFiberWhen did I know Google was different? Pretty much the first day. Our fun talk with @SalKhanAcademy is now online. http://t.co/fw4HgXqsplGoogle Search is expanding a feature that connects victims of human trafficking to groups who can help them. Proud. http://t.co/GIaKOUgyNiRT @AdviceToWriters: Cut out all those exclamation marks. An exclamation mark is like laughing at your own joke.\nF. SCOTT FITZGERALD http:/…Every time you use a phone, or a computer, you use the ideas that Alan Turing invented. A hero. http://t.co/dwbHXRBuYQMore crazy ideas this year than last #workresolutionsRT @GoogleforWork: For the second year in a row, we're focusing on ‘what works’ at work. Share your 2015 #workresolutions with us. http://t…Susan is always right, and I wish men (and women) would listen to her: http://t.co/5Yu0DJid1mRT @jjrosenberg: Appreciate being included on this list. Hope #HowGoogleWorks' 'unconventional approach' helps others succeed!\nhttp://t.co/…Good list of key disruptions in #businessweek85. I’d put more emphasis on mobile &amp; cloud, but fun read! http://t.co/mVC28TVq30Great article on power of culture. With a clear mission, passionate people, &amp; freedom + trust, anything’s possible. https://t.co/RQkwQAve4wRT @GrandCentralPub: #HowGoogleWorks by @EricSchmidt is an @Amazon Gold Box Deal starting now and for the next few hours! http://t.co/LN4Cu…Big week for the @Olympics. Excited to see today's announcements and glad to have joined #agenda2020 talks. http://t.co/qCh8KoSUejHow to keep top talent? If you love them, let them go (elsewhere within the company). #HowGoogleWorks http://t.co/zDfUkEElzqNexus Player is incredibly easy to use, watch and stream most entertainment over the Internet, and very integrated http://t.co/ef2ydnToNv#NestProtect &amp; #NestThermostat. Know more, worry less, save energy. Subtle brilliance that just works. http://t.co/jI0DIow873 @nestChromecast. Just gets better. More apps, now $25. Big screens are everywhere - use them! I use this everywhere ! http://t.co/YVbJ8NnqG7The new Nexus 6. Comes with Android 5.0 Lollipop - and a turbocharger. 6 hours of battery life from a 15-min charge! http://t.co/MpTcigDjThAre you ready for #CyberMonday? Can’t blame you if you’re overwhelmed  - here are the gifts I am giving (and use) ! Here are some thoughts.The real authors of #HowGoogleWorks are all the great people who inspired us along the way. Thank you for all you do &amp; Happy Thanksgiving!RT @jjrosenberg: Nice piece in the @NewYorker. Flattered to have #HowGoogleWorks mentioned with Sloan&amp;Drucker! http://t.co/cfB2kesfgk http:…If you're choosing where to invest resources, feed the products that have earned support, not the ones that need it. http://t.co/92wAV7yoyOBest defense against business myopia? Diversity. Thrilled to donate all profits from #HowGoogleWorks to CS education for girls &amp; minorities.RT @jjrosenberg: Looking to stay on top of tech trends? What @kevaldesai and I are thinking about &amp; reading: https://t.co/jEsMj0NzftThere’s never been a better time to be a smart creative. So what are you waiting for? http://t.co/2VmwIy6ycA http://t.co/cEjv2eCOPgFind out how the Internet was invented and who changed the world forever!  These are the real heroes of our age.  http://t.co/IoYFDmwQ8ECrazy ideas inspire the best people. And with the best people on them, they aren’t so crazy anymore. #HowGoogleWorks http://t.co/SamkT2OoeWWrite the job description for your ideal job in 5 years. Ask what you’re missing to get there. Voila! A career plan. #HowGoogleWorks", 
    "@veronica": "@jlchianese haha yesToday, in Sign Reading Fails https://t.co/EfOE8YSCIb@Aractor we’re working on it!@DanStapleton hah, it was the opposite for me. takes all kinds.@thegynomite hey I know two of those fabulous ladies!!! cc: @Mickipedia@johnhannsmith I was wearing jeans.@Asetisis @Kiala I’m just getting in first before the fanboys@Kiala IT’S DOCTOR WHO NOT DRRT @BuzzFeed: When a little boy wrote to his dog in “doggie heaven” a mailman did something incredibly sweet http://t.co/pm8LhV0GK9 http://…@kirkhamilton THAT IS EXACTLY THE LINE@eddie haha good question.My favorite thing about Geralt is that he sighs about escort quests as much as I do. #TheWitcher@fxrseen that was awesome!!@Asetisis @vaginalfantasy aww we’ll miss you!@BadAstronomer @bonniegrrl I LOVE YOU BOTH@jonursenbach no, I was never a huge Mineral fan.\"Unsullied? More like unskillied.\" An Open Letter To The Unsullied http://t.co/DXhDQ3Ag4h (via @feliciaday) http://t.co/BsysslbP47@2Lange no, the side effects are horrific.@fahuhl the shoes are, thankfully, ok. i don’t know if they hold the same concern for me.@troldann because it's a play on Dear Abby.@alexvoica this one actually is ;) https://t.co/Q4PZ03YqDh@BushWilliams @engadget snark?? never.@ricardouribe @engadget next Wednesday!@Emrysina hahaha!! I do love that movie.@JustinRYoung HAHAHA@Grafarholt YES! Phew.@Emrysina I don’t know what that is! Is that the latest dance craze?@mikebarish what is it with gas stations?!Gonna pretend I hurt my hip in yoga and not when I fell out of my car at a gas station in my new shoes.@paulandstorm @PatrickRothfuss @scalzi what the fuck did I just wake up to. \n\nAnswer: Herpes jokes.@bonniegrrl she’s kind of amazing. I do love her.@mike_enos @scottjohnson @OvercastFM we don’t have a podcast feed set up yet, only avail on the website this week.@Rob_N_SoCal what links?@jonursenbach Petal-fucking-uma.@JoshConstine I saw them two years ago? I think? In Oakland. It was amazing.@ghostwritingcow @garbage I think I’m going to that too!I'm going to see Neutral Milk Hotel tonight and I bought tickets to see @thegetupkids this Fall! I'm probably going to cry a lot.@dgrec3 not at all, as I’m left-handed! Just wear it with the crown on the left bottom. http://t.co/mXifXPAecU@scottjohnson @Pick_David that’s the face I make when people are idiots.RT @scottjohnson: Did ya miss @Veronica's new show on Engadget? Worry not! It's still here! GO GO GO! http://t.co/kStIl1cjny http://t.co/hv…@Refinery29 stop trying to make fetch happen.@joshuatoulouse @Stepto I'm so sorry. Thinking of you and your family.@JeffGarlick @engadget not yet, we’re working on it!@Dream6601 @NightAttackShow Hahhaha oh noooooo!!! I’m sorry!!Goodnight Dune http://t.co/uALpbsllCH http://t.co/hiI8J6Dqxt@medic2442 @engadget we’re working on it!@dpencilpusher it was @SirronN! I did an interview with him about it: http://t.co/a0mjI4OWpU@eriksaulness @scottjohnson it should have been #DearDestroyerOfWorldsRT @icu: @Veronica new show is really great! It almost made me this happy http://t.co/nlipybRtTR #chatrealm@Kidder01 @engadget you’re bae! did I do that right?", 
    "@guykawasaki": "Bon appétit: 50 best restaurants in the world [video] http://t.co/8y9zB2rknH http://t.co/SCuSCe9FmpA compilation of “That’s what she said” jokes from The Office [video] http://t.co/NxtWqWjVF5 http://t.co/5XWXe45wGnOctopus scoots across ocean floor carrying coconut shelter [video] http://t.co/04t3wZE3IU http://t.co/tVhpfG1o1FHubby asks to be slapped awake for fifteen days [video] http://t.co/YJ9RLIsaOb http://t.co/Gnzv6PIPcnDog plays with a deer [video] http://t.co/HNTmrESPyz http://t.co/3vK8bG64mVBlowing raspberries in famous pieces of art [video] http://t.co/ue9dnxmsbf http://t.co/jHloVkVra350 all-star 404 pages from around the web http://t.co/T0hbT2ET8J http://t.co/IaLhN4BEIwGerman Shepherd tries to protect lobster [video] http://t.co/8J7qY5mk0O http://t.co/qUvjcmLj9L12 tricks to make the most of your hallway [infographic] http://t.co/R0iqI5jbgA http://t.co/SwMqBxkvexGerman words that express your exact feelings [video] http://t.co/OEilY4lA80 http://t.co/QP2qUdhRuhGoPro footage of a cricket player is pure madness [video] http://t.co/s43oIMVp1e http://t.co/ndyjUQRagcBaby goats just love their jammies [video] http://t.co/FNtGjJoae9 http://t.co/GvtL9FLVCHHow to make restaurant-quality Mongolian Beef at home (easily) [video] http://t.co/nXjq7GACHa http://t.co/U3o0hBKklzPregnancy prank epically backfires [video] http://t.co/8g8dUGDAEm http://t.co/6T8PmwuWJAUntouched century-old chalkboards provide window to the past http://t.co/NSaOwx9ZUE http://t.co/GvaDr9TImLMeet “The Son of the Angel of Death,” the man waging a propaganda war against IS… http://t.co/Kx5AQTx4rw http://t.co/EKYgSp32CHThe rules of cricket explained comprehensibly [video] http://t.co/2RcQ48Tnwf http://t.co/ogI2DsFZQrFemale rugby player doesn’t let broken nose slow her down [video] http://t.co/hmVUfctB9z http://t.co/TVN7qiuUyZDerek Jennings might be the best musician you’ve never heard of [video] http://t.co/fKfTprR9tu http://t.co/9gWIV3Drh8Data visualization of a man’s heartbeat while proposing to his girlfriend [video] http://t.co/Vbs3skB9rh http://t.co/arEzrf076dBuilding a woodworking automaton out of a 2×4 and 1 nail [video] http://t.co/FK4h4b8SXd http://t.co/YcSeqz7G4eAnother happy valet, @Audi_ondemand and @Audi http://t.co/8tpqOisMbuTrance music playing on classical guitar will blow your mind [video] http://t.co/c4QdAzsxj1 http://t.co/JAIIrE65M0A competition of robots falling down at a robotics contest [video] http://t.co/ojXI7Veyl9 http://t.co/Ludn8NqpuPThe essential resume checklist [infographic] http://t.co/VuMXtkzxGl http://t.co/mcIw3kgkiVWhy you shouldn’t try to outrun a grizzly bear [video] http://t.co/i1RYZWvlLJ http://t.co/IASi9VftCATwo guys shred on toy guitars in Wal-Mart [video] http://t.co/i3i6E5kLvq http://t.co/1oplZ3aoPOThe most amazing floor piano players in the world [video] http://t.co/eOBnRtUKhQ http://t.co/QNyFPVbq6ILinkedIn out loud sounds just as ridiculous as you’d expect [video] http://t.co/BItE1d05H2 http://t.co/Ms61AZ9zNyTrash can moves around to catch poorly-aimed trash [video] http://t.co/4kvEYH8Otf http://t.co/jkiKBM3hga“Old man” scares passersby by dancing like Michael Jackson [video] http://t.co/oZ4RV7ZanK http://t.co/tJQQoTDMeOChinese street sweet artist hand-blows candy [video] http://t.co/HtH2m6E8sH http://t.co/F0JZvs7nY7Fail: 10 travel-gear inventions that are pretty funny http://t.co/fvjoO8KIxy http://t.co/htSkbENjW8The Lion King and Aladdin casts have a sing off while on a layover [video] http://t.co/Hh7xy2WddS http://t.co/HwN3hXONLaFor-women-by-women underwear makes embarrassing leaks a think of the past [video] http://t.co/BftFgK0xZG http://t.co/rPo9xUOr8cAll hail the Mad Max-inspired flaming ukulele [video] http://t.co/14ERS4rrl9 http://t.co/N9ZfernK6NSunflower Farm Creamery’s running of the goats is the cutest thing ever [video] http://t.co/SUpccaPXrb http://t.co/KaPZCW83n8Michael Jackson impersonator gets pedestrians to sing with him, promptly runs away [video] http://t.co/k9KfpwX6fk http://t.co/MOpRLebOOG90-year-old lives the dream of busting down the garage door [video] http://t.co/vTydkgJulw http://t.co/cBBRPMZoWBGordon Ramsay teaches you to make the ultimate steak sando [video] http://t.co/dk77KbrJmP http://t.co/NbsHR44l8UBarbie finally gets flats [video] http://t.co/AIyyqtcOMJ http://t.co/oAhJ0wc1uXNew Yorkers give a mugger the NYC treatment [video] http://t.co/LkXNsCL5go http://t.co/Nk754R2ylfGlobetrotting surprise engagement will move you to tears [video] http://t.co/NGP5OSer3T http://t.co/CDaJSdzJnEMood lighting in motion: How to burn the candle at both ends [video] http://t.co/troj9edWcL http://t.co/PahNZqKSqnInsane weather event caused planes to spontaneously fly [video] http://t.co/ClfE7M8zoI http://t.co/kKrGvQVHa5Wind-testing an ultra wind-resistant umbrella [video] http://t.co/Ajyaw1el41 http://t.co/bRxHWYdf0SJet skiing + fishing + basketball = craziest sport ever [video] http://t.co/R7rVs0NsTq http://t.co/OkLtJKFd17“Holding out for a Hero” like Buster Keaton [video] http://t.co/PZev6GOXyD http://t.co/vZnIVGEsrAModern day John Henry samurai duels with robotic arm [video] http://t.co/hEDDdxeDc9 http://t.co/QVkwn5EJ7q13 most cursed cities in sports http://t.co/GVKSc5JN2C http://t.co/HjSAhHaKzM", 
    "@scottdanthony": "RT @HarvardBiz: Four recommendations for leaders facing disruption: http://t.co/nvB88arxYm http://t.co/GNFxqm4QwM.@AlexOsterwalder likewise sir!Great thoughts from @justinhendrix: Advice for the first time corporate innovator — Medium https://t.co/1bqdct66Fs.@Indiechamp @MediaREDEF @HarvardBiz thanks much — hope it helps!Succeeding with Digital Disruption — my thoughts @HarvardBiz https://t.co/aiTXeS6ZdJRT @cdixon: The Babe Ruth Effect in Venture Capital http://t.co/WWyc3gvysM.@bala_ksri glad to hear it! enjoy.Join my @InnosightTeam colleagues in a couple of hours to hear about disruption in financial services https://t.co/jvyZiHqhQSBefore you start a program, ask what problem innovation needs to solve. Our thoughts @HarvardBiz https://t.co/LruIk3aQbi@LarryCoppenrath nicely done!RT @LarryCoppenrath: Zombies are projects that,  fail to fulfill their promise and keep shuffling along. @ScottDAnthony provides insight ht…RT @InnosightTeam: \"Playing for the future.\" Cool @wsj piece on Africa's startup taxi scene featuring @InnosightTeam alum Peng Chen! http:/…Smart thoughts from Josh Suskewicz @InnosightTeam Tesla’s New Strategy Is Over 100 Years Old @HarvardBiz  https://t.co/btdRWQNJem@KavitaRodrigues thanks Kavita -- enjoy the rest of the conference!@innovationloft hope it proves useful!RT @DruckerInst: Good points from @ScottKirsner: \"What Big Companies Get Wrong About Innovation Metrics\" --&gt; http://t.co/zFI62VLCB6 @InnoLe….@BartDoorneweert absolutely — the innovator’s balance is being thorough with a bias to action. a very hard balance to strike!Very well put, as always. I’d add that what goes before the MVP matters too! https://t.co/ZkNwKbsClN https://t.co/iiN0lHbSu3Provocative thoughts from @RogerLMartin @HarvardBiz The First Question to Ask of Any Strategy - HBR https://t.co/7QeEfj7HZfRT @InnosightTeam: How much $ does you company need to invest in innovation? Rules of thumb from Innosight's Pontus Siren @InnoLead https:/…\"In a world of transient advantage standing still is the biggest risk.\" The one and only @rgmcgrath at @InnosightTeam HQThanks to all who brought the great energy to #BrandworksU -- be DEFT and have HOPE and first mile success awaits!@MarlaBoBarla nice shot!!Before the magic happens in Madison. Looking forward to #brandworksU today with @l_s_b http://t.co/AugUoULvrQSmart thoughts from Mark Johnson: What to Do When Your Future Strategy Clashes with Your Present - HBR https://t.co/PMe5AR0mRBRT @generalelectric: There's no such thing as a useless #innovation. http://t.co/7J2DzJXCS3A new addition to @InnosightTeam Web site — see the cool stuff some of our alums are doing http://t.co/nspj0k5UW4Just another day at @InnosightTeam headquarters. http://t.co/rPseDod7jeInteresting thoughts from Juan Pablo Vazquez Sampere on GE @HarvardBiz -- wrestling with resource allocation https://t.co/boppKmhc6KWhat did billion dollar startups look like at the Series A? http://t.co/ltYKm0ZnMXwise words from my @InnosightTeam colleague RT @piyushchaplot: Alert: Venture Capital Tsunami in South Asia\n\n https://t.co/sHqfPUWksO@rvobrien yikes! 34 in Singapore. Celsius of course :-)Exciting news from MediaCorp! https://t.co/HwtVAeBHBuRT @mr_steve_martin: Clayton Christensen #edisonawards http://t.co/ccO82YySS8RT @shomuac: @cherylyeoh with VCs \"Is SoutheastAsia capable of bringing the highest returns?\" #malaysiaboleh #aseanboleh #vcjp2015 http://t…@Kylie_Kwong thanks kylie — sorry i couldn’t stay longer but enjoyed my all too brief first trip to Perth!RT @InnosightTeam: Don't miss @ScottDAnthony keynote on transformation &amp; disruptive #innovation @Chartered_Accts http://t.co/mtQ4czlmaH htt…RT @gkofiannan: Lol RT @prepaid_africa: @gkofiannan *adds helpfully* http://t.co/69atu29FzwIs Apple Pay on a disruptive path? Juan Pablo Vazquez Sampere says no @HarvardBiz https://t.co/4650Glu3kX http://t.co/hxzXJzBQ5iInnosight's perspective on emerging disruptions in financial services.  https://t.co/u4jVeHVd7j.@thinkers50 greatly appreciate it!!RT @TheoryCrew: ABC Big Ideas shares @ScottDAnthony and Dr Peter Diamandis' talk on disruption and growth from @CInnovation #ciglobal http:…RT @cdixon: BlackRock’s Chief, Laurence Fink, Urges C.E.O.s to Stop Being So Nice to Investors http://t.co/p5niIaTdOD http://t.co/fUeSCGbBA4Building a mature venture ecosystem: Innosight Ventures' Pete Bonee http://t.co/eTBmFo44X7RT @InnosightTeam: @Chartered_Accts event series start next week! @ScottDAnthony kicks off with opening keynote in Perth. Register: http://…RT @Javier_Galue: El libro que toca leer estos días... por el momento muy recomendable...\n\n#libros @ScottDAnthony @HarvardBiz #books http:/…@CuddleTea Any time — good luck!RT @petersims: Our little, scrappy company The Silicon Guild is gaining momentum, and we're thrilled to announce that our newest... http://….@RozChowKoo @YODCHATRI and of course there always is the middle child route -- an entrepreneurial consulting company 😉@RozChowKoo @YODCHATRI let's do it again sometime!", 
    "@ekaterina": "@yesselylopez @AlxRodz OMG. You are killing me! :) haha@AlxRodz @yesselylopez Absolutely! :)There's no such thing as 'age appropriate' when it comes to play. At every age play isn't a luxury, it's a necessity http://t.co/hxLoi5HC8DJOB ALERT: Looking for a  community manager on my team. Interested? https://t.co/ifkEjzn1BT@memathews @MarjiJSherman @V4Violetta @jowyang @doctorow Thank you, Mike! :)@margabaselga Margarita, so lovely to meet you! Hope our paths will cross again soon. And yes, ice-cream FTW! :)The Social Media News Daily is out! http://t.co/wMdMaTluft Stories via @ericaswallowThis! One of the most creative and delicious foods of the Dominican Republic @conosmaniard #conosmaniaenriquillo http://t.co/zChmNy9MAOLoved meeting you, Carlos! The food is heavenly! Next time: tres leches. :) @conosmaniard #conosmaniaenriquillo https://t.co/tgOLMYgRzW@ToddQuest LOL :)The Social Media News Daily is out! http://t.co/94DCsEeEKF Stories via @AmazingiGrace @kaykas @WomenOfHistoryCollect moments, not things! http://t.co/KkUXXJHEwz@patyguzman19 So happy to hear that, Paty! :) TY for the kind words.@kacholopez The pleasure was all mine, I assure you. So great to hang out and talk marketing done right. Hope to see you soon :) #FOARD2015Amazing time at #FOARD2015 in DR! Great country, fantastic people! TY for such hospitality! @foadominicana http://t.co/M1l7gNpIaoYess Lopez and I are rocking the cover of Forbes. #PowerWomen   #FOARD2015 http://t.co/G1aXNcym44RT @PStaunstrup: 3 Mistakes That Undermine Using Social Media for Customer Service by @Ekaterina http://t.co/RWtycckwH4 via @Ekaterina &amp; @N…@solangeperezm @PacoConde @AlxRodz @gabycastellanos Gracias :)RT @IntoSM: A descansar luego de un día lleno de aprendizaje, gracias a los amigos de @foadominicana ¡Éxito total #FOARD2015 ! http://t.co/…Pinterest Ads Just Got A Whole Lot More Interesting: New Targeting Options, Animation, &amp; Buyable Pins by @Sprinklr http://t.co/RhcyyTUdbG@AnycelSocial Thank you! :)@ivanpiniellap Thanks. Glad you found it useful! :)@GiovannaJRo :)@willymenag So glad to hear that! :) TY!@eabreu20 @foadominicana TY! Appreciate it! :)Thank you, Erick! :) https://t.co/CowOkHEzSz@Jelidax Thank you so much! :)@danestevez :)RT @wholebraingroup: The True Cost of Not Meeting Your Customer Expectations [Infographic] http://t.co/jkPQXPaBb5 by @Ekaterina http://t.co…@felipevallejos @RevistaForbesRD So lovely to meet you, Felipe!RT @felipevallejos: Had the chance to interview @Ekaterina for @RevistaForbesRD. She told me innovation es critical for the future of Latin…@AnycelSocial Absolutely! :)@dariomartinezb @AlxRodz Gracias :) very kind of you to say. So glad you enjoyed it@Ignaura :)@malmonter So glad you liked it! :)@FourGroupRD Love this pic! :) TY@danestevez Haha. Love your sense of humor! :)@VeronicaGuzman0 @foadominicana lovely to meet you and thank you for the kind words :) xoxoApparently I am still trending in Dominican Republic after my #FOARD2015 talk. Glad the crowd enjoyed it! :) https://t.co/Ch4qBSCzub@Ignaura @PacoConde @AlxRodz Gracias :)@johannadm TY! So glad you enjoyed it :)One of the most passionate / engaged audiences I've ever presented to. Thank you for the hospitality #FOARD2015! xoxo http://t.co/f1fbp0JZAgThe Social Media News Daily is out! http://t.co/THiihKmvqEFull house at #FOARD2015 today. Amazing energy. http://t.co/LweQoeVcpuDon't fear change. Change fear. http://t.co/7dsovld1keCOOL JOB ALERT: Looking for  community manager on my team. Who wants to be the voice of @Sprinklr? https://t.co/ifkEjzn1BTHumbled and excited to address a thousand digital marketers tomorrow at @foadominicana #FOARD2015 http://t.co/3RHMO9y6y1@fabjewels :)Yes, this view from my hotel room isn't bad at all. #FirstTimeInSantoDomingo http://t.co/0eD7PedUOcIntense day #1 in Dominican Republic. 10 media interviews + this radio chat to finish the day. http://t.co/cUbfajCVlN", 
    "@jason": "Went for a quick walk... @uber back! http://t.co/EnTfPp6sJyHalf way http://t.co/EKVMGNjctFBridge, should I walk across it? http://t.co/K77ojgwgW0In the mist http://t.co/g3d8ImEc4X@ViltiesVance @NewScreenSavers how so?@jake_gold in fact most folks draw the parallel between Me and @pmarca -- stands up until you hit fund size, returns &amp; twitter ability.RT @sdkstl: editor's note telling writer how to streamline + rationale for making note public from @jason @launchticker http://t.co/hqInb1Y…@felixsalmon @sdkstl @launchticker @gabrielsnyder hilarious 😂😂😂alright... alright.... got hook up in 12th row for @warriors tomorrow! boom!!!! #DubNation #StrongerTogether https://t.co/KhHoCLgxAsWoke up to my daughter playing at my poker table... She didn't break the shuffle master http://t.co/gJW5idd2zDsix months ago: Firing @dickc would be a huge mistake \nhttp://t.co/eNsnFt3qku \ndiscuss...editor's note: this is a too long and wordy. In order, you could take out eight words and it will read faster  https://t.co/VzOXWyo00OAmazon opening PRIME to outside merchants; huge move, massively reprecussion for retail...  https://t.co/WpQWslLvZx http://t.co/3UHAEgsJAN@MarkNijhof @WellspringGP @AngelList never invest outside the USA... do bring startups here to HQ in my backyard! :-p@maxthyssen @AngelList there is a cost of about $8k per deal in legal.... which is not a lot.@Aboundlessworld @DavidSpinks what relationships?@DavidSpinks yeah, i'm going to go out on a limb and say work ethic matters :-)@WellspringGP u can, and we do, private @AngelList syndicates all the time.5/Syndicate is doubling every year w/deep-pocketed backers. Last year $200-400k deal size, now $250-1m deals. Next year $1.5m? $2m? $3m?4/I attribute large % of turn-around in VC attitude toward me to my @AngelList syndicate--I can fund a startup before VCs know it exists!@anegar70 yes! make an exceptional product that delights users and keep your burn low....3/Many VCs dismissed, dissed &amp; tried to derail me over the past 5 years. Today they're courting me because my angel deal flow is 2nd to none2/Still planning on raising another @LAUNCH Fund, but fact that I have 660 \"LPs\" in  syndicate and &lt; 20 in my Fund is inspiring &amp; perplexing1/Given size of my @angellist syndicate I don't need to raise my next fund--didn't expect that 1 year ago! https://t.co/QIUqoRCbM8@iamwonder so are me and @shervin!!!@nickbaily well, i was also too stupid to give up in the face of absurdly challenging odds....@Mazzeo @_JoshBryant @sacca Jesus.... we did cap this bet yeah?!?!How did I get here? I came in an hour before everyone &amp;stayed an hour later. Never left before my boss &amp;responded to his emails on weekends.1 year ago: The trench run syndicate [about 318 @AngelList backers/$1.1m, now 662/$2.8] https://t.co/txRLgUQGUG http://t.co/YEI8UqCOhr@KurtLeitinger @sacca I would do 20-50 deals across whatever amount you plan on investing. from 1 year ago https://t.co/txRLgUQGUG@1938loren technology is impacting every vertical, from health to education to transportation. homelessness is immune?@1938loren it's awesome religious organizations are working on issues. many times they are reducing suffering but not innovating. need both. Dave Grohl is already a legendary rocker.... now this!  https://t.co/mhN5wTaUpwTo be clear, I'm not above going to the @warriors game with a banker, director of PR or lawyer tomorrow. #DubNation Seriously, reach out!@_JoshBryant @sacca @Mazzeo ugh.Does someone with great seats to @warriors game want to bring a really hot date with them tomorrow? Apply by telling me row/section. 😂Chances of @HyperloopTech succeeding, like any startup, are low... but as Han said, \"never tell me the odds!\" #letsrollboys @shervinexcited to be #angel “@HyperloopTech: Epic day!  Building the hardware and tech to help make Hyperloop a reality. http://t.co/osHXqfF3Dt”@aracena my office is in the tenderloin.@THINK_Lyndon in 50% of the cases these folks are not able to make great decisions for themselves -- so there's that.@KevinKwanNY rollout would be critical.... it can't be \"get in the van!\" it has to be \"We have 50 homes and you can apply to get one!\"11/When the #sjw, trolls, politicians, special interests, trade orgs &amp; incubants are attacking you for building you're doing it right!@GadgetDon should have said \"just outside of cities\" -- lacked space on twitter. :-)@ffumarola \"right outside of cities\" would have been better for me to tweet (140 characters). Cheap land, but still access@Lons I believe \"is this a real problem?\" question is is a way for folks to scuttle progress 90% of the time.10/If you don't build product in this world you're doing it wrong. Builders  define the future... not complainers.9/Power is shifting to those who build. San Francisco has become the most important city in the world for 1 reason: PRODUCT (GREAT PRODUCT!)8/Suggest 5 ideas for \"solving homelessness\" &amp; you will be attacked by liberals, conservatives &amp; SJWs--AKA people who don't build shit.7/There are 100 amazing ideas to be tried to \"solve for homelessness\" -- but people are afraid to discuss them. LET ALONE TRY THEM!6/As \"richest\" society in the world, the fact that Americans can't creatively discuss solutions without attacking each other is real issue!", 
    "@kevinrose": "@mattdebord thanks for the great article, you nailed it :)Huge congrats to my good friend @dtrinh, def check out his new app, \"Free\", just launched! - http://t.co/Rih3itiCk4@hemeon can't wait for us to get jamming on the new ideas :)@ctrlaltcomplete not true, Tim spends a ton of time on the east coast!RT @businessinsider: One of the best watch websites just got turbocharged by Silicon Valley and Kevin Rose http://t.co/8qKHIO4Z9M http://t.…RT @benjaminclymer: I am proud to announce that Mr. @kevinrose and the whole @watchville gang will be joining us at @hodinkee, full time. h…@benguild no depth there tho, now we have close to 30M watch fans a year using our products :) you'll see, the master plan will unfold :)@benguild didn't sell it dude, merging to make something much bigger :)BIG NEWS: @northtechinc is merging w/ @HODINKEE and I'm moving to NYC!! http://t.co/hITNQx8gAk@cameronyeager yep, the plan is some place w/ cheap hotels and flights - making it easy for everyone@rickwebb Trinet is also pretty bad, interface is from the 90sthanks to the 691 backers for live diggnation, sadly the venue/hotels/flights make things impossible: https://t.co/p6axJKEsJv@jaredleto cool, email me up some dates, I'm bouncing between cities this month, would be fun to hang!this is the future of kitchens - really cool to see this go from idea to product, congrats @mvanhorn &amp; @june team! http://t.co/bsgM1vyvzv@soffes horriblewho's your favorite warrior? obviously curry, but I'm also a big Iguodala fan, and bogut is a beastVee for iPhone + iPad: An entirely new way to shoot, edit and share videos http://t.co/K9PQJJRHRkMorning!Mr toast https://t.co/wGORt17Rvz@jess welcome to @GoogleVentures! you're going to love the team, such great people!RT @jess: I’m excited to be joining @GoogleVentures as a Partner on the investment team: https://t.co/KVl6BcoZ8Y@dburka @hemeon hahahaAlso, of course the show will be free to all when we put it online a couple weeks after :) excited!@rgiammaria free after the eventCost 4 show is $25 a ticket. re: 75k total raise, it goes to best venue/experience possible - we hired a legit team to run the show@ingmire ha', crap, alex removed those. we're working on it@easedrop dude, the sponsors are buying the spots on kickstarter, that's how we get to 75k@ingmire dude, the sponsors are buying the spots on kickstarter, that's how we get to 75kDiggnation LIVE is coming back, one night only! http://t.co/pAuWHZKTGGRT @ariannahuff: There are more than 10,000 edible plant species in the ocean http://t.co/cgq7eWPheX@kickstarter possible to get our project approved, we're excited to tweet it!RT @grahamhancock: Massive Comcast DNS outage right now. Glad I’m using Google’s DNS! (8.8.8.8) http://t.co/MYNwYNC5wC@cdixon faster than raw Safari? cc: @calebdMy @Uber city is San Francisco. I've taken 2089 rides in 15 cities over 57 months. http://t.co/Zq0NB3Rag0@dflieb wow…. AWESOME.@dflieb …because the locally stored photos from apple are lower rez. Meaning G isn't pulling originals directly from cloud but locally, yea?@therock where do you get this energy from?@dflieb hmm, so if my iPhone \"photos\" are set to \"optimize iPhone storage\" that means G photos app will be uploading lower rez, yea?@soffes loving it!!? looks awesome@elatable bravo sir on Google Photos, great product and LOVE that it's stand alone.using @medium more lately - it's really turned into a great product. nice job @ev and team.@ryancarson holy shit brother, i'm on deck for some new work as well, from @NickChaboya :)I use @shyp almost every week, so easy to return items purchased online (or ship anything). Excited for them to expand everywhere.@chrismessina @arrington @mathewi that said, certainly when you raise venture you're aiming for the stars@chrismessina @arrington @mathewi agreed you can measure success quite a few ways. arguably many more important than a huge financial outcomSome additional thoughts on my @path / @digg post last night: https://t.co/A9lfp2YlpOSilicon Valley dances around failure. It's how we learn/improve.  Digg was a failure, Path was a failure. Embrace it and try again, ya know?@chantalireland I do agree w/ that pointRT @stevendavis: @kevinrose Hey Kev… have you met the internet?Instagram ad comments kill me. People threatening to quit the service... They expect the service to magically exist for free...", 
    "@anildash": "@ginatrapani Orange is the new babysitter.The UI on Samsung \"smart\" TVs is so farcically bad it seems like a plot by someone trying to actively undermine the product's existence.@shervin I think we were app # 2? http://t.co/skhNnC3eEZ@Brironic lol@tmslft it's actually pretty doable, I think.@doughamlin @harrisj and they move from being immutable passwords to disposable identifiers.Soon the majority of people's social security numbers will have been leaked. This will hurt the vulnerable most: vets, those on assistance.Ok, *now* can we acknowledge SSNs are obsolete? Which candidates are proposing ending SSNs? https://t.co/W3NA4bEOLm https://t.co/GaNiGGnY2fRT @MotherJones: The nation's most conservative court just shut down two-thirds of Texas abortion clinics http://t.co/An0I4rC806 http://t.c…@kathrynyu I use both.@remiadetiba (pssst.... *two* decades!)@woodlandalyssa but has an injustice been fought here? Or just documented?@marksluckie WE HAVE THE TECHNOLOGY@marksluckie yes I have, though I am willing to acknowledge that it's technologically a bit challenging to customize parts of glyphs.(I would use an appropriate emoji here, but we don't have mixed couple emoji yet.)Day late, but: Happy Loving Day to all the mixy couples! Thank you to the activists who fought for our relationships 48 years ago.@libbybrittain do you follow @ThinkAgain_DOS ?@finn @ftrain well that's just your opinion, man@mrgan @danielpunkass He Lurks Among Us@danielpunkass @garrettmurray WE ALL LIVE IN A PURPLE SUBMARINE@danielpunkass same. I was inspired to actually blog about technology, that thing I used to do.@Venetiabella sure.@danielpunkass thank you, sir. The admiration is very mutual. Blogging is so great for letting us meet an old friend for the first time.@AlJavieera haaaaaa@StevenKLira1 fine by me!@alpesh_shah thanks, will fix!@_ @ev shout out to @t!@fmanjoo I pity them.@tcarmody it's hard to parent in public, especially when we love them so much that the whole world should see it.@missrogue thanks so much :)@stttories part of what draws people to gated communities is usually enforcement of homogeneity. It's a signifier.@stttories it's never just about safety.@brooke we could bring #brands to Syria.@defunkt yep, when I first read @ftrain's draft, I realized mentions of GitHub, Stack Overflow, Slack, etc. would cement them as standards.@fromedome @pkafka yeah, Peter's list is great!@jilliancyork @mathewi perhaps the best succinct summary: blocklists have a set of problems I prefer; free speech infringement isn't one.@jilliancyork @mathewi yeah, I stepped away from that conversation because my position is nuanced &amp; tends to get misrepresented.RT @dailydot: The trollish Tumblr roots of the term 'transracial': http://t.co/1YntkFio95 http://t.co/grMVtJ6dpl@jennschiffer \"a glass of glue\"@jilliancyork I don't think I've ever said they're without problems. Have I?@headsparks yep, and I'm glad you've gotten some starting points.@headsparks I faved a tweet that was someone making sure to take care of herself.@headsparks I'd be mindful that women are constantly being asked to do this kind of emotional labor for free.@songadaymann @notdetails I'm sorry. I know how this stuff hurts.@finn @ftrain @mahon_e I knew we were gonna go there.@khoi well, I'm distinguishing between being first/early and being influential.@ftrain @mahon_e pictured here, @finn helping mom learn to code http://t.co/5rbvSoNPaE@danielseaman definitely.@jcenters @viticci @khoi @zcichy if so, should be balanced out by the fact that everything we use looks like a descendant of the Zune UI.@juliaferraioli few recognize it's advice from a different era and inapplicable in the current culture.", 
    "@timoreilly": "RT @cloudera: Don't forget CFP for #StrataHadoop Singapore ends soon! Submit your proposal now: http://t.co/024LFmTwKh http://t.co/Lr4zstNL…@BarackObama If that is true, why so much secrecy in negotiations, so many excluded till too late to change? I’m with you on much, not this!Funny and wise commencement speech by Lou Holtz. http://t.co/DIFX1ZdUga Look through the specific religious msg to see timeless advice@jgrahamc This is in general a problem in tech today: product designers thinking they know better than their users.RT @jgrahamc: The iPhoto to Photos transition is a clusterfuck. Apple: \"Oh, you were using Events and had invested time in organizing stuff…RT @jgrahamc: Events -&gt; Moments transition is incredibly disrespectful. I organize my photos and then Photos says \"I know better\" and throw…RT @mheadd: RecordTrac project from @codeforamerica gets reused in Raleigh at #CityCampNC. Awesome!  https://t.co/wRuFYh34pvRT @chr1sa: Solo kiosks arriving at 1,500 @BestBuy stores, for launch next week. Includes amazing drone simulator: fly in-store! http://t.c…@RugerM3 @hunterwalk @theworkerslab @FundGoodJobs Where did you get that stat? I see http://t.co/UnVipG9ohY@callmeed What Leah Busque said to me: “We build tools to improve the income of our workers.” We need to encourage that kind of goal.@callmeed We all are. But getting to the better future means working at it. I love what Leah Busque said to me...@GuiAmbros Right, but that just highlights that health care needs to be decoupled from W2 employment.@callmeed I don’t think on demand drivers would be available as broadly under a W2 regime.@callmeed I agree. But I don’t like seeing internet haters damning on demand trend as bad, when there are so many worse off.RT @bigdata: Another @amplab spinoff you need to pay attention to https://t.co/sFajbhUDPW@pobrecitoshame Read comments on http://t.co/gedoMnEaqh@mjdalby @HillaryClinton I understand that sentiment. But at least let’s aspire to a more fair society!RT @albertwenger: Recent breaches should be reminder: protecting data is ultimately impossible, we need to protect people instead http://t.…@camerontw Number of guaranteed weekly hours in many low-wage jobs? Read Nickel &amp; Dimed in America.@mamund @theworkerslab @FundGoodJobs I agree.@callmeed with acknowledging the opportunity they do provide, not making false comparisons to some other non-existent opportunity.@callmeed is leading the witness. These are bad jobs compared to what? I totally agree we need to make them better, but that starts...@callmeed Saying \"The average pay is a relatively low $18 per hour”  when 3.6 million Americans live at or below minimum wage of $7.25/hr...@mjdalby @HillaryClinton Not vapid. Large segments of our country no longer seem to share Roosevelt’s aspirations.RT @HillaryClinton: President Roosevelt said \"there's no mystery about what it takes to build a strong and prosperous America\": http://t.co…Context please: Average wage at Walmart is $8.18, so $18 not so bad. Trashing on-demand services is a cop-out. https://t.co/FAmYvncnf4@fowlerradio @instapundit That’s exactly right. It’s a rigged system.RT @sannmer: MT @whitehouseostp: Calling our #NationofMakers - @POTUS declares #WeekofMaking http://t.co/vhufH52lqc@ev Hilarious!@lippytak @TaskRabbit Sad that LA County doesn’t do that themselves.RT @mims: New kind of AI solves word problems from IQ tests better than the average college graduate http://t.co/ad7KyGyIhT@PhilKopp1 There were several easy solutions suggested in the article.Another article on the same theme, this time how inability to pay court fees leads to driver’s license suspension http://t.co/Xoh7SRp28qThis @nytimes article about problems with the bail system remind us how the US criminalizes poverty http://t.co/ecnbsUVyOM@Chaos2Night @Grady_Booch A lost opportunity for them :-)This is one kind of govt waste we should be cleaning up! http://t.co/cIabo9WZHw Carly Fiorina’s tax returns show how wierd US tax system isHighlights how TPP moves the world further away from being ruled by governments to being ruled by corporations https://t.co/dwknsvg4krRT @Grady_Booch: “There’s no magic, no matter how much it looks like there is. There’s just work to make things look like magic.” http://t.…RT @Grady_Booch: Alas, most of the world does not grok this: “The Web is a one small part of the larger world of software development” http…I'm liking “Old Work New Work” by @EskoKilpi https://t.co/D1B1vOmaok Uncertainty and improvisation vs attempts at certainty via planningTom Kalil @whitehouseostp says “Dale Dougherty is the heart and soul of the maker movement.” Great to see @dalepd getting this recognitionOpening @whitehouse event for National Week of Making is livestreaming now http://t.co/ZJbITD7EQNRT @bryce: looks like Along the Way app uses @foursquare’s API for road trip planning. pretty slick!\nhttp://t.co/uZ2NPOLozcRT @washingtonpost: \"My school district fired me after I gave a free meal to a student who couldn’t pay\" http://t.co/bhH2voTXsI via @WaPoTh…RT @danxoneil: \"For years, location has been neglected within Twitter\" (http://t.co/1s8Bh0oMdn). Yep: http://t.co/slJKStcSO0 cc/ @corynissenOlder but interesting: Quantifying the Gender Gap in Tech http://t.co/c7olthj2qFRT @washingtonpost: Scientists have discovered why the return-trip always feels shorter than the trip there http://t.co/A9vOfOyoqoRT @oscon: Today's the day! Early Bird reg for #OSCON ends at midnight PT. Join and learn abt design, build, deployment, &amp; more: http://t.c…Study finds that people living in the midst of disruptive technological change may be happier and more optimistic http://t.co/fHwh6pBxJpHow did I miss this? http://t.co/ZgxP01vqeH Super interesting initiative from @zephoria’s Data and Society initiative", 
    "@pogue": "Set the TiVo! Tomorrow, “CBS Sunday Morning” will air my story on AI—and whether we should be worried, as Gates, Elon Musk, and others say.@isonno Ah, good point! I'll fix.., Thanks!25 robots, walking semi-autonomously through a course: driving, taking stairs, crossing rubble. Here’s my report. https://t.co/w7UDeblwz1This week’s Yahoo Tech discount deals: Tablet accessories. Waterproof speakers, tablet stylus, stands, more. https://t.co/gGi9O19ephToday’s 30-second \"Pogue's Basics\" video: The hidden pop-up menu of Web/email suffixes on the iPhone/iPad keyboard. https://t.co/675xiDrDQiGot to see \"Jurassic World\" in IMAX 3D. Quite a ride! FX were amazing--script *mostly* great.@Geno_TV_Yaz OMG, Eugene—I love those photos of people reading \"Pogue's Basics”!! You made my day!@legacyb4 No—what I don’t get is what’s “revolutionary” about Apple’s new service. It’s the same thing as Spotify, Rdio, and many others(Yes, the band playing at the Apple thing is called The Weeknd. The additional “e” in my tweet was brought to you by autocorrect!)Apple keynote wraps up with a performance by Weekend. Visit http://t.co/PvpiCVT9fX for full summaries of today’s news—and now, goodnight!(At #WWDC, Apple is now showing its THIRD video ad for Apple Music…)RT @sheldonc: @pogue Seems like everything is $9.95 a month. I'm being $9.95-ed to deathOK, confirmed: Apple Music is free for 3 months, then $10/month ($15 family plan). And available on Android this fall! #WWDCApple Music service, says @jayanthkumarak: $10 per month, $15 family plan. #WWDCApple Music seems to be sort of Spotify+iTunes+Ping, all mashed together in a fairly confusing mobile app…still waiting for the price. #WWDC(Everyone’s asking why I’m using the term “catch-up” a lot—it’s to stifle the 500 tweets that would say “Android’s already had that!”) #WWDCI’m really not quite getting the “revolutionary” aspect of Apple Music. Seems to be 3 Internet radio stations, plus a comments board? #WWDC@JFC1138 To stifle the 500 tweets from people saying \"android already has that!\" :)Ok, Apple is announcing its new, Spotify-style music service...Apple Music (shocker) #wwdc@RupinderSayal But that mutes your WHOLE computer, including music or whatever.New Apple Watch OS permits standalone apps without an iPhone counterpart. Plus many enhancements, like photo watchfaces. #wwdcJoin our liveblog for the rest of the Apple news! https://t.co/SJyim5aZ9wSorry, not winding down yet. Tim Cook saying 100 billion apps downloaded from App Store, $30 billion paid to developers. #WWDC.Winding down Apple’s keynote. Swift (dev. toolkit) will be open source. Better CarPlay and HomeKit and ResearchKit. #WWDCiOS9: 1 hour longer battery life on iPhone. And if necessary, a low-power battery-saver mode for 3 MORE hours (more catch-up!). #WWDCMore Apple catch-up: The iPad will have split-screen multitasking—either 50/50 or a second app in a side panel. #WWDCIn iOS 9, iPad’s word-suggestion bar gains buttons for cut, copy, paste, format. Also, 2 fingers on the keyboard acts as a trackpad. #WWDCWhoa. iOS News app will give you 30 free NY Times stories a day, free. 17 Condé Nast magazines. Little local pubs can play, too. #WWDCThe iOS 9 News app looks sharp. Has animations, in-line videos—and it tailors its story suggestions according to your reading habits. #WWDCApple’s showing a new iOS 9 app called News—seems to be Apple’s take on Flipboard. You pick the sites whose stories you want to get. #WWDCYay that Apple added transit info to Maps (for 10 US cities). Now, maybe fix its DATABASE so it doesn’t give terrible directions!? #WWDCMore iOS 9 news: Notes app gains formatting, checklists, links, photos, &amp; sketches with your finger. Also, Maps gets public-transit options.Apple Pay gets an expansion. More banks, more stores, more countries. Also loyalty and store cards. Also knows what store you’re in. #WWDCApple is now touting how (unlike Google) Apple doesn’t harvest your data, share it, or sell it. #WWDC http://t.co/lDqGynpwmQSiri in iOS 9 is way smarter about context. Say “Show me my photos from last June’s trip to Vegas”—and it does… #WWDCiOS 9 will anticipate. Plays audio book when you get in car; adds email invites to calendar; tries to ID unknown incoming calls. #WWDCNow they’re unveiling iOS 9. Siri will be 40% faster, knows when you’re in your car, understands more complex commands. #WWDCThere’ll be a public beta of OS X El Capitan in July; finished version free to all in the fall. #WWDC@maggiezhangx @Forbes I can’t respond to you privately unless you’re following me. :)New OS X also has a split-screen mode, like Windows 8 (full-screen mode, 2 apps). #WWDCKey feature of new OS X version: When some browser tab is playing music and you can’t find it, there’s a Mute All button. #WWDCThis fall’s version of OS X will be called El Capitan.We’re live-blogging Apple’s announcements this morning, going on right now here: https://t.co/SJyim5aZ9wJoin me and my @YahooTech team in 10 minutes…for our live coverage of Apple’s announcements today! https://t.co/SJyim5aZ9wThe most brilliant &amp; funny safety video ever. Delta recruited YouTube celebs for cameos. Can you recognize ‘em all? https://t.co/nAISyWFNq5@drothert12 That's so fantastic to hear!! So glad the book hit the spot!This is a really remarkable post about one man’s time on a commercial whaling ship. The writing is incredible. /http://t.co/jakbtxHxeiMy new \"Pogue's Basics\" 30-second video: You can delete all your accumulated iPhone alarms with one Siri command! http://t.co/EH9s5KDb9H@jnack @anuragyagnik Right. You won't notice the compression. You WILL notice the shrinkage of big photos!My new column: Google Photos takes on Flickr for FREE, unlimited, auto-backup of your photos from all your gadgets. http://t.co/PVcExmDt1V", 
    "@billgates": "I’m happy to see so many smart people working on this. An energy breakthrough could have a huge impact on the planet: http://t.co/THMYRIwDEJCan a \"cash on delivery\" approach to aid help improve results? @TheEconomist explores: http://t.co/hrxSefelzz http://t.co/AzQAP1U7C1It seems backward but immunizing mosquitos could be key to protecting ourselves: http://t.co/BvVih5ILOc http://t.co/63uSVE1VkAMobile banking is a critical tool in the fight against poverty and Africa is leading the way: http://t.co/EuUkWA7Tm1 http://t.co/Ho6U1KTiFJRT @BigHistoryPro: We're giving away $5,000 and a job to make videos for Big History Project. Enter the contest: http://t.co/xmVeDl9G1Q htt…Passing knowledge btwn generations makes us unique. What do you think it means to be human? http://t.co/Ib96Np0KE3\nhttps://t.co/GTd2nvhnijAnother reason to focus on college completion: low-income students fall behind wealthy ones http://t.co/uqWnZFzreQ http://t.co/1szqe5rMtTFree SAT test prep from @khanacademy is another way the Internet is making education more equitable: http://t.co/mxDw4p2S8h via @WIREDThe G7 has been talking about how to prevent the next epidemic. Great to see Ron Klain pushing for bold steps: http://t.co/1xlMu598QsMapping work to fight cholera could help prepare us for the next epidemic: http://t.co/XSbOGJiv8j http://t.co/tazhuAtqvJHard to imagine a person better suited than @Chancellor_CCC to help college students succeed: http://t.co/O4CKaQMiPC\nhttps://t.co/gJM3izctMIWhat many people may not realize–America is facing a shortage of college graduates: http://t.co/G05iDPQT7Q http://t.co/oYej3iFAxjHere’s why we’re doubling our commitment to make sure kids in the developing world have enough to eat: http://t.co/3hCqBlm4anLidia Sanchez was the first in her family to go to college. Here’s her inspiring story: http://t.co/06nTzyqSEQ\nhttps://t.co/eOSJ3QIKCEI spoke with @Chancellor_CCC about how we can fill a job gap of 11 million. Her strategy: http://t.co/TIvjAfPlvZ\nhttps://t.co/aM36NvJwq9Although I dropped out and got lucky, getting a degree is a much surer path to success: http://t.co/0jYXSX8oYJ http://t.co/WuzurW9oo4There are 216 million fewer hungry people than in 1990, but progress is uneven: http://t.co/67s52V0xNo http://t.co/4qjr5anuUqWhy didn’t the so-called population bomb ever go off? @NYTimes explains: http://t.co/pJyxOH7NCq http://t.co/lREYRiX1jcI’ve made a couple of predictions that came true. But nothing like Moore’s Law: http://t.co/wcotHu5y13 http://t.co/AgihR5RcPPAnother strong @charlesjkenny piece: Making fragile gains on the world’s deadliest diseases: http://t.co/FvNpYivFnn http://t.co/9urpxrNI8eIn the next 20 years, hundreds of millions of people will be lifted out of extreme poverty: http://t.co/xwMNCdaSOu http://t.co/y64PQ9n7w1Great to see there’s global agreement: Crucial to learn lessons from Ebola &amp; get prepared for the next epidemic. http://t.co/uOWvEorxyq.@MelindaGates on why user-centered design is essential for improving people’s lives: http://t.co/sPesH8FOjQ via @VoxRT @gatesfoundation: I’ve reflected a lot on my first year as CEO at the foundation. Sharing my thoughts on @Medium: https://t.co/hKcbHLC4L…You will rip through this memoir in 3 hours, tops. But you’ll wish it went on longer, because it’s funny as hell: http://t.co/KqFIecREIrHere are 7 books I read recently I thought you might enjoy: http://t.co/h9GXqHc3NN http://t.co/hWwqCwzqUBI got a kick out of Randall Munroe’s brilliant, offbeat science lessons: http://t.co/AFKGl6qAob http://t.co/lAYjskAXXHRT @WarrenBuffett: Better than raising the minimum wage, let's help Americans with an expansion of the Earned Income Tax Credit: http://t.c…Should we eat meat? This book I recently read offers great food for thought: \nhttp://t.co/zYu8DSaKgj http://t.co/JCvwfpJifmIn science, we’re all kids. That’s why I got so much out of this @RichardDawkins book: http://t.co/atzF4uItdV http://t.co/RmVWdQ6NAcEven an incompetent crew couldn’t ruin this #RedNoseDay PSA @MelindGates and I shot: http://t.co/Du1r48BqGz http://t.co/BFhS5bZXfy#RedNoseDay is a great (and entertaining) way to give back and help the world’s poor: http://t.co/yFYIpWaa70 http://t.co/wBsLBmGG4nTweet a selfie with your red nose using #RedNose25 &amp; @GatesFoundation will give $25 to fight poverty. http://t.co/iu0Ks0TCNuThis book does a good job explaining why children who don't get vaccinated can even affect those who do: http://t.co/j24qhfkEjsI picked this book up after seeing it on a @WSJ list of good books for investors: http://t.co/r6TyFu0ATN http://t.co/iEcurxCipiEvery summer I try to do a little extra reading. Here are a few books you might enjoy: http://t.co/Y5L3NTFZUI\nhttps://t.co/NoFuz8C3jeFascinating. The measles vaccine may protect against \"immune system amnesia\": http://t.co/ajbL6nHmiq http://t.co/aJI9aa3reqOne of my favorite #TEDtalks this year: @pcronald makes a strong case for engineering food: http://t.co/kM3Cg9rbD1 http://t.co/XiVIl5iC7E.@pcronald’s research could help millions of farmers grow crops in flood-prone regions: http://t.co/MZEim8xuqf http://t.co/vUnqClUB8eScientists think nature may be responsible for the first GMO at least 8,000 years ago: http://t.co/IGBNWMusHu http://t.co/6cXtK3ocxeWarren is a fantastic mentor and friend. Here are a few of my favorite photos of us: http://t.co/jxVvH8rJAD #TBT http://t.co/FXEkvLHeH1RT @JimKim_WBG: .@Twitter wasn't around when I was a teen, and a lot has changed—including my hair. First WBG President to tweet! http://t.…Even some of the worst-off countries can make great progress in saving kids' lives. Here's how http://t.co/qPTrh0HzeI http://t.co/TdOErJ6gwpAt this year's shareholder meeting, @WarrenBuffett told me about his rules for smart investing: http://t.co/8NZrT8LK8uHere’s how we celebrated 50 yrs of @WarrenBuffett’s leadership of Berkshire Hathaway: http://t.co/luuChiWy6T http://t.co/DTsEfMRsCIHere’s why we are working hard to stop malaria: http://t.co/H4jVqLGWxY http://t.co/1dR5ZBjl2bBecause of this vaccine, another disease has been eradicated from the Americas: http://t.co/F9ARSoq5uK http://t.co/pQle9lNkHdThe Ebola epidemic will have terrible ripple effects long after the last case—unless we act: http://t.co/Pnjn45ihc6 http://t.co/k0GSTsZpdRTurns out “Moneyball” isn’t just good for sports. In Rwanda, it’s helping to save lives: http://t.co/T4GRn55uek http://t.co/r14Kk8T7ZgA great argument for why the world’s poorest countries need way more energy: http://t.co/KFNHbRO9WM  via @NYTimes http://t.co/EEACt6cD51", 
    "@chrisbrogan": "RT @SpartanRace: #SpartanOnNBC continues in Breckenridge! http://t.co/H2LR2dKDZz  #ROADTOTAHOE http://t.co/njWyJiKF94@jaesunum - that's pretty smart thinking. :)You missed @MackCollier 's awesome post? What the heck? - http://t.co/xiDpbcd9fa@CatherineNetWeb - just loved.@jaesunum :)))))@CatherineNetWeb I wrote about you briefly in my newsletter for tomorrow. :)@chrisjkeaton - you're a good egg. Just wanted you to know I know that.@PranaPT - I embody it. :)@MSchechter - I'm fresh out of wands. :)@Zonozi - bingo. :)@reinventinero - why thanks. :)@bonafidejoe - exactly so.Most of the advice people ask me for, they don't want.@CatherineNetWeb - I laughed right out loud at that. Thank you! :)@2eatwellRD - well that's techy! :)@WriteOnTrack_L I love @cumberlandfarms .i think they don't know what to make of me.RT @Safetyboot: Whackpack Furniture. Handmade by us. Handcrafted by you! by Benny Magennis — Kickstarter\n\nThank you @chrisbrogan  https://t…@positiveparties so glad you were part of it today!RT @WhackpackFurn: @chrisbrogan #borderbizcamp #velvetrope #buyfrompeoplewelike #kickstarter http://t.co/M54VTFbxTG@Safetyboot pshaw. You're kind.@altabyte thank you! Glad you were there.@BarrettABrooks afraid not. I sent @WellnessBucket instead. :)RT @problogger: See what @ChrisBrogan said about me, I said on @brianclark &amp; Brian said about Chris http://t.co/b8kwqWEB2o #INBOUND #Mutual…@ShobhaPonnappa so very happy to hear it!@bhaesa can't confirm or deny.@wickedjava super! Sorry it took me hours to see this.@_sugarsparkles glad you enjoy it. :)@Steven_Stokes use it to serve. Find ways to help.Had a GREAT interview with @bretthenley . Really smart guy!Happy birthday to @brianlittleton , who I respect, admire, and appreciate when we see each other. Know him!Happy birthday to my inspiring friend, @benjaminstrong . Worth knowing for many reasons. A king amongst men.Do you think taking a selfie in my car of a state trooper in his car is advisable? Asking for a friend named Chris.VERY special thanks to @brandonuttley for fixing this for me. http://t.co/fsgU1WoPLm@jnswanson - thank you, sir. :)What does it take to be a hero? Listen to @BrandonTWebb and you'll know - http://t.co/3VzE2Z8YI2Puhhhh-pettts - http://t.co/LZeb3ZCD2F@MichaelSchein1 - I'm a Public Enemy guy. @MrChuckD is my hero. No disrespect to Wutang.@sullivantire Glenda in the call center rocks! Remind me to tell you a story!RT @BradLawless: .@ChrisBrogan Talks Podcasting, Velocity-Driven Marketing &amp; Fruit-Infused Water &gt; @Stitcher @collectivebias http://t.co/2D…@DeepSpin - really? What's a tip I should share with my son?@soloportfolio - perfect!@nessclick - huzzah!@DeanLand - well played!@logannickleson - thanks and thanks. :)If I just said \"puppets,\" would you click? - http://t.co/LZeb3ZCD2FJoin me 6/16-17 at #DSD15 in Denver! 2 days of digital marketing + a keynote by me. :) http://t.co/Cz1JBS26CJ@Jake_T4 whoa!@HandfaceVideo it does build on itself a bit. :)@maja_gray sounds like it's @ClaudiaYoga 'a fault. ;)Listen to US Navy SEAL sniper Brandon Webb on what it takes to be a hero -  http://t.co/3VzE2Z8YI2", 
    "@tonyschwartz": "Read my latest @DealBook post: Excessive Demands at Work Create a Humanitarian Crisis - http://t.co/667getfIDdMy latest is out on @DealBook: Taking Responsibility for Our Reactions http://t.co/FLZCMOq1JkMy latest @DealBook is live: The Enduring Hunt for Personal Value - http://t.co/2TUpvURllEMy latest @DealBook post is live - The Power of Starting With ‘Yes’: http://t.co/aKDWWCFKINHaving a great time at #CC2015 and loving this illustration care of @NathanLueth @RTCompanies http://t.co/fjHI9pxbqFRead my latest on @DealBook: \"The Importance of Naming Your Emotions\" and ask yourself \"How are you feeling?\" http://t.co/Wmxxu8Doh8@HRCurator wasn't in Harvard Biz sir, but rather in NY Times. cheers!@RainbowOfRehab much appreciated!@3BellCurves i don't think so. i think it's because they work too long without renewalRead my latest on @DealBook - When Employee Engagement Turns Into Employee Burnout http://t.co/b6BsDMudKq@JongWhanChoi  right you are. thanks. will change, tonyMy latest blog is live: Care Is the X Factor at Work http://t.co/BazVF4DZ9S@Latinatude Yea I'm hearing the shirt was a little bright!@jpcauthor pretty tough! are you the arbiter of sartorial elegance?@BoulderHazard up and working http://t.co/fl2ixE2ds6 !!@JonJosephA AmenMy latest @DealBook is live:  Privilege Is a Privilege, and a Responsibility http://t.co/Gi3I43w8tb@PassionCultures thanks much!@GifCLeaders thanks much!@DrewBMcIntyre thanks much@anikamarketer so what did you think?@tgdj731 I've seen lots of upset when people learn what others are earningFollowing up on my last post, my latest blog, What a Great Place to Work Ought to Look Like - http://t.co/JOqjY8UfiQ@jaketital  @freemindpitstop. thanks for the callout. the way we're working isn't working is be my suggestion. (the new title for B.E.A.E)My latest blog is live on @DealBook - Why the ‘Best Places to Work’ Often Aren’t - http://t.co/nCWXgSVU27At #DBconf with @mtbarra photo care of @mikecohenphoto http://t.co/JxNYWFlhu9My latest @DealBook is live - Reduce Fear to Create a Calmer, Productive Workplace http://t.co/E3x0Ni8U9xRT @CBSThisMorning: Questions on how to relax this holiday season? Ask @TonySchwartz by replying to this tweet &amp; tagging #newsisback http:/…I'll be on @CBSThisMorning tomorrow to discuss renewing your energy over the holidays. Be a part of the segment! http://t.co/KiDtAzArmJMy latest @DealBook - What Makes Employee Resilience Possible - http://t.co/RAP277J1QXIn London working w/ senior leaders at Unilever. Amazing folks redefining a  truly purpose-driven company. inspiring! http://t.co/YswWLL0UAwThe amazing Ham Yard hotel in London -- Kit Kemp, co-owner/designer. Impeccable taste. Makes travel a true pleasure. https://t.co/YTPOkQLSiV@WomanCareGlobal Hey there folks, Tony (me) is a man!@LynzeBallay Thanks much! I don't speak publicly much. Do it for organizations mostly. Send me your email and I'll let you know next time!RT @vj44: Right on the 💰→ \"Take better care of employees, so they can take better care of business\": http://t.co/IosRptmaP8 #WomenSucceedInspired by incredible, mostly female, senior team @energy_project: What Women Need at Work to Give Their All http://t.co/uMkWbBDXnq@AaronNagler put that one together myself? meaning? cheers.@josdeblok yes heard that, great to hear. I have a daughter living in Amsterdam! Great work you are doing.I’ve found a new balance after my vacation. Read about it on my latest @DealBook blog - What I Learned on My Vacation http://t.co/mpyGDwHVpYMy latest blog is live on @DealBook - Why You Should Tip More Than You Do Now http://t.co/gG7IKWdnP9@IbangaUmanah Hey there, where did you see that quote? Happy to have said it!!My new @HarvardBiz blog shares more of the findings from our joint survey. Read it now: http://t.co/UJmpboJm1o“Gonna thrive while I’m alive, I’ll sleep so I’m ahead.” - my latest blog is live: Sleep as a Competitive Advantage http://t.co/2KDjMHiKoi@MegletNY Thank you for that!My #sixwordmemoir \"Depth-seeker, truth-teller, empathy student\" What's yours? @sixwords #sixwordsA follow up to my piece \"Why You Hate Work\" is up on @DealBook: \"You Don't Have to Hate Your Job\" http://t.co/z5bbofErXC@ATOMsanRafael You are a man who understands what is really important!@jeffweiner @nytimes Thank you for the tweet. Love to talk with you sometime!\ntony at http://t.co/fl2ixDtzi2@ariannahuff Thank you! xo@jenniferwarawa much appreciated jennifer!", 
    "@shawmu": "Bust drama triangles in your relationships at work and home | Psychology Today http://t.co/4UVPOQJRk6I'm no longer tweeting under this name. I'm now at @TheShawnMurphy. Please be sure to look out for tweets with my new name. Cheers.I've moved my account to @TheShawnMurphy. Please tweet with me over there. Cheers!I've moved my main account to @TheShawnMurphy. Let's connect there. Cheers!", 
    "@tedrubin": "Make it a great night! 🌅 #RonR #NoLetUp  #wycwyc @ Nickerson Beach https://t.co/ysQPGgBNGgLove closing down the beach 😎 #NoLetUp @ Nickerson Beach https://t.co/GYWKNwqSBLBreathing... #RonR with myself 🌊 @ Nickerson Beach https://t.co/79ayjShFGlRelationships are like muscle tissue, the more you engage them, the stronger and more valuable they… https://t.co/qb0TblxzszReturn on Relationship Is Key to Social Success | ~via @SproutSocial... http://t.co/dB2xQxATM8 #RonR #NoLetUp #JustBeNiceReturn on Relationship Is Key to Social Success | ~via @SproutSocial... http://t.co/dB2xQxATM8 #RonR #NoLetUpWords of wisdom via @ClaireCapeci, Global President of Retail @JWT_Worldwide at #biSummit http://t.co/aRyNygHt7n #RonR #NoLetUp@peoplefw :-)@SassyMamainLA You bet Yolanda, hope all is well :-)Return on Relationship Is Key to Social Success | Sprout Social, Inc.\n\n#RonR #NoLetUp https://t.co/QEZ5f0d01CThe Better For You Oil Is Already In Your Pantry #SoyParaSoy - Sassy Mama in LA @SassyMamainLA http://t.co/19E6FKo0aI #RonRYum... Culinary Postcard from Peru! Join me Celebrating Summer w/Avocados from Peru. ~@KatjaPresnal http://t.co/hg8WlS6pT6 #RonRVirtual reality vs. augmented reality: Debating the merits - Yahoo News @Scobleizer http://t.co/vjJMY0c9Vf #RonRTVD Live: Starsailor and Embrace at Slims, 6/4 - The Vinyl District @JasonMillerCA http://t.co/Ru1GxTOLP0 #RonRWrapping Up June's Global Edition of Social Media Week 2015 - Social Media Week @zefrank http://t.co/fzY254Tjtx #RonRSocial Media #SocialSkim: Pinterest the Purchasing Powerhouse, Plus 11 More Stories in This Week's @luckthelady http://t.co/gFqZIZBQWi #RonRInside PR 411: Communications Across Borders - FIR Podcast Network @ginidietrich http://t.co/5J80dWKI1L #RonRThink Big Act Bigger by C-Suite's Jeffrey Hayzlett: pre-order NOW! - Maven of Savin @JeffreyHayzlett http://t.co/BOugQ6yeOV #RonRWorking 9-to-5 Becoming a Less Popular Way To Make a Living | Sci-Tech Today @TheHiredGuns http://t.co/MuN0ZtKuaY #RonR85% of all B2B marketers use Twitter as their primary tool. #DidYouKnow... http://t.co/0KVAIn0mHP http://t.co/D4LDlEOZUdTimes have changed, talent attraction now relies heavily on employee engagement &amp;... http://t.co/Y4iQELtA1x http://t.co/BXcYaFskA4@TamaraMcCleary xo 😎People now choose their media vs. being beholden to media schedules, formats or those who we “should” be listening to. #RonREmpower Your Creativity... keep a package of crayons in your desk drawer—you never know what magic they’ll inspire. #RonR #NoLetUpBuild It to be Great - Not to Sell It ~via @SiteSell... http://t.co/Z0nYGRc4V0 #RonR #NoLetUpHilarious account of what happens when entire ad industry works frm same millennial research: http://t.co/9GHfFLl0K2 #RonRThose who adapt to social engagement will drive more business &amp; stay competitive—those who ignore it will not. #RonR #NoLetUp@SherryAG @TamaraMcCleary @SellingInASkirt @AllisonMassari @pamelaWshaw Make it a great weekend!Ditto! RT @TamaraMcCleary: @SellingInASkirt @SherryAG @AllisonMassari @TedRubin @pamelaWshaw Agree with you Judy. Sherry is the best. =)@peoplefw Make it a great weekend Lynn!Of coursework did! 😊 RT @M_Derlicki: Wonder if @tamicann and @TedRubin saw each other? I bet it was amazing! https://t.co/hUjSl4bmqM😉 RT @tedbauer2003: The worst culture is one that has no time for new ideas: http://t.co/0lLFY6WXCW (@humanworkplace) http://t.co/KLvpuiaXCJJohn 😊 RT @johndrossjr: @TedRubin http://t.co/ik3DZigMoO #tedsockieWe all need to stop worrying about “where it’s going” in Social and start concentrating on “where it is.” #RonR #NoLetUpThere will always be a “next best thing” but your current customers are here NOW &amp; need your attention NOW. #RonR #NoLetUp #JustBeNiceThere will always be a “next best thing” but your current customers are here NOW &amp; need your attention NOW. #RonR #NoLetUpYour customers are ALWAYS your best thing – treat them that way. #RonR #NoLetUp #JustBeNiceYour customers are ALWAYS your best thing – treat them that way. #RonR #NoLetUpEmployee Advocacy Has Gone Mainstream... http://t.co/tYYOn6pzVu\n~via @Dynamic_Signal​ &amp; @RFradin​ #RonR #ExciteToIgniteNeed to relax today! RT @alphabetsuccess: @TedRubin Thanks Ted. A fine weekend to you and @bryankramer Bryan as well. #RonR #NoLetUp👍🏻 RT @alphabetsuccess: @TedRubin Thanks Ted. A fine weekend to you and @bryankramer Bryan as well. #RonR #NoLetUpThansk Matt! RT @MatthewManor: Great piece. @DynamicAdvocate @InsideCXM @TedRubin@SHumblebrag 😉@alphabetsuccess @bryankramer thank you both. Make it a great weekend!@dadwinky Make it a great weekend! ☺️@otaupin Thanks Olivier. Make it a great weekend!😊 RT @Carusele: @iSocialFanz @IanGertler @TedRubin @Katadhin come see us!!😉RT @Katadhin: Thx for the socks @Tedrubin! Nothing better than getting socks from the Ayatollah…(at @ny_njairports) https://t.co/ymibsk8LISYes Pat! That’s some real #RonR RT @brandcottage: .@TedRubin get home and get one of these! #happyweekend #trainlife http://t.co/lCxk6DINcj👏🏼👏🏼👏🏼 RT @iSocialFanz: @IanGertler @TedRubin @Katadhin I might be making a NC tour in July. We will see", 
    "@briansolis": "Cheers! From http://t.co/DXTQYSaUve @schramsberg http://t.co/nFvkALwqZFEmbrace the Audience http://t.co/vnDsXLnvsXDesign Secrets of the $1 Billion Club http://t.co/QkAjAXgNf6 @growconfDesign Secrets of the $1 Billion Club: Is Innovative #UX in the DNA of Unicorns? http://t.co/QkAjAXgNf6 via @growconfThe Icahn was coming from inside the house: Why Dick Costolo’s ouster changes the Valley http://t.co/OzMf7eN4ZR via @sarahcudaAre Investors Secretly Inflating Valuations To Protect Themselves? via @growconf http://t.co/5XBq1x6RKCEmbracing the Audience: 5 Tips on Customer-Based Marketing http://t.co/vnDsXLnvsXRT @dickc: Welcome back, @jack !! https://t.co/3papmyUKg0FTC takes first action against a fraudulent Kickstarter campaign http://t.co/fqdaLLST0w via @amy_schatzKevin Rose Moves On From Silicon Valley to Watches http://t.co/0c0dRvsnoY via @nytimesbitsPlease join me + @janrain in 10! \"It's Time to Make Business Personal...Again\" #customerjourney #webinar http://t.co/B0fP9P7oF25 Tips on Customer-Based Marketing http://t.co/vnDsXLnvsXTwitter advertisers can now target based on which apps you've downloaded http://t.co/i6VZYCnZP3 via @KurtWagner8Embracing the Audience: 5 Tips on Customer-Based Marketing http://t.co/vnDsXL5UBpRT @socialmedia2day: #SocialShakeUp15 attendees: don't miss @briansolis's latest! https://t.co/4BIdmxqAZTRT @Insightpool: Stop by our booth &amp; get @briansolis's newest (60+pg) eBook for FREE! Download http://t.co/aprwswwp8u #socialshakeup15 http…Hello Oslo friends. I'm arriving on 16/6. Perhaps we should meet for drinks that evening? Please send me a note. Cheers everyone!RT @OlaHano: If your not disrupt your business model every year Its going to be disruptet for you #ledelse http://t.co/wCCWl6CM87 http://t.…RT @Janrain: Register now for our June 11 webinar with @briansolis &amp; Jamie @Beckland as they explore the #newcustomerjourney: http://t.co/A…Founders Beware: Are Investors Secretly Inflating Valuations To Protect Themselves? http://t.co/KVtCdQT23D via @thekenyeung @GrowConfI missed everyone at #socialshakeup15 this year. Please stop by @insightpool to get a copy of my latest e-book http://t.co/lbzVjnTzdSIf you don’t disrupt yourself, someone else will do it for you. #Innovateordie #pegaworld https://t.co/qLKgGILQYv via @IrregularsTalking about the #applewatch on air w/ @CoryTV and @carolmassar  #BloombergAdvantage http://t.co/1gmQ4z8jmYRT @Insightpool: Hey #socialshakeup15 attendees -- get @briansolis's newest (60+page) eBook for FREE this week! http://t.co/aprwswwp8u http…RT @SLeRouzic: \"Think like the Customer, act like a Startup!\" - Conseil de @briansolis via @BMeeuwissen #PegaWORLD http://t.co/c5T8AuxOOQRT @ValaAfshar: \"We’re always ready to point out what doesn’t work, but we’re rarely so willing to become part of the solution.\" — @brianso…RT @careersync_now: incrementalism | innovation | disruption\n\n— briansolis #pegaworld http://t.co/aD1VYgHqnc http://t.co/D0FW1vIh4fRT @donpega: Ask WWMDCD (What Would My Digital Customer Do?) - @briansolis #pegaworld | Execs and leaders need to live digital to do this e…RT @BMeeuwissen: Nice quote @briansolis #PegaWORLD http://t.co/gETFuaomEG\"Le Futur du Marketing n'est pas le Marketing\" #DM1to1: http://t.co/5UC0pgZtYE via @isabellemathieuAt @GrowConf, @Stewart of @SlackHQ will share what’s behind fast growth and it’s not what you think. 8/19 #Whistler http://t.co/N8bOTQZXvOFree [eBook] Meet Generation C, Your New Connected Customers via @Insightpool and yours truly! http://t.co/eTUZ4fnzb0 #digitalinfluenceRT @SlideShareToday: 'The Future of Digital Music and Artistry - Brian Solis at Midem ...' by @briansolis is featured on our homepage. http…5 Ways to Transform the Customer Service Experience by @judithaquino http://t.co/VKBeJ2gmifIt’s Time to Move on to Social Media 2.0 w/@spinaltap http://t.co/X3pJpoTTlL @CMW_WeekThe new ZMOT: 10 Ways Marketers Can Compete for Micro-Moments\n http://t.co/bHiK7NqfVY #digitalmarketingRT @Insightpool: We are currently giving away this @briansolis 60+ page eBook for FREE - download here: http://t.co/be5wCOIhuO http://t.co/…What a surprise by team @wileybiz. Returned home to learn the #endofbusiness is now available in Chinese! Yay! http://t.co/lCv3fivxUGBonjour from @Midem in Cannes! #canneslife #cannes #postcard #bowtie #007 http://t.co/hGpFnrRcjiRT @midem: \"Engagement is more important than numbers\" (@LA_Reid). More quotes in our #midem day 2 wrap! http://t.co/G0wpR78VUQ http://t.co…RT @findikian: Support living artists. The dead ones do not néed it. Brian Solis you rock ! #MyBandNewsMIDEM #midem #innovationRT @midem: \"You'll find $2,000 speakers and $500 headphones... But you won't buy an album!\" @briansolis #midemWhen in Cannes...#yacht. @midem w @brady @obrien http://t.co/JiyEF5fvuQThe New Moment of Truth - From #ZMOT to #MicroMoments http://t.co/bHiK7N8F4q @thinkwithgoogleCommunity is much more than belonging to something; it’s about doing something together that makes belonging matter http://t.co/e00ictWZQfRT @Janrain: Join @briansolis &amp; Jamie @beckland in their upcoming webinar exploring #customerengagement &amp; #personalization: http://t.co/A5U…Consumers are often more loyal to a need in the moment than to a particular brand... http://t.co/bHiK7N8F4q #thingsthatmakeyougohmmmArriving in Cannes for @Midem. Hope to see you here! #frenchriveria #postcard http://t.co/hZQYyCEz7AThe New Moment of Truth: Google's Micro-Moments Reshape the Marketing Funnel http://t.co/bHiK7NqfVYHemingway once said to write drunk and edit sober. Instead hire an editor. ;) @hoteldupalais #writefromtheliver http://t.co/LskJH6ayKo", 
    "@hnshah": "RT @shervin: Great teams work like this http://t.co/bKypCkTDzURT @stevesi: Very thoughtful view on email's evolution/future by @Frontapp's founder @collinmathilde. http://t.co/5faWwvk1FZ http://t.co/Em…@gonfva he keep moving the mic towards me. I guess @Steli isn't as loud as he thinks! Thanks for the feedback. Tell us more!RT @poornima: Getting ready to speak @ conferences this summer? Get the 8 Techniques of Public Speaking Pros http://t.co/TbS5VVW31B http://…@Steli http://t.co/1wcfpxIlqHRT @searls: 💫 Computer terms:\ncloud = servers\nalgorithm = code\napp = code w/an icon\nreason about = understand\nisomorphic = reused\ntechnical…RT @nbashaw: Do you prefer to read books / longform essays on your laptop or your phone?RT @SeanEllis: Boom! The AMA we've all been waiting for @bbalfour VP of Growth at @HubSpot Tues 930 AM PT https://t.co/zBsUfuW7Mk http://t.…RT @jack: California Announces Restrictions on Water Use by Farmers, via @nytimes http://t.co/w9JjeZO0T3RT @jaredkim: How times have changed @YouTube @YouTubeGaming! http://t.co/dXOmptFvo2RT @markbao: Nathan Bashaw on the importance of the container that content is in, and what interactive writing might look like: https://t.c…RT @davidjbland: Just because a startup founder got it right in the 1990's, doesn't necessarily mean his advice is applicable in 2015.Just did a podcast with @steli about my tips for tweeting. Next up I’m going to ask him about his tips for speaking! http://t.co/Z3OQiyIf6zHow to Evaluate Machine Learning Models: The Pitfalls of A/B Testing http://t.co/rcurd0Eh5F #measure http://t.co/Ew28mw4v8cRT @kevinweil: #OnlyOnTwitter: this conversation between @SnoopDogg and @levie. 💥 http://t.co/dVEnZsbeqOHow To Hire Designers http://t.co/wInqfgSgGm http://t.co/SgvC93fz8nCreate an Upvote Snowball: A Simple Technique to Get 600 Legit Subscribers http://t.co/8E9OgewthU http://t.co/i95xKJPVlWRT @danprimack: Crossover investor: Uber is the IPO blockade. When it goes, others will follow.RT @Steli: NEW EPISODE FRESH OF THE PRESS: How to create predictable content marketing http://t.co/CrZrv3vcSD #thestartupchat cc @hnshahHow Apple Screwed Up the Apple Music Pricing Strategy http://t.co/yYMAcIJgo1 http://t.co/phknkwTQE5RT @stevecheney: 'Be yourself. Everyone else is already taken.' - Oscar Wilde@ibringtraffic that look is priceless.@KPatelALM =)22 Gmail Plugins That All Content Marketers Need to Know About http://t.co/wy4b42pUGZ http://t.co/CnRz72TBezRT @paulmozur: The stark rise of Uber in China over the past year. From a 1400 rank to top 20 in 12 months.http://t.co/pmQfneHwdc http://t.…@scottxp nice! @Steli @MicroConfRT @strebel: CrazyEgg is crazy cool https://t.co/76bWxoAdKLHow safe is air quality on commercial planes? http://t.co/SiO72q9Peq http://t.co/dXIv63Ji34Answer on @Quora by @Steli to How should a SaaS B2B offering be priced? A business model question. http://t.co/9TawWZI94CRT @msg: These are real good tips for pitching potential customers by @rklau https://t.co/5QbzrstHz0 http://t.co/sBaPBfBbKwVinod Khosla: Be Wary of “Stupid Advice” http://t.co/arQQ6oik8v http://t.co/aZB2cGFRAUHow to Gain Insights from Top Business Books in Half the Time http://t.co/YtsL8PaCyi http://t.co/qiPBc6h6VOHow Artificial Intelligence Will Make Technology Disappear http://t.co/xlPfL71JMr http://t.co/Np3mK8gMtwRT @BV: The \"sell by\" dates on thousands of U.S. food products are almost completely arbitrary http://t.co/HtfweYITEb http://t.co/rVNGEwYISART @arjunsethi: Every time I read this, I reflect on how we can be better as a team “Values” by @chamath https://t.co/rsp7kGMrD2@prlambert I'm asking if anyone at the company is able to make the right improvements to grow twitter. @iok @christianism @naynerz @twitter@jeffma any time! @iok @christianism @naynerz @twitter @prlambert@prlambert active users and growth. starts with onboarding. @iok @christianism @naynerz @twitter@iok and I wouldn't make suggestions on what to do unless I know what was important based on data. Plus, that's your job ;)@iok my feedback isn't useful to you unless it solves the problems that matter with onboarding and decreasing people's time to value...RT @ibringtraffic: @naynerz @hnshah @christianism first rule of ab testing: never assume anything :)@iok if you have data to discuss, I'm happy to share what I would recommend doing ;) @christianism @naynerz @twitter @prlambert@jonathan_poston ask all the people who signed up and aren't actively using @twitterRT @ibringtraffic: @christianism @hnshah it's inaccurate to count twitter actives like FB actives. Different value prop and market. King of…RT @ibringtraffic: @christianism @hnshah apps that connect ppl to ppl are consistently larger by active user def eg whatsapp, Facebook, et …@hunterwalk now that's some trolling right there... @christianism@jest1 hi =) I'd love your thoughts on this: https://t.co/z8NsV4FvIvRT @ibringtraffic: @christianism @hnshah Twitter has crushed it when it comes to topic connecticity. Just needs to define itself in that wa…@ibringtraffic ah, that's at least $0.10 ;) @christianism@ibringtraffic no hope or is it more like climbing mount everest at this point? @christianism", 
    "@erikaandersen": "The Secret To Getting Good At Things Quickly http://t.co/UZtsT4M6zK  via @forbes3 Qualities That Define The Natural Leader - Do You Have Them? @Forbes http://t.co/IBrhak3x8K@Manny13z @Forbes - thanks!If you find my insights valuable, please vote for me as a top management and leadership thinker at http://t.co/bz2xWvBF5o3 Ways To Market Yourself Without Sounding Like A Late-Night Infomercial http://t.co/aJ6Vd7lhEH  via @forbesAsk, “What do you think about this?” or say, “I’d love to hear your point of view on this, too.”Can You Lead - Or Do You Just Think You Can? http://t.co/eUZ9rXlmG8  via @forbesBurning Down The House: The Power Of Starting Over http://t.co/fUr272TEJR  via @forbes5 Top Signs That You Might Be In Danger Of Getting Fired http://t.co/Za8UtT9svc  via @forbesIs 'Cultural Fit' Just A New Way To Discriminate? http://t.co/nIq3o510Fe  via @forbesIt is not enough to be industrious; so are the ants. What are you industrious about? - Henry David Thoreau http://t.co/F7492o9GtQWhen Just Focusing On The Money Works - And When It Doesn't http://t.co/PdzFP02GL6  via @forbesIf you find my insights valuable, please vote for me as a top management and leadership thinker at http://t.co/bz2xWvBF5oOverwhelmed By Change? These 4 Things Can Make It Easier http://t.co/zToXpjstbJ  via @forbesHow To Do Great Things, Starting Right Now http://t.co/BInDlrFAa1  via @forbesAnswer These 6 Questions - And Customers Will Love You http://t.co/ZPkkJuwNM2  via @forbesWant To Grow Internationally?  Don't Ignore These 3 Things http://t.co/9LmPEMUkpy  via @forbesThe One Thing That Can Make Or Break A Team (Does Your Team Have It?) http://t.co/rldKaP67mT  via @forbes6 Tips For Staying Afloat In A Sea Of Change http://t.co/WUop20mYCJ via @forbesAnything or anyone that does not bring you alive is too small for you. - David Whyte, poet http://t.co/2q93zKFV61Is Your Business Losing Customers? Look To The Little Things http://t.co/QRlUNf1SDg  via @forbesIf you find my insights valuable, please vote for me as a top management and leadership thinker at http://t.co/bz2xWvBF5oWhen Things Get Really Bad, Here's The Leadership Skill You Need Most http://t.co/peKaQMJ7bp  via @forbes5 Qualities to Look for in a Mentor @Forbes http://t.co/E95IMbJ8hZ5 Things You Need To Become A Successful Entrepreneur http://t.co/7D0Ozphiwp  via @forbesHow Great Employees Can Save Your Company http://t.co/KcIkfbU0jV  via @forbesWant To Be More Creative? Take A Break From Your Job http://t.co/J5JgGqQmRA  via @forbesWhy Top Talent Leaves: Top 10 Reasons Boiled Down to 1 http://t.co/ivcLLW6uTy   via @forbesWhen Things Get Really Bad, Here's The Leadership Skill You Need Most http://t.co/peKaQMJ7bp    via @forbesIf you find my insights valuable, please vote for me as a top management and leadership thinker at http://t.co/bz2xWvBF5oWant To Keep Your Best People?  Do This - Forbes http://t.co/d0C5fzCjwnBeing a Trustworthy Leader Is More Than Just Not Lying - Forbes http://t.co/IbZgPKC0no5 Top Reasons Strategy Is So Boring You Won't Even Read This http://t.co/6xLQj1UWrp   via @forbesLearn the Secrets of Being a Great Leader -  From @bobgarlick http://t.co/4azQ62ogyKYou Have What You Need To Succeed. Use It. - @Forbes http://t.co/1lWBt5v87uWant To Be More Creative? Take A Break From Your Job http://t.co/J5JgGqQmRA  via @forbesIf you find my insights valuable, please vote for me as a top management and leadership thinker at http://t.co/bz2xWvBF5oWhat Planet Are You From? Five Ways To Get Along With People Who Aren't Like You http://t.co/ye7ADtWzPN via @forbesHow To Do Great Things, Starting Right Now http://t.co/BInDlrFAa1  via @forbesHow Great Leaders Avoid Getting Burned Out: Two Simple Secrets http://t.co/bho5MCPZPO via @forbesWhen Things Get Really Bad, Here's The Leadership Skill You Need Most http://t.co/peKaQMJ7bp  via @forbes5 Things You Need To Become A Successful Entrepreneur http://t.co/7D0Ozphiwp  via @forbesIn Praise of Men @Forbes http://t.co/dabb6hppV3\"The Vision Thing\" - And Why It Matters To You http://t.co/5qVNenQhcj  via @ForbesIf you find my insights valuable, please vote for me as a top management and leadership thinker at http://t.co/bz2xWvBF5o5 Things To Look For When Choosing An Executive Coach @Forbes http://t.co/2jJxBPZu8ZHow Springtime Can Make Us Better Leaders http://t.co/kpVVop57TL via @forbesGreat Leaders Don't Predict the Future - They Invent It @Forbes http://t.co/sDSCDf2dYsAre you a followable leader? Click here and find out: http://t.co/66N1SjLnJe15 Inspiring Quotes From Nelson Mandela On Leadership, Change And Life @Forbes http://t.co/b8BDTcUlVG", 
    "@arrington": "@jasonlk definitely better alignment of interests. But only wealthy people could be VCs, with no income for years.@PeterHimler that is a fundamental misunderstanding of uberUse my MTailor code, sdjoydlq, for $20 off a custom shirt. Your phone's camera measures you for the perfect fit. http://t.co/gVEhZdS89ZSpace ‘Buoy’ May Help Protect Power Grid From Sun’s Fury http://t.co/Ld0K6QPwdW via @businessThey don't make Star Wars sheets for king size beds?@MarketingJourno @TechCrunch idiot.Lot of power outages in SOMA recently..@MarketingJourno I haven't worked with writers for years (I left techcrunch in 2011), so no I do not monitor my writers.America circa 2015 http://t.co/a5q14DSI0T@Uber_Support  fixed! ThanksIf u prioritize Twitter complaints over regular cust serv email you are encouraging everyone to complain publicly about your productI'm locked in Uber purgatory. Password can't reset and can't create new account b/c phone # is reserved. Crazy.Dogs snub people who are mean to their owners: study http://t.co/YR45Ff8ovA via @YahooNewsThis is fascinating: OpenBazaar $1 Million in Funding from Andreessen Horowitz and Others: http://t.co/pbN73fKmtp (via @nikcub)I've reached my limit of stupid stuff on the internet today.If you hate your neighbors, just call child protective services on them and wreck their lives. http://t.co/tRW872gB9Q@ajsharp link?@sydiot @RickWebb @MikeDuda shoot. I thought I was getting ahead in this game, and then I step in it. Please don't report me!@LarryAasen it's just visually amazing.@L1AD it's called getting in front of a parade. https://t.co/Aj3d3GqfYG TechCrunch 101College Encourages Lively Exchange Of Idea http://t.co/zqvLbvrMSu via @theonion@RickWebb @MikeDuda No, \"Y'all\" is southern, which means racist, so that won't work.@LA_Banker that sounds about right.So @dickc was fired. My guess is @sacca knew about it before writing his recent open letters.ok \"you guys\" is out. http://t.co/6ktEFZxYTl \"you people\" is racist. How about \"Hey, Fucktards?\" Is that ok?The two party political system in the U.S. is Washington D.C. v. everyone else.Reddit censoring hate subs isn't a big deal. Censoring criticism of Ellen Pao, who they are calling Chairman Pao\" is http://t.co/6Ec5i04y6aProduct Hunt Levels Up With A Gaming Category http://t.co/k6kuFOLwzE via @techcrunchKevin Rose @kevinrose Moves On From Silicon Valley to Watches http://t.co/s4URPoiOIy (follow your passion)People need to think twice before engaging in irresponsible entrepreneurship. I hope the IRS goes after her next! http://t.co/RMCbuoEdRgFinally http://t.co/7jcxJSzcTJChronos Is A Little Disk That Ensmartens Your Dumb Watch http://t.co/QnrvddFw6B via @techcrunchRT @pachydermIO: We're thrilled to officially announce our seed round with an amazing group of investors.\nhttp://t.co/GXAsWonqUsJustice Department Issues Subpoenas To Reason To Identify Angry Anonymous Commenters https://t.co/Ra7OUZz5wi via @TechdirtSurprised and disappointed Reason hasn't said a thing about this  http://t.co/Gk3bUrZILAStartups Offer New Ways to Buy and Sell Used Cars http://t.co/b0ilyAM9Ld via @usnewsMy Little Pony Toys Made to Look Like Characters From 'Mad Max: Fury Road' http://t.co/BkdluHz3MW via @LaughingSquidKalief Browder, 1993–2015 http://t.co/u26eHlQe0P via @newyorkerJust settling in to http://t.co/ZZGapc7Cyf - really good so far.The Martian | Official Trailer [HD] | 20th Century FOX https://t.co/89CbKjnUtk via @YouTube.@reBOOT_Detroit are the big Detroit fans...trying to help them get their conference off the ground!What does that even mean? http://t.co/2CNRu1SR7RPeak arrogance says @om  as we walk by. http://t.co/El6RfUxQivBottle #1 from @om http://t.co/sUOlaSsccLSecond bottle of evening http://t.co/Ppxj9ExMdyhttp://t.co/DNn6iOPDtRGolden shipping container transports Americans to parts unknown http://t.co/FN9dVNGFET via @YahooNews@NinjaEconomics line where contentious, is it 20 weeks bc pain begins or later up to birth or even post birth as some argue is appropriate@jayadelson @DetroitBruce @Shinola he is an affable and charismatic dude and a terrific brand ambassadorIt was lovely meeting @DetroitBruce tonight, and thank you for the @Shinola watch. It is a beautiful little machine.", 
    "@pakman": "RT @Maidenberg: Every now and then the right things happen to the right people. Congrats @nwintroub ! http://t.co/p4P8ViDvRTSteve Perry of Journey at long last admits he made up \"South Detroit\"! http://t.co/bkiogab4riRT @ammori: DC circuit court denies stay request. Net neutrality rules go into effect tomorrow ! Congrats AmericaHuge props to @dickc for building up one of the most important companies in the galaxy.\"The Imperial March\" by the Vienna Philharmonic Orchestra https://t.co/oTgOOGr9wm@kwhitehouse Wait, did you file that one?If you care about patent reform, and we all should, please check out @LincolnLabs  @DerekKhanna's proposed changes. http://t.co/W6fmr28TOmWow, ADP must really feel threatened. \"ADP Sues Zenefits for Defamation\" http://t.co/ceXxDHQRkA@jyarow artists get 15%-20% of total record company rev, sometimes 50% of streaming rev, after recouping. See this: http://t.co/lPFsCEu7eH@shaig @pkafka @jyarow 81%\"Did Apple Music Have a Window To Disrupt and Not Take It?\" by @djgeoffe on @LinkedIn https://t.co/9JxI5A8UzfRT @jessiwrites: Jack Ma's says it's possible #Alibaba will be bigger than Walmart globally this year. http://t.co/DWmNls0s7XFascinating to watch this.  https://t.co/1CqOyBynsM@karenallen @djgeoffe permitted? Apple Family Sharing exists today and requires a shared credit card.@karenallen @djgeoffe there are only 3M US families with 4 or more kidsLed Zeppelin debuts new track on...YouTube.  https://t.co/UqruzkjdkaCheaper to be an Apple Developer than to pay for one year of #AppleMusic . https://t.co/vLHURp2cQFRT @djgeoffe: Why the cost of Apple Music doesn't make sense. A good read from @pakman on music pricing http://t.co/g5ZZEB5tnx #WWDCApple Said to Build High-Speed Network for Fast Content Delivery http://t.co/qFE9rk0Vef via @businessHackerOne Connects Hackers With Companies, and Hopes for a Win-Win, via @nytimes http://t.co/aCZEKKFcjK‘Le Selfie’, via @nytimes http://t.co/Nj41AKGyZ2This is the sound of tens of thousands of homeowners electing a new East Hampton town supervisor.When I was a kid, budding promoters launched music festivals. Now they launch YouTuber/Viner/YouNower festivals! https://t.co/BWRmvX55S8@schlaf also… 4) HR Dept bans services like Uber 5) PR dept prevents unfiltered blogging/tweeting 6) IT department blocks Facebook etcHow to Know If You Talk Too Much - HBR (needed this advice 10 yrs ago!) https://t.co/GA9kifax4OA Rare Look At How Netflix Manages Security in the Age of DevOps http://t.co/xvh38JNEml via @WSJ\"The tech arms race in AAA games - and why I'm abandoning it.\" Increasing costs with marginal improvements. http://t.co/wTwru7PjSd@bcmerchant That's true, they can be. It will be interesting to see how they manage that.@bcmerchant @randeedawn @lorakolodny Actually, they never said \"as of now.\" They said no external ads \"ever\" which they have always said.@randeedawn @bcmerchant @lorakolodny @lorakolodny Entire exec team has consistently refused to adopt an ad model.@randeedawn @bcmerchant @lorakolodny @lorakolodny Just because they are showing promos, what evidence exists they are going to show ads?A great Wall Street trend: B-school grads endowing engineering schools. \"Paulson Gives $400M to Harvard Eng School\" http://t.co/hPWLebRVWjTrue for OSes but also for social networks and media platforms. Great observation by @benthompson http://t.co/CWv0FISKJT@sawickipedia @sether no joke they still use okidata dot matrix printersRT @thDigitalReader: kerning is important. http://t.co/msnjtJgYyG@mekosoff \"so-called millennial generation\". Such a silly article.Awesome seeing 6K+ live fans helping @tyleroakley raise more than $500K right now on @YouNow http://t.co/0SzEAdOlGk #GetTylerTo7Million@daddymention Exactly. You seen anyone do the math?@daddymention More like LTV, but yeah.Has anyone estimated the economic value of launching a presidential campaign (assuming you don't get the nomination)?Messaging is just getting started (Fantastic thoughts by @thoughtwax, h/t @mdudas) https://t.co/vwRAroeWcr@peretti let me be the first to tell you that you are an \"online force\"!@stevebryant nope, I do mean messages. Lots of \"yep\", \"can you...\", \"home by 5\"First impression of Apple Watch: we will message each other even more frequently but in shorter and shorter bursts.RT @peretti: @pakman BuzzFeed Video gets more than 100mm YT views every single week@BenedictEvans nice. My daughter was like, \"Dan and Phil get 5M views each video.\"RT @DJSnM: @pakman @nytimes @JerrySeinfeld Coming up on 90million views myself. Not bad for a spare time hobby.@aweissman still waiting on that profile of captainsparklez...There are thousands of channels with far more than 100M video views on YouTube, but the @nytimes anoints @JerrySeinfeld as an \"online force\"🔴 LIVE Adi on #YouNow - Come hear @YouNow's CEO Adi do a live Q&amp;A http://t.co/FD9dzsEAgV http://t.co/NSP3q0iALA", 
    "@ducttape": "Listening to some local singer songwriters during #porchfestkc @ West Plaza https://t.co/3j0RUtxatFGood things -PLTTS color picker, Venngage free infographic tool and Bounce message bars customized to each visitor - http://t.co/xwH3URCjNO@AustinTinAustin I did. Thanks AustinWill Online Marketing Help You Save Money? - http://t.co/mkluf3fDEW@LionelGeek I know it is@InspireInsider pretty simple hey\"Free training from @peter_sandeen - Creating High-Converting Sales Funnels (the smart, quick way)\" http://t.co/QcpiElRqAV@DaveKerpen thanks DaveHow I built a freelance caricature business http://t.co/8DLad8bIuOTry reverse self-promotion to promote yourself http://t.co/dPHE2A2KKhUnleash your inner writer by downloading the latest MarketingProfs marketing writing kit for free! Visit: http://t.co/ScBtGxKOeIUnleash your inner writer by downloading the latest MarketingProfs marketing writing kit for free! Visit: http://t.co/wCVU8aZcoAThe 18+ Best Marketing Podcasts: Learn With the Pros http://t.co/VWw4DP7cTs via @wordstreamRT @MarketingProfs: How Strong Is Your Instagram Game? Lessons from My Five Fave Accounts &gt;  http://t.co/TtCoyEwwPy http://t.co/ErhabKnLOISuccess tips for a virtual workforce - are offices soon to become a relic of the industrial age? - http://t.co/KluPVAgLK7Some great marketing tips from @samashdown - http://t.co/1zHViBJDP6Happy birthday - @billbrelsfordFocus on Yourself to Go Further - listen in on my conversation with @brianclark of @copyblogger - http://t.co/Oqlt3n55T7RT @brianclark: Listen to the first episode of Authorpreneur.FM with @jimkukral right here ... http://t.co/j3OFmd94Cg http://t.co/uJnyncdRd8@AdrianneMachina today at 3pm CT I'm doing a live call to go over network detail. http://t.co/0ZPhFer4ti to get details or we can chat@mcflipper that would be called the fox@AdrianneMachina hey I think you would love what we are doing these days.Watching my @Royals sporting some @TheSock101 finery http://t.co/1wkYt5y4Dm@kevinokeefe only the ones that listened to you all these years@kenyarmosh hey Key - I think it would be great, but perhaps a bit too limited in terms of audience - at least a publisher would say thatJoin me June 10th at 3pm CDT - Learn how to build a profitable consultant business with the Duct Tape Marketing - http://t.co/RjXlz6yxgwI'm partnering with @rivaliq for How Marketing Consultants Can Build a Profitable Producer Business Model - June 18 -https://t.co/vXQPPotyBZHow To Use Reverse Self-Promotion To Generate Exposure and Traffic - make it a consistent and intentional practice - http://t.co/ndoQXrFLhDDo you suppose it's possible to be happy before anything happens?RT @neilpatel: What I Learned About Content Marketing by Analyzing 614 Posts http://t.co/fY5OqxoGde http://t.co/DRlcHugKJeRT @buffer: Add value to your brand with #video content: A delightfully quick guide http://t.co/lwI8cPhrLL http://t.co/sz9xgXbxn2Business Growth: 9 Educational Small Business Blogs to Study http://t.co/OgVn3wZMRLTurn Your Website into a Lead Generation Machine - http://t.co/L9WRogPKORLove movies? Curious about content marketing strategy? Check out the new #CMWorld eBook for helpful tips. http://t.co/glzovg8gzp13 Experts on How To Promote Content Before Hitting Publish http://t.co/WqC1ZLCGkf\"Check out Zenefits – free online HR platform to bring payroll, benefits and other HR functions to one place\" http://t.co/7qgk4NB4H5\"Check out Firefly Connections – tool that automatically creates and sends a weekly newsletter for you\" http://t.co/RCPIqJYNlE\"Check out meistertask – highly intuitive task management tool from the mindmeister folks\" http://t.co/zV8GI9S8w4The Definitive Guide to List Building http://t.co/YlQE1yIG2V\"Check out Zenefits – free online HR platform to bring payroll, benefits and other HR functions to one place\" http://t.co/vUUOd6yd0q\"Check out Firefly Connections – tool that automatically creates and sends a weekly newsletter for you\" http://t.co/910D8sLJgU\"Check out meistertask – highly intuitive task management tool from the mindmeister folks\" http://t.co/VrL1Z1bgVV@ericries want to come back on the Duct Tape Marketing podcast to talk about the new book?10 Must-Read Blogs for Entrepreneurs &amp; Startup Founders http://t.co/abFe9ILDpcMarketers On Their Top Goals, Tactics, and Challenges http://t.co/MIm8b6g4eB http://t.co/iALyC81yAdThe Ultimate Guide To Mobile Marketing http://t.co/j777EFdkUU http://t.co/d7IE3Up60mThe best public speaking tips from 90 years of Toastmasters http://t.co/HfDS4DN6tTHow to Become a Confident Public Speaker http://t.co/JdrbEbQW1CA Designer's Guide To Workspace Organization: http://t.co/OA1UTYsgIIRT @toprank: R3 - Can you guess the fav movie of these #CMWorld speakers - @LorenMcDonald @cnmoody @Carlos_Abler @ducttape http://t.co/beb8…", 
    "@stevedenning": "Nevertheless: true! RT @djp1974: @stevedenning @meedabyte not the most useful definition ...He's not just acting! RT @peterme: If @Jack truly believes it, he’s acting dumb: \nhttp://t.co/lSdFTE3l6X https://t.co/WFj7FhkvffIt depends on how the measures like ROA and IRR are used @destraynor: @mamoonha see eg http://t.co/lKpk4BNh0SMyth=widely held but false belief @djp1974: @meedabyte myth as in a sacred narrative of central cultural importance? http://t.co/H7tGlbbmhZRT @vanschoo: This will make you sure to attend #agile4execs June 18 - @stevedenning interviews @collinsrod for Scrum Alliance https://t.co…RT @BridgetDiCello: The fact that a computer can do something better than a person doesn’t mean that the computer will replace the person h…RT @stratandbiz: Why robots aren't to be feared | @stevedenning on why the \"jobless future\" is a myth http://t.co/RMeal6YSUW @SBLeaders #jo…RT @qualitymedicine: #Healthcare #problem. We still have 20th Century style managers. They have no place in the 21st Century organization. …RT @trendssoul: REMEMBER\nWhy Software's Eating The World\n#software\n#leadership\nhttp://t.co/8DQJ6jcEJ5\nSEE ALSO\nhttp://t.co/eTIGhkS85C http:…RT @Pat_Hirigoyen: Will robots replace all of us? A convincing argument as to why that won't happen. http://t.co/FWlbQByGGmInfo isn't perfect but it's way better than before RT @rstraub46 Important analysis by @JeffreyPfeffer @jhagel https://t.co/76vWleFoAxRT @davidslocum: The Myth of the 'Jobless Future': @stevedenning on machines, tech, and the real issues in employment today http://t.co/PkK…RT @Levine_Alison: The 'Jobless Future' Due to Robots Is A Myth - Forbes http://t.co/Nacphm5Drj. I'm not worried abt the robots, I'm worrie…RT @adrianrcampbell: #entarch #bizarch Enterprise Architects are the bridge between  managers, executives, customers and agile teams. http:…RT @robvandereyden: Sociocracy listed as one of 30 groupings world-wide involved in “organisational transformation” to a digital economy: h…RT @andrewleaning: Applying \"Inspect &amp; Adapt\" To The Agile Manifesto http://t.co/lHS68gSRzwRT @RWartzman: .@stevedenning—With resources \"siphoned off to execs &amp; shareholders, there are insufficient resources for innovation\" http:/…RT @nikheynen: Origin Of 'The World's Dumbest Idea': Sole purpose of a firm is to make money for its shareholders via M. Friedman  http://t…RT @BrianBranagan: Stephen Denning has a great Forbes column: An Open Letter From Silicon Valley Calls For Bold Organizational Reform http:…RT @BrunoGebarski: Despite Federal Regulation, CEO-Worker Pay Gap Data Remains Hidden @SteveDenning #socbiz #socialCEO #hr http://t.co/slYj…RT @germainechia: @stevedenning Can Banks master disruptive innovation? Love the correlation with classical tragedy!! #fintechs #sibos http…RT @BrunoGebarski: Big Firms Increasingly Resort To 'Corporate Cocaine' | @SteveDenning #socbiz #socialCEO #shareholder http://t.co/4YZWyOV…RT @berndschiffer: The 'Jobless' Future is a Myth http://t.co/Og7xLwSK6h by @stevedenning Great chain of reasoning against a fear that I he…RT @dscofield: .@stevedenning's Brilliant \"The 'Jobless Future' Is A Myth\" http://t.co/cqNCJV8rivSilicon Prairie? :-} RT @jaygoldstein: A shout out to the burgeoning Chicago tech scene:http://t.co/IcD5zxiSDn @RogerLMartin @AngeloLoumisRT @NickDragojlovic: Very cool. RT @jimbobtyer: Great piece in financial models and the future of business by @stevedenning . http://t.co/K…Haha! RT @businesschange *spoiler* it’s not, it’s just more transient today #porterlives End Of Competitive Advantage http://t.co/Uk3PhohHCXHow share buybacks hurt shareholders, innovation, workers &amp; society @Forbes http://t.co/fhTHoA6api @Lazonick @rstraub46 @RogerLMartin #stoos@GKGureja Thanks. 4515 Klingle St NW Washington DC 200116@matthewpartovi Done!This is main source of inequality http://t.co/f5cgxUP0TA not Silicon Valley @kwooleyy:  @jowyang the one percent http://t.co/q46VFv0SB4RT @woolfiex50: The 'Jobless Future' Is A Myth http://t.co/FeVQjlrDgQ great article our human capabilities are limitless #DigitalTransforma…RT @dpontefract: Fab curation of existing groups &amp; people trying to change &amp; improve the 'purpose' of business by @stevedenning http://t.co…RT @mglacey: @stevedenning \"'The Jobless Future' is a Myth\" - great read. http://t.co/59XOhQeAZY #agile #scrum #leadershipForbes headlines Silicon Valley open letter calling for organizational reform http://t.co/qB7NWVmDgh @erikbryn @mitsloanide #stoosInequality comes less from wealth creation in Creative Economy than from wealth destruction in Traditional Economy http://t.co/KOMqW1j6rJRT @dmaher08: Maybe an economic sea change can happen!  This gives me hope http://t.co/ZiQt7Ea8bvRT @michaeltasker: Open Letter From Silicon Valley Calls For Reforms; Thinking of Joint Actions For Progress #business #leadership http://t…RT @kristinedery: “@stevedenning: Open Letter On The Digital Economy by @erikbryn et al http://t.co/HBh0kqmW6h @i4jeco #I4J #GPDF15 #SALC15…RT @DavidBlyth_2ndH: A great piece on #OrgTransformation agenda. Offers great links across a broad spectrum of ideas.  http://t.co/HonXfsKO…They might or they might not. Why assume we will let that happen? @jdavidsonlawyer: 4  work so far suggests events just spin out controlShows excellent taste! RT @jdavidsonlawyer: @stevedenning 1. like much of your writinghaha! RT @DavidKHagan Unfortunately, coming age of robots still demands humans at work. Great start to your work week http://t.co/i2N10QvSUESo: no reason to assume disaster! RT @jdavidsonlawyer digital information driven by Metcalf's law on network power none of which we knowThey are on Wall St &amp; in C-suite making money for themselves @jdavidsonlawyer  not enough smart skilled people? http://t.co/QBDzGirhuxRT @MeaningConf: MUST READ:\"A Open Letter From Silicon Valley Calls For Bold Organizational Reform\" http://t.co/uz4vMK5v8DRT @jurgenappelo: No, robots will NOT cause mass unemployment... The 'Jobless Future' Is A Myth | Thanks @stevedenning for a great post htt…RT @clarkaw: Boots announces 700 job cuts in press release entitled \"Boots renews customer-led business model to renew future growth\". PR c…RT @rossdawson: Good piece from @stevedenning on leading voices calling for bold reform in how organizations are run http://t.co/MOkma8eHkxRT @SecRobotSam: when you realy think about is, you come op with this http://t.co/nkv8hEc7Ty", 
    "@startuppro": "@odavrog All Zwillings may be related, but there are far too many for me to know. I'm from Illinois.Delegating Tasks http://t.co/EyQj4owfJKSocial Media Marketing Should Not Be Used Alone Today http://t.co/UxDc2bNJUr . The challenge is how to integrate your marketing content.Social Media Marketing Should Not Be Used Alone | Business Hub | http://t.co/vc6LuuuB55® http://t.co/ekQ4CxeFUn6 Things Startup Founders Should Do to Avoid the Devastation of an Incompetent Hire http://t.co/T91dFREuHo via @Entrepreneur@bosifounder Thanks for the positive feedback!@IamOkorodas To get started, read a few of my blogs on http://t.co/UECStTOGC2 . I give new guidance every day.Grants May Be Free, But They Do Come at a Price http://t.co/wjIgbsI3SO . How to use your precious time and effort effectively.4 Must-Have Characteristics for Entrepreneurs http://t.co/yTqf7GtdJk via @EntrepreneurStartups Without Business Plans Are Expensive Hobbies http://t.co/NQfKKAg0oQHow Introverts Like Mark Zuckerberg Build A Startup http://t.co/T3APCqNVkm via @examinercomA Few Questions with Martin Zwilling http://t.co/A7On4deC2jSuccessful Tech Companies throughout History http://t.co/fxfCfZQTIc via @NextGenRecruit4 Steps to Successful Conflict Management http://t.co/udqWCHrrI68 Reasons to Initiate a Startup While Job Searching - Ivy Exec Blog https://t.co/2wsarJnIdEUnderstand Your Entrepreneurial DNA Before You Start Up by @StartupPro http://t.co/Ebrhn7ZsZe via @Entrepreneur@windy_gaming Sounds like should keep doing whatever you are doing.8 Lessons For Entrepreneurs From The Shark Tank http://t.co/i9petSZJe5 . The last thing you want to hear is \"I'm out!\"8 Lessons For Entrepreneurs From The Shark Tank http://t.co/1sID57Dyea via @forbes@yaghi33 Here are some tips on pitching to investors: http://t.co/qhhkaa5v5hStartup Founders Face Serious Business Culture Myths http://t.co/lxfRAEOjUI7 Keys To Being Seen As A Superhuman Startup Founder http://t.co/sxxBVutlw0 via @examinercomLending A Hand: Q&amp;A with angel investor Martin Zwilling - https://t.co/USOVDNdLGO7 Entrepreneur Mistakes To Avoid In Early Meetings http://t.co/p1nadFKnR0 . You only get one chance to make a great first impression.Entrepreneurs Who Improve Society Make More Profit http://t.co/Z8GCnZ61FE . Does your startup have a culture of purpose?RT @ECAngelInvestor: @StartupPro - Congrats! You made our list of the June 2015 Top 100 Angel Investors to Follow on Twitter - http://t.co/…@krug_analytics Here is an article I posted earlier this year on strategy: http://t.co/FFxS13D0218 Ways For Logical Business Thinkers To Get Creative http://t.co/JLijm7DuqQ . Are you a right-brain or a left-brain entrepreneur?Angel Investors Are Still The Lifeblood Of Startups http://t.co/W5EtkMI9DV via @bloggerpluginsAngel Investors Are Still The Lifeblood Of Startups  via @HuffPostBizCheck Your Startup For Symptoms Of This Malaise http://t.co/9VaevseuYiNon-Disclosures Can Protect Your Idea, Or Destroy It http://t.co/24RAsohDJt via @examinercomGrants May Be Free, But They Do Come at a Price by @StartupPro http://t.co/n1ZZ3OIHYS via @EntrepreneurRT @Startup_today: Best Entrepreneur and Start-up Websites 2015 http://t.co/lGvdN0bcof by @MrktInspctrUK@Bagus_Prasety00 If you have to ask, you probably can't get it done. Trust yourself.The 5 Most Common Frustrations Of An Entrepreneur http://t.co/ECwEi9Gi55 . Learn from the mistakes of other entrepreneurs.The 5 Most Common Frustrations Of An Entrepreneur http://t.co/texVsg5ktr via @forbesAN ESSENTIAL GUIDE TO SWOT ANALYSIS http://t.co/3vnEFHzW0J #AN ESSENTIAL GUIDE TO SWOT ANALYSISThe Right Marketing For A New Business Costs Least http://t.co/qTPbc4tq5QHow Effective Is Your Business Communication Skill? http://t.co/21OM8g6IDA via @examinercomHow Entrepreneurs Attract Friends, Family And Fools http://t.co/fsPyVsLZWu . Avoid thinking of friends as the last funding resort.6 Trends Are Driving A Data Tsunami For Startups http://t.co/m8epqpeUj2 . Can you surf the tidal wave of information from the Internet?10 Modern Ways To Kickstart Your Business Website http://t.co/hBQ7ue3jJJ . Good content can come from many sources.Don't Screw Up a Meeting By Making One of These 7 Mistakes by @StartupPro http://t.co/bW4ETpztTr via @Entrepreneur@Arunviswanath95 Age is irrelevant. It's what you do that counts.Have You Explored Every Business Growth Alternative? http://t.co/ZdCAN2YMpn . Non-organic growth is important to startups.@digrestoration Too many fail because they just give up too early.10 Ways To Make Your Investor Pitch More Effective http://t.co/resLPfHwMT10 Keys To Turning Business Systems Into More Profit http://t.co/0hUMz5sbfL via @examinercomHave You Explored Every Business Growth Strategy Alternative? | Business Hub | http://t.co/vc6Luud0dx® http://t.co/qwOBrByJRK", 
    "@davegray": "RT @timoreilly: I'm liking “Old Work New Work” by @EskoKilpi https://t.co/D1B1vOmaok Uncertainty and improvisation vs attempts at certainty…RT @fuzzymath: Enterprise UX wrap-up, no. 5 of 5: \"Designing Organizational Culture\" and closing keynote from @davegray: http://t.co/oeMkxt…@jonnyschneider great!@Bopuc exactly! @EskoKilpiRT @KaiKaasalainen: @davegray 's framework: are you living with closed or open mind? Great presentation! #Tomorrow2015 http://t.co/x5ScAFo6…@KaiKaasalainen thank you!cc @jeffpatton @mnsbutt @SeiryokuZenyo @testobsessed @janetgregoryca @lisacrispin@EskoKilpi :) @TomorrowEvent http://t.co/c64T9Ot4Wa@TomWoodnutt thank you Tom!RT @xplane: Great interview with @davegray about The Connected Company. Check it out! http://t.co/8qg5Jgi3P4)@dgcooley we added a new feature today -- connector lines! :)@timokuntsi thank you!@EvetteCordy thanks, me too!Very excited to be interviewed by one of my heroes, @jurgenappelo !! https://t.co/5ZlIim1V1xWe just launched connector lines on @boardthing -- check it out! http://t.co/n0G9d9bZuaRT @panu_liira: Learning to #culturemap w. @davegray &amp; @ReaktorNow #systemsthinking #culture #leadership #Tomorrow2015 http://t.co/yjgY7ULc…RT @kMarju: Having an interesting day learning about culture mapping with @davegray : \"You can't create change without hope.\" #reaktor @Rea…RT @SamiHonkonen: Today: @ReaktorNow doing culture mapping with @davegray http://t.co/lZsCQRt1VoRT @akivanni: From @TomorrowEvent I have 2 thoughts, @petrirajaniemi \"real you\" and @davegray drawing obvious http://t.co/oDvz9Bt2kMRT @dorianshmorian: RT @davegray: The Four Illusions http://t.co/OtOZGutbZjRT @dgcooley: (Now with photo goodness!) RT @dgcooley: Boardthing gets a shout out from @anatinge at #uxss. Cc @davegray http://t.co/3QXknc…RT @reettahei: Great @nntaleb talk. \"There are two ways to face uncertainty. Either you hide in your cave or you make money out of it\" #Tom…RT @anniinasulku: Future is just a story. But it can happen that science fiction becomes science fact. @tuutipiippo #Tomorrow2015RT @hharjula: \"Structure drives behaviour. And most of the structures organizations have today were designed for yesterday.\" @SamiHonkonen …RT @TomorrowEvent: Thank you @petrirajaniemi for reminding us of what matters: acceptance of self and life as it is. #Tomorrow2015 http://t…RT @Sarimarjaana: @LauriAhonen, You're a hero! Great work on #Tomorrow2015 !!!@petrirajaniemi beautiful thoughts, beautiful talk.RT @sirukallstrom: #Tomorrow2015's been all about getting your shit together Today. Here's a write-up on my fave speech by @avantgame: http…@EskoKilpi I credited you of course :) @TomorrowEventRT @J_Lappalainen: Switched to drawing from tweeting during @davegray. Pretty strong points about beliefs&amp;learning! #tomorrow2015 http://t.…RT @LisaGri: Why smart people can't learn as mentioned by @DaveGray and @samihonkonen http://t.co/y9wusFQSLKRT @TomorrowEvent: Today is a day for #Tomorrow2015! The stage is full of daring ideas by i.a. @nntaleb, @avantgame, @davegray &amp; @Bethlehem…RT @ReaktorNow: “Treat an entrepreneur as a soldier who keeps on trying for the sake of others. Failure is respectable.” @nntaleb #Tomorrow…Another beautiful song by @annimattila at #Tomorrow2015 http://t.co/i6CdKzgsLF@avantgame I believe it was @annimattila\"The problem with universities is that there are too many professors.\" @NicholasTaleb #Tomorrow2015RT @avantgame: I'm ready to write the future at #Tomorrow2015! Hello Helsinki! http://t.co/9d65pFkEWO#Tomorrow2015 begins with a beautiful song. http://t.co/YiYmZ4yBA0Nice crowd here for #Tomorrow15 http://t.co/V7uuPgD6RNRT @NathanaelB: Awesome! @davegray is running Gamestorming workshops before #UXAustralia in Sydney, Melbourne and Brisbane http://t.co/pEZI…Tomorrow is today! http://t.co/z8syHBGJFSVery excited to be doing these Gamestorming workshops in Australia: http://t.co/VHdGe1DX6H and http://t.co/ANmVs6tJE1RT @UXAustralia: Because he's awesome, we've asked @davegray to teach his gamestorming workshop in Syd &amp; Melb: http://t.co/f4yxRQPJMeRT @EskoKilpi: The future of… everything with @davegray over dinner http://t.co/gVXlknNclJRT @allengunderson: A book every #teacher should read: Gamestorming by @davegray, @macgeo, &amp; @SunniBrown.  #ChangeMaker #bcedchat #collab h…Hello Helsinki!RT @KimmiCFlatWorld: “its only through bringing these different experts together that you can create something powerful.” @davegray http://…80 seats left for next week's Tomorrow conference in Helsinki. Join us? http://t.co/z8syHBGJFS@ev I love @medium as a tool, network, platform &amp; social network. Keep making the world better please.STL&gt;LGA&gt;JFK&gt;HEL long day ahead", 
    "@waltmossberg": "RT @verge: Apple made an app that transfers files from an Android phone, then tells you to recycle it http://t.co/komd1BMojQ http://t.co/6j…Angela Ahrendts Presides as Apple Opens Store on NY's Upper East Side http://t.co/6WbyXqyWP3 via @inafried http://t.co/660DrBAI69One in Four Mobile Apps Are Abandoned After a Single Use http://t.co/Mpygl75eyZ via @inafried http://t.co/qwJtxllDtgMy latest essay. Apple’s privacy-prottection agenda examined. http://t.co/vt7xIDR3gY http://t.co/Ioboec8nlK@stevesi Thanks, Steven,RT @jason_kint: Love it. As I wrote yesterday, Apple and Cook are one of the few giants to step up here. @waltmossberg https://t.co/oBtVobM…RT @moaz: Apple and privacy explained by @waltmossberg, the only post you need to read and block the rest of the noise... https://t.co/lueL…RT @KatieBoehret: Smart read from @mhbergen: @Google tries to breathe life into Android One, its bet on the next billion http://t.co/63o00K…Apple's latest product is privacy. My latest commentary.\nhttp://t.co/vt7xIDzrSo http://t.co/J5PXYJwZFNRT @Recode: BlackBerry may put Android system on new device (Reuters) http://t.co/5286UeTvMS http://t.co/vizhCZ0tjsRT @Recode: Twitter employees \"shocked\" by @dickc's departure #ThankYouDickC http://t.co/24qyYCJfLr by @KurtWagner8 http://t.co/1ZhbRrXhoADick and Jack speak: This CEO departure was part of the plan. No, really! http://t.co/Br8afojw4J via @karaswisher http://t.co/ALaq3I37WnRT @mhbergen: If you're concerned about tech and cars, do listen to this full interview between @waltmossberg and GM's CEO. http://t.co/HN8…RT @ziggeoinc: More live conferencing video news. How about video messages? Great read by @KatieBoehret http://t.co/rusNHqNTVH #tech #video…Full video of my Code interview with @GM CEO @MTBarra on tech in cars. #codecon http://t.co/LcMFQz4fL5 by @mhbergen http://t.co/9oATTvmTx7RT @pkafka: Apple TV service talks hinge on local, sez MoffettNathanson. Which you knew b/c you read this: http://t.co/jmc4uEd9od http://t.….@GM CEO @MTBarra at #codecon on saftey, robot cars and Tesla (Full Video) http://t.co/LcMFQz4fL5 via @mhbergen http://t.co/iMjAq8qGGo.@GM CEO @MTBarra at #codecon on saftey, robot cars and Tesla (Full Video) http://t.co/LcMFQz4fL5 via @mhbergenNot your average Skype call: @PanaCast &amp; @PersonifyInc soup up video chats http://t.co/fcxTlZs1ds via @KatieBoehret http://t.co/o4gDbgerh2@JournAwards @SPJDC @Recode All credit goes to our Awards guru, Deb Hoffman.RT @Tech_Dragons: .@GeoLangLtd crowned UK’s most innovative small cyber security company http://t.co/zynR9Yf9Y7RT @Recode: Spotify Has 20 Million Paid Subscribers http://t.co/VLhF0bSxHM http://t.co/8NBVbZ0r7mRT @Recode: Xiaomi hires Qualcomm China head to oversee relations with partners http://t.co/gPuSWtzEWo by @InaFried http://t.co/9WM7rGDU0aRT @Recode: Got $20,000 to spare? That's how much Microsoft's 84-inch Surface Hub will run you http://t.co/5grakJSPH9 by @LaurenGoodeRT @Recode: Twitter advertisers can now target based on which apps you've downloaded http://t.co/vkFRJeW3Ga by @KurtWagner8 http://t.co/cvK…Sen. Elizabeth Warren’s fiery Code Conference talk (Video) http://t.co/oYyp8sLdkm by @karaswisher &amp; @waltmossberg http://t.co/TB2qrHF3nCA fond farewell to great colleague @BonnieSCha as she decides to leave tech reviewing to head off to a new career. http://t.co/QFP10qYhPD.@bonniescha recalls some of the most memorable moments of her 12 years as a tech reviewer. http://t.co/9TvcFceLbZ http://t.co/Doxsu0rP77Mary Meeker's tour of the 2015 Internet Trends report (video) #codecon http://t.co/CeYa0mjySW via @lizgannes http://t.co/YvKXhwkETr@KatieBoehret Ha!Since WWDC has the world’s largest collection of Apple Watches, will everyone stand up en masse at 10 minutes before each hour? #WWDC15Apple To Launch New Flipboard-Like App, While Newsstand Goes Away http://t.co/G4gZXad9zF via @pkafka http://t.co/fHjX9PX7C5@DeadTechnology @united @verge Nope.RT @KatieBoehret: 5 yrs ago today, @waltmossberg &amp; I were at Apple's #WWDC &amp; @karaswisher caught us (&amp; Steve Jobs) on video http://t.co/agL…RT @RecodeEvents: Full video of Snapchat CEO @evanspiegel's interview at Code Conference 2015 http://t.co/MwfodfxOwN by @karaswisher @waltm…Apple's new music service relies on features instead of free. Tough pitch. http://t.co/Sq6Y5QlrhB via @pkafka http://t.co/rLY6zhggPl@BrysonWebster @united @reckless @verge Only because United literally used that term in its message stating its earlier refusal to load it..@united @reckless United must have removed @verge from blacklist. It's loading fine now on iPad Safari &amp; Mac Chrome on flt 310 IAD-SFO.Sony Music CEO pre-announces Apple's new music service: \"Happening Tomorrow.\" http://t.co/PITeDXawhq via @pkafka http://t.co/TykQCHlRGc@aapltwits @united @verge @reckless EVERY news site contains streaming videos. So block the videos, not the sites. And why single out one?@StevedeMena @Delta @AmericanAir @united @verge @Gogo No. They don't. And United in particular mostly uses something else.@bsanks @united Cool. So we have 1 real-time @verge example from @Delta and 1 from @AmericanAir. Is @united alone in banning it? @reckless@united @reckless @alexia Thx. Please post explanation here publicly. 4th United flier just posted same blocking of @Verge.@AaronKlein Thx. Anyone else?Curious if anyone on @Delta or @AmericanAir or any other airline besides @united has been blocked from reading @verge on inflight wi-fi.@united @reckless /2 I don't want a refund. I want an explanation. At least two other tweets I've seen here have reported same experience.@united @reckless Let's do it in public. You blacklisted @verge for me on your Wi-Fi May 29 on #1539. Again: why? http://t.co/lxMtZeTSptRT @karaswisher: As ad sales continue to suffer, Ned Brody also poised to depart Yahoo, the latest in a line of sa… http://t.co/bJ43KGmXtd …@jessedacri When I encountered it, it was United’s own Wi-Fi..@united We now have 2 confirmed reports that your Wi-Fi blocks @verge, which is neither a streaming nor VOIP service. Why? cc @reckless", 
    "@michaeldell": "Well deserved recognition @MarieMatDell!  https://t.co/v9JyvCd8QY.@Dell is Committed To Serving Our Customers and Partners http://t.co/ppmku2lYtmWe're hiring thousands of new team members in sales worldwide. Jumpstart your career here http://t.co/epEoi9uS9L http://t.co/9dcgHugcU8Texas wins again... 2015 Best State for Business @GovAbbott http://t.co/UgYD4m0CDw http://t.co/TLQBUco5OtDell Geeks Out at Enterprise Innovation Day http://t.co/PehHZX33wK #dellgeeksoutRT @JeffJedrasITW: At @Dell's engineered solutions lab, they say demand for customized solutions is rising. #DellGeeksOut http://t.co/ITQ6N…RT @Dell: #DellGeeksOut at Enterprise Innovation Day http://t.co/CR8KJ1lGrr by @orchid8 http://t.co/QPJLhzACEzRT @Dell: Our new #DellInspiron 5000 Series notebooks now available in US, Canada, EMEA and APJ regions! http://t.co/mvW9zkB2iZ http://t.co…RT @JohnLHAtDell: @Dell @Intel @ThingWorx innovating on #IoT: Making it work for real people http://t.co/jmY8tUyY5q via @ZDNet &amp; @ColinBark…10 million small businesses trust @Dell to help them thrive and seize new opportunities! http://t.co/IHqJjk7uTH #DellARCRT @JClarkeatDell: .@tmyerson @Dell excited 4 Win 10, too! We'll be ready Day 1 w/ full range of Win 10 offerings.  https://t.co/PnvVLqFrHTRT @JClarkeatDell: #DellXPS 15 = world's smallest 15\" laptop! InfinityEdge display optimized 4 @Windows 10. Thx Nick-great pic. https://t.c…Learn about career opportunities @DellSecureWorks https://t.co/0SfGhw08ZSA Conversation with Clay Johnston, Inaugural Dean of @DellMedSchool http://t.co/S8wBjOhTLp #FutureReady http://t.co/NuWyeDe38i$14 trillion in assets protected daily by @DellSecurity @dellSecureWorks  http://t.co/ZWVQMThEvH #DellARCA few weeks ago several APD SWAT team members dressed as Super Heroes &amp; visited @DellChildrens #WhyIWearTheBadge https://t.co/ytFDraItauDell is the leader in Gartner's Magic Quadrant for Modular Servers  http://t.co/IEk9j3jYMx #DellARCDAAC’s a Wrap: Highlights from the 2015 Dell Annual Analyst Conference http://t.co/fCSEu0pheY98% of Fortune 500 companies use Dell to stay ahead of the competition http://t.co/nqckgOPja1 #DellARC.@DellSecureWorks experts... How to Protect Your Medical Records From Malicious Hackers http://t.co/HbheQ3lkfA http://t.co/BgAlfaKFpbInsights @DellSecureWorks #Cybercriminals covet healthcare data. Not ready = critical risk http://t.co/XbFjTRscLO http://t.co/NfaU5qoKfzHow @KMCControls partnered with @DellOEM To Deliver a great #IoT solution https://t.co/rVdfBOfe1uWe don't report to shareholders as private company. Now Dell Launches First Report to Customers http://t.co/Tf3HlbQCBN #DellARCRT @Dell: Dell Launches First Report to Customers http://t.co/tteMRmz2bk by @KarenDellCMO #DAAC http://t.co/y8thhdJMCmOur Annual Report to Customers http://t.co/thAIKMypeh.@Alienware LIVE with Special Guest @JesseCox http://t.co/ihfchX11W2 via @TwitchRT @Tiffani_Bova: \"As a private company we have the freedom to make investments others aren't able to make to plan for the future\" @Michael…RT @Dell: What Got Us Here Won’t Get Us There: A Changing Market Requires New Thinking http://t.co/g5gjVfjJI6 by @drsumande http://t.co/Uy6…To the industry analysts joining us in Austin for #DAAC, welcome! http://t.co/2KoUEfVgFASupport entrepreneurs and the jobs they create. Sign the petition for Goal 8. #entrepreneursUNite https://t.co/28tywYTJnlStarted @Dell in my dorm room 31 years ago. Revenues so far $880+ billion. Behind each $ = customer success20 years ago we started http://t.co/yCTbsF5brG. 6 months later $1 million per day. Now about $15 billion per year. Keep it going @walsh_Are you a #CollegeGrad wanting to start your career in #Sales w/ potential to grow? Apply: http://t.co/8UuVrnPHGe http://t.co/lOyRWIOFhvRT @Dell: Bringing Dell Shoppers New Levels of Convenience http://t.co/oKGLYb3BLN by @walsh_ http://t.co/GT13xLvS9mRT @CareersAtDell: How can you apply for a position at @Dell? Easy! Here we walk you through the process step-by-step.  http://t.co/rGjOax8…Saijo Denki to offer 'intelligent' Internet-linked air-conditioners powered by @DellOEM http://t.co/qmNAHKuIDsThanks to our customers in Brazil for making Dell #1! Obrigado! http://t.co/wCwEOEQLNJIoT: generating data 4 analytics/value creation. Sensor cost down 2X, bandwidth down 40x, processing 60X. IDC: 85% devices not connectedWe're hiring thousands of new sales people to support growth @Dell globally. It begins here... http://t.co/Hez8KBJFPjHonored to speak @xprize Visioneering 2015 Vision Talk: The Joblessness Problem https://t.co/LbCctPqqfeForget SXSW - Austin's Most Radical New Idea May Be In Medical Education @DellMedSchool http://t.co/YQJ90m1GCb http://t.co/HDx8lbjAujResearch @DellSecureWorks uncovers new #TeslaCrypt file encrypting malware http://t.co/WSTYa59F6j  #Ransomware http://t.co/YgXoegFPf7We're hiring thousands of new sales people to support growth @Dell globally. It begins here http://t.co/N6oRgScl4E http://t.co/igoczcGAy0Cloud services in your datacenter. Microsoft @Azure Cloud in a Box Powered @Dell http://t.co/MB5zZqxg0K http://t.co/BYgPCcXzbLGeneral Stanley McChrystal on Cyber Warfare: Going to be central to every war we fight in the future http://t.co/xpS8O207zGDell Inspiron Micro Desktop small, mighty, affordable plus free upgrade to Windows 10 http://t.co/JSjSnYdiBj http://t.co/i5owywngOeRT @Dell: Our very own @KarenDellCMO was nominated for the @usefulsocial Corp Social Media Leader award - cast your vote now http://t.co/RK…Proud to support 412K students + 17K teachers @SBCSS. High grades for @DellSoftware http://t.co/xSy5Xgietz http://t.co/X6VKdYviKGRT @Dell: Yes, #OpenStandards could be the key to making your enterprise more efficient. Check out @ncdex's #DellStory: http://t.co/1ZYaOWN…Green lights for Google self-driving cars http://t.co/mN99itZf8H https://t.co/POUo3F7bHc", 
    "@TedCoine": "The 10 WORST Popular Leadership Quotes - Jesse Lyn Stoner http://t.co/FGIkmmYj7F via @macdarling #leadershipMLK was impatient to make a change. You should be, too! Learn more http://t.co/QgXbmrAMXB http://t.co/J6CAF2Hz2vDear CEO: Who Tells You When Your Baby Is Ugly? - OPENforBiz http://t.co/HT3z4v9zmA #CEO #communication #leadershipOmission is obsolescence. Not playing your part, in the eyes of the social- savvy job seeker, equates to apathy. http://t.co/W7BpctF1XeB2B E-Commerce - Thriving in the brave new world of B2B - Internet Retailer http://t.co/XsXUX2vyAc via @justin_king #B2B #ecommEmployee advocacy is too complicated. Let’s call the whole thing off by @iVidar -OPENforBiz http://t.co/9TCW54oUCo #employeeadvocacyQuick Quiz: Where are you in the Content Marketing Journey? http://t.co/KzbVrI99Am #content #marketing http://t.co/VYaJBBSjU0Building your personal brand is a marketing job – but it doesn’t have to feel like it http://t.co/sL67ywPgJw #personalbrandPlease God yes!!! RT @Timothy_Hughes: With long DMs coming, Twitter needs better spam filters http://t.co/7tCAucAWz2 via @thenextwebSocial is change for the good. It is how business is done. http://t.co/jnIf3Dco1J http://t.co/umAfBMdqXiAre you dyslexic like @RichardBranson, @CharlesSchwab, @TheSharkDaymon ..&amp; me? (23:15) #podcast w @djdoug http://t.co/a808MOzStaSimple Math - Company that manages its Human Capital most efficiently, cost-effectively, will be most profitable http://t.co/M2ZKfpfXFS5 Big Data Hadoop Use Cases for Retail http://t.co/iAqmutK3KV via @OperaSolutions #bigdata #retailThe single best way to become knowledgeable on social? Mentors. http://t.co/W7BpctF1Xe@DanAldridge1 Thanks Dan! Is your summer off to a good start?@Choypw :)RT @Choypw: Empower your employees to be the voice of the #brand. They’ve got audience and credibility http://t.co/Cdza6EWH8s@samu_CPH Thank you Sascha! Huge honor :)RT @samu_CPH: A World Gone Social - This book is an eye opener  http://t.co/Ni11B8u5BE #SocialCEO #leadershipLeadership Ethics: It Doesn’t Depend - OPENforBiz http://t.co/acxzaHzvkK #leadership #ethics@Jshetty1 @thomaspower @NatSchooler @Timothy_Hughes @BenSalama1 @BaijuSolanki How does that compare to Apple?@tannistho :).@MicJohnson True, but you know what? Once an employee has left for a better firm, the muzzle is off. #delayedkarma@Jshetty1 @thomaspower @NatSchooler Totally no surprise.5 Digital Marketing Trends That Will Disrupt Your Business http://t.co/fAagH2FfrT via @JimClaussen #digital #socialbiz\"In Praise of Failure: Mess Up &amp; Fess Up\" by @macdarling http://t.co/uOXP49AOTe #leadership #quote http://t.co/MbnCaVY37JSocial media—the virtual watercooler—where employees’ voices aren’t just heard; they’re amplified. http://t.co/ylc6VsJTmUDo you really think the tortoise beat that hare in Aesop’s fable? Come on! http://t.co/QgXbmrAMXB http://t.co/x5Y14fBntLYour skills may have an expiration date, but your reputation will never lose importance http://t.co/wsCKAHgDQx #personalbrand #careerCulture: Why It's The Hottest Topic In Business Today http://t.co/azKqyKBkzn via @macdarling #culture #engagementYou’re the #CEO, shouldn't you be on social? #SocialCEO cc @FirstPointMktg @KhalidHamdan0 http://t.co/yj27xlbB5cTrusted Experts engaged in social media are 135% more effective at generating leads by @sfemerick -OPENforBiz http://t.co/J7t5Arc1Tt #socbiz75 percent of the American workforce is composed of job seekers. http://t.co/W7BpctnqyEDoes #LinkedIn load glacially slowly for anyone else?@thomaspower Ken Milloy is the guy who left a comment on the meddle I created for your interview. https://t.co/KX1rFkQkzvThe 7 most interesting social media stats and what to learn from them http://t.co/qZQ4c8SZIU via @iVidar #social #statsQuick Quiz: Where are you in the Content Marketing Journey? http://t.co/KzbVrI99Am #content #marketing http://t.co/1dOV9mBzpkMake the world a better place. Be a good person b/c you can. (31:00) The Nice Guys Biz #podcast w @djdoug http://t.co/a808MOih4A6.4M to lose $1.7B per month if ACA Subsidies Ruled Illegal http://t.co/036p6eiCrr via @OperaSolutions #data3 brilliant LinkedIn summaries that will inspire you to update yours http://t.co/8DeUH3dqPF via @conpsweeneyGood karma circles back – that’s the power of OPEN. http://t.co/1XOfKahRxs by @robbiecat #social http://t.co/YB8XMiSOkrEmpower your employees to be the voice of the brand. They’ve got audience and credibility #employeeadvocacy http://t.co/Cdza6EWH8sSometimes It Takes A Crawl To Win by @KimunyaMugo -OPENforBiz http://t.co/JfY6bVAUMN #perserverence #goals #personaldevelopment9 Ways to Turn Content into Leads | Bulldog Blog http://t.co/pieHhOLG4w via @StefanieAtDell #content #leadsTo be successful, we have to be open—both personally &amp; as a company culture. http://t.co/W7BpctnqyERT @KhalidHamdan0: C-Suite engagement via #Social: Why it’s not a choice anymore #socialCEO http://t.co/vjk7QpngOQ@seams16 Thanks Eric! I have a new website, though: http://t.co/18jXpuwf9y@SocialCopy Isn't it great, Reginald? Outstanding post, too.3 tips to help you get the right internship, and make most of it http://t.co/JvqqrtkUom #career #internship@thomaspower It would be great to read your reply to Ken in the comments of that meddle. He's an insightful leader.", 
    "@digiphile": "@hamishmckenzie broadcast networks are generally one 2 many, with no feedback mechanisms. I can’t broadcast back to NBC, but I can to you.@hamishmckenzie @Ev said for years that @Twitter is an info utility. That’s how I use it, although the social aspect has always been there.@chrismessina not in my experience.@jackshafer That might have been a tweet in my draft folder that didn’t escape.@jeffsonstein @auradeluxe it’s lovely to dream, but some cowpaths will always get paved, even virtually.@skram @charlesornstein yes.@jeffsonstein @auradeluxe No way! There’s waaay to big of a market for VR porn for someone not to serve it, even if Oculus chooses not to…@amvandenhurk @iaivanova they sure are. I didn’t accept the @HuffingtonPost gig until I knew who would be my go-to. :)@mariana_farinha @HuffingtonPost thanks!Cool thing about settling in at @HuffingtonPost: I keep getting edited by new folks, like @iaivanova, who make my word salads so much better@BrianForde @anildash @SocialSecurity tell Congress.@jess_jacobs thank you!@tophtucker @ftrain @djacobs @stephcd @JPaskin ummmmm\"parents are right to be concerned about the privacy &amp; confidentiality of student data\" http://t.co/KnWs4xHIpU Risks &amp; rewards, entertwined.@konklone what http://t.co/puLAJxlSwt is tax day?@lydiadepillis would have been a couple degrees riskier for @HillaryClinton to use athropogenic :)@ftrain can you link to the part of the article that will help the general public understand this tweet? :)@tjl @anildash I worry about what happens when the Aadhar number in India is tied to digitized biometrics. Hope they encrypt it all well.@tjl @anildash Sure, KBA is what tripped IRS up: http://t.co/SdcySctuW7 Need multi factor auth for PII access. Hopefully, they’ll do it now.@BrianForde @anildash I don’t see @SocialSecurity moving to the blockchain for a while yet, but .gov can adopt this: http://t.co/hmY2jOS5XP@anildash 80MM @SocialSecurity numbers *were* leaked in the Anthem breach: https://t.co/ysGOhQbafS 1st step: reissue. 2nd: use alt ID systemTIL that you *can* get a new @SocialSecurity number, for free: http://t.co/4rE6BQ63aL Demand rising: https://t.co/aLu135vWizRT @SuB8u: Love this! Internet of self-aware, screaming-for-attention Things. Potholes that tweet.\nhttp://t.co/e2dE8HaJ9T\nhttps://t.co/t9nv…@jess_jacobs I think you meant this story? http://t.co/mlODY4EhsV :)@mathewi ditto!@mathewi we’re 19 years behind you. I hope she (and we) can do as well. Congrats to her!Rising poll numbers &amp; large crowds have a way of telling their own story. http://t.co/R1GoE5tcDl https://t.co/1XEqsLGP6F@Brad_Pierce Prior to this breach, I wouldn’t have thought there would be enough momentum, despite the volume of ID fraud. Now, maybe.@govgrrl I wish I thought otherwise. Hope for the best, prepare for the worst. I wish you and yours well in this latest challenge.Take a deep breath, pour a stiff drink (if you partake), hope this is better than it looks: http://t.co/MHiebYtgHz https://t.co/xeB3T1bNYn@malcfairbairn that @xkcd includes a note comparing ionizing radiation exposure levels to that of cellphones (see top left) - it's relevant.Livestream of @HillaryClinton at #RooseveltIsland http://t.co/4NLGoAmnyf  Campaign debuted on @periscopeco today, but main event on @YouTubeThe @DallasPD is using Twitter &amp; a blog well during #DallasPDShooting https://t.co/qHtHH52DbO https://t.co/rhFpLU9RBFVia @OMBPress, @tonyscottcio ordered an #infosec \"sprint,\" including MFA (mo link). Good idea. http://t.co/J41XufGZyM http://t.co/M4u2i9G9jT@Integrilicious @EPluribusUnum tastyToday, I learned @rachel_nagler is a consummate pro, @Tyrangiel reads Dostoevsky, &amp; @joshuatopolsky is hilarious. (I knew @ftrain was funny)@kragen @harper It would still have been accurate. I went online for the first time through a BBS, in 1993.@kragen @harper wrote that he told other kids about an anarchist website. I think that it was fair to describe that as \"the Internet.\"@andrewphelps golly. the WAIT WAS WORTH IT.Imagine if @harper had been prosecuted under #CFAA as a kid for telling kids about the Internet. https://t.co/ASF6hKXDoa@apaprocki @ftrain Since you’re (obviously) listening, can we chat? hit me at alexander@huffingtonpost.com if so@apaprocki HAH. I'm actually laughing out loud. Was a joke about @ftrain’s bio. What I’m actually after is an interview on tech behind story@ftrain I found a typo. Please check your inbox. :)\"Trying to articulate culture really is harder than trying to explain the technology itself”- @ftrain http://t.co/PY0RNyYE6t@BethanCantrell @csoghoian as I recall, the librarians were some of the most ardent opposition to aspects of the PATRIOT Act.@BethanCantrell @csoghoian the analog version takes more effort, particularly if libraries resist cameras and sensors in the stacks. :)@csoghoian like being able to safely read a book in a free library without anyone seeing what you chose or reading over your shoulder?@csoghoian Push through a Constitutional Amendment on privacy + $10B for dedicated lobbying group that protects strongest interpretations?@PatrickRuffini @murphymike has been quiet for 23 minutes… Perhaps someone from @RandPaul’s office let him know what’s up.@AntDeRosa if only it were possible to have multiple clients, products &amp; apps based on an API.", 
    "@zappos": "Red, White and Boots. #Patriotic http://t.co/jhcaPGJYd6 http://t.co/VxyW4CxOtH@d_lazarin Haha!! That's awesome! We always love to have a good time. thanks for being awesome =)@KallMeKowgirl Yes we do! We get all of our product straight from the manufacturers!@Terra_Forever Aww yay! Congrats to you and your new adventures! That's so exciting =)@Pix77 We love it, Pixie! We're always happy to be here for you! We'll be sure to let Cassandra know she did a great job! Have a fun weekend@AliLozoff Here is a link for Urban Outfitters. You can see a men;s 5.5 = a women's 6.5. Just an example! http://t.co/ZCF0sBkfUW@AliLozoff Here is a link to the ones we have in women's: http://t.co/0iwxNNw5NK\nTypically, women buy the men's size and adjust the sizing!@AliLozoff @case_face Anytime! Let us know if you ever need help!! We love shopping =)@case_face @AliLozoff We do have them if you want to take a look! Here is the link for you: http://t.co/Ew8T6MyXho@BelleDuJourNYC It' always our pleasure! We're glad we could help =) Hope you have a fantastic weekend@ashleybohunk Oh darn! Do you mind DMing us and we'd be happy to see what we can do!@Terra_Forever That's the awesome part about free exchanges and free returns! =) Online shopping can be tricky, but well worth it!!What an amazing story! Have you ever felt this lucky?  https://t.co/x2gkA2kNR7@tinaxchrissy Hey! It sounds like you may be looking for the Birko Flor styles. Here is a link for you: http://t.co/K7WoIN6za9@KimSteinmetz Yay! We hope Synna showed you a great time =) Thank you for visiting our campus!@gladiatorinatee Whooo! Congrats! We look forward to seeing you in the office =)Peace, unity and style. #JustBreath #Alo http://t.co/wL8hTnXCZN http://t.co/qEkFuz8iTW@BiggerEarl That's awesome, EJ! We definitely try! Enjoy your order. Now you can rock it for the weekend =)@_BuddhistPunk_ Hey, it's our pleasure! Thank you for shopping with us! It's always nice when your toes are comfy. Makes for a great day! =)@MarissaPixie114 Nice! There isn't much better than getting some new shoes! You're starting the weekend off right =) Enjoy!@KateSirc Whoop whoop! Just in time for the weekend! We are happy to hear you're getting your order a bit early! Have a great weekend =)@DeviledMegs Thank you for letting us make it up to you, Megan! We truly appreciate you!Dependable gifts for dear ol' Dad. http://t.co/2Xn2mXPnFM #FathersDay #AdventureTime http://t.co/iPfcCLr2w1@_FashionMethod @DSWShoeLovers @ModCloth We are happy to be sandwiched in between two great companies!  Hope you enjoy your new shoes!@monicafussinger We will get it to you as quick as we can! #noonelikeswaiting@MarkMillerLV Thank you so much, Mark! Your kind words have put a HUGE smile on our faces! We appreciate you! :)@redmanpdx We may be biased, Elizabeth, but we like them all! :)@monicafussinger Hi Monica! On the shopping cart screen, in the top right corner, click on Gift Codes. You can add your card # there! :)@keisenhardt You're welcome, Kristina! And thank you for taking the time out of your day to tweet us. We appreciate it!@jromaniuk So nice of you to say, Justin! Thank you for the kind words! We truly appreciate it!@dmiintl Awww thanks so much! We always try to remain present and available for customers whenever they need us! Thanks for sharing!@DeviledMegs Oh no, we are terribly sorry your shoes arrived like this! Can you please DM us so we can take care of this right away?It's always the right time to enjoy life. #chill http://t.co/g4X82mCuFP http://t.co/nD8sn10tMi@shrinerp Aww, it's not intentional, Paul! But can we say you have excellent taste in music. We love Mumford &amp; Sons! 🎶@robert_neal Maybe we'll do a sneak peak of our location for you. Hmmm, maybe even a little nerf gun action. Who knows? haha Stay tuned!@adnrcddly What? We're sorry about that, Adrian! Do you mind DMing us, and we can take a look at it for you!@diener We're always happy to get you taken care of, Austin, and we apologize about the defective shoe!@beefgalbrooke Yay! We're so happy to have helped you out, Brooke! Congrats on your wedding and remember to enjoy every second! =)@NattyWasHere Nice! Brooks are absolutely amazing! Have fun and enjoy the race! #getyourtrainingon@_JonathanGreen_ We try to make your shopping experience as easy and hassle-free as possible, Johnathan. Thanks for the kind words!@OrOzXD Mr. Nice Watch!@Jim4612 We apologize once again for our first error. We're happy to hear the issue was finally resolved. Sorry for the inconvenience.@ch00chelo If anyone catches you wearing those shoes they might have a nice snack of peanut butter and jealous! #JELLY@karencoyne We never hope for that, but we hope you'll be WOWed either way! =)@karencoyne We're sorry that you were having trouble with your return, but we're glad to have gotten it straightened out. We're here to WOW!Ready. Set. Fun! #running http://t.co/L55oZgmphD http://t.co/brUeXGuIiU@HRodg There is nothing ridiculous about it, Hunter! We like you back =) Thanks for the love!@Kymberlie It can be quite a task to find shoes that feel good and look good! Glad to hear you found some on our site! #LoveIsInTheAir@MuxyPowers Whaaat! That's awesome! We're always happy to help! There isn't much better than shopping with a gift card! Enjoy!@muffetdunn Whoop whoop! We are happy to make your day a bit more magical! Only the best for our VIP customers! =) We appreciate you!", 
    "@fredwilson": "@bijan sonos outside is the best. Here's mine http://t.co/OaGfAJdxiGVideo of the Week: Nick’s OuiShare Fest Talk http://t.co/bzO8HnaZus@Jim_Edwards @BradUSV I don't think that properly characterizes our conversations and concerns but you can read into it what you want@Jim_Edwards i would not say \"moral qualms\"  pls read my partner @BradUSV blog post on the issues we \"wrestled with\" https://t.co/AZVDSdmH7BFuture Friday: OpenBazaar and OB1 http://t.co/cUbmEDchi6@emilyjwils for NYC or something else?@eriks i have learned not to assume anything ever8/ fin7/ all three of them were exactly what Twitter needed at the time6/ @dickc scaled Twitter into a massive business and valuable publicly traded company5/ @ev built Twitter the company4/ @jack gave Twitter its initial product market fit3/ Twitter is the perfect example of that2/ I have found the opposite is mostly the case1/ the story when a CEO transition happens is always \"she or he didn't do a good job\"I passed this walking to work this morning. Looks like Twitter has moved into their new NYC offices http://t.co/FtU5yYibjBIt turns out the schwag is often more durable than the company  http://t.co/7pE1RAfGfk@aweissman we jinxed em@LocoNinja19 https://t.co/C2yJ8TIG98@simonhg i usually don't select a reward. the jpy comes from making something possible@Manolo @kickstarter just did 3. the pill doc http://t.co/YJtMYk9vLG, john lee hooker  http://t.co/7KfimKI1uM &amp; WLPN http://t.co/927e8cfhBlbacking a @kickstarter project always give me a little boost of joy. it's like an ice cream cone, often about the same price, and healthier@kirklove mazel tov!NYC tech companies that want to invest in a diverse local talent pipeline should do this https://t.co/3350tLoHKXRT @usv: New topic: “How Decentralized Networks Can Be Governed“ https://t.co/hmXRpdHXS0.\n\nAbsent a central authority, who enforces good be…The Freelance Economy http://t.co/bbReUgUPTe@emilyjwils @thegothamgal #travelissues@brian_armstrong @TeslaMotors they are awesome. i use them all the time.@whitneymcn no. Being out clubbing until 2am last night did@nickgrossman - The Best of Afrotrance 1999/2009 by SiMoNe Ndj on #SoundCloud\nhttps://t.co/tzmUjmEJVN (cc @smart @aweissman )@nickgrossman @smart  sent me this - (Tonka Afro-Trance Instrumental Mix)  #SoundCloud\nhttp://t.co/lCM7KhiBHb@splice just another day at work ;)@AndySwan if only that were true.The Great Decoupling http://t.co/9MgHn4RIck@aweissman a few saw that coming The whatsapp founders. The Kik founders. The groupme founders. Its always the entrepreneurs not the punditsRT @aweissman: \"The basic unit of communication has become, not video or even voice calls, but text messages.Who saw that coming?\" http://t…A day I discover a brand new Destroyer song on #SoundCloud is a great day \nhttps://t.co/IbLksDO8HABeam http://t.co/O71BsSbRv7Good synopsis of the challenges facing the current TV entertainment business https://t.co/IJg3CEPwy1@aweissman @liamboluk @JasonHirschhorn  true for all incumbents \"By the Time You’re Ready for [whats next], You’ve Already Been Supplanted\"What Can It Be Worth? http://t.co/0zl4psIR9pRinse And Repeat http://t.co/Z2oaabVgu1Video Of The Week: The New York Public Library Bitcoin Discussion http://t.co/UdfJcnvnCX@bitstein thats my comment system. Sorry about that. Will fish it outRT @nickgrossman: Venture capital vs. community capital - on networks, economics, power and decentralization. my talk frm #OuiShareFest htt…RT @alexiskold: Learn more about @techstars NYC Fall 2015 Program http://t.co/aRmi8zYcfQ and apply http://t.co/bEu90WeeAF to accelerate you…The Apple Watch - How Is It Doing? http://t.co/7d4kjxl6dXCSNYC At Two http://t.co/2kfK1DhWMO@sukhindersingh i was in meetings all day and finally had the chance to skim the comments and saw you in there replying. thanks so much.@sukhindersingh she got to twitter a bit late so she's @thegothamgal and you are very welcome!"
}